{
  "name": "Dell i3530-7728BLK-PUS",
  "price": "799.99",
  "rating": "4.6",
  "reviews": "68",
  "specs": " Inspiron 15\" Touch Screen Laptop  -  Intel Core i7 with 16GB Memory  -  1TB SSD  -  Black",
  "product_url": "https://www.bestbuy.com/site/dell-inspiron-15-touch-screen-laptop-intel-core-i7-with-16gb-memory-1tb-ssd-black/6610571.p?skuId=6610571",
  "full_specs": {
    "Screen Type": "IPS",
    "Screen Size": "15.6 inches",
    "Screen Resolution": "1920 x 1080 (Full HD)",
    "Touch Screen": "Yes",
    "Refresh Rate": "60Hz",
    "Brightness": "220 nits",
    "Processor Model": "Intel 13th Generation Core i7",
    "CPU Base Clock Frequency": "1.3 gigahertz",
    "Storage Type": "SSD",
    "Total Storage Capacity": "1000 gigabytes",
    "System Memory (RAM)": "16 gigabytes",
    "Graphics": "Intel Iris Xe Graphics",
    "Display Connector(s)": "1 x HDMI 1.4",
    "Battery Life (up to)": "9 hours",
    "Battery Chemistry": "Lithium-ion",
    "2-in-1 Design": "No",
    "Backlit Keyboard": "No",
    "Brand": "Dell",
    "Model Number": "i3530-7728BLK-PUS",
    "Product Name": "Inspiron 15\" Touch Screen Laptop - Intel Core i7 with 16GB Memory - 1TB SSD",
    "Color": "Black",
    "Year of Release": "2024",
    "Display Type": "LED",
    "Synchronization Technology": "Not Applicable",
    "Display Surface": "Anti-glare",
    "Color Gamut (NTSC)": "45 percent",
    "Processor Brand": "Intel",
    "Processor Model Number": "1355U",
    "Number of CPU Cores": "10-core",
    "Number of CPU Threads": "12",
    "CPU Cache Memory Level": "L2",
    "L2 Cache": "12 megabytes",
    "Neural Processing Unit (NPU)": "No",
    "Solid State Drive Capacity": "1000 gigabytes",
    "Solid State Drive Interface": "PCIe",
    "Type of Memory (RAM)": "DDR4",
    "System Memory RAM Speed": "2666 megahertz",
    "Number Of Memory Slots": "2",
    "System Memory RAM Expandable To": "16 gigabytes",
    "Graphics Type": "Integrated",
    "GPU Brand": "Intel",
    "Operating System": "Windows 11 Home in S Mode",
    "Operating System Architecture": "64-bit",
    "Number of HDMI Outputs (Total)": "1",
    "Number of DisplayPort Outputs (Total)": "0",
    "Number of Thunderbolt Ports (Total)": "0",
    "Number of VGA Ports": "0",
    "USB Ports": "1 x USB-A 2.0, 1 x USB-A 3.2, 1 x USB-C 3.2",
    "Number of USB Ports (Total)": "3",
    "Number of USB-A Charging Ports": "0",
    "Number of USB-C Charging Ports": "0",
    "Headphone Jack": "Yes",
    "Microphone Input": "Yes",
    "Wireless Connectivity": "Bluetooth, Wi-Fi",
    "Wireless Standard": "AX",
    "Wireless Networking Standard": "Wi-Fi 6",
    "Number Of Ethernet Ports": "0",
    "Network Connectivity": "None",
    "CPU Cooling System": "Air",
    "Power Supply Input": "DC jack (4.5mm)",
    "Power Supply Maximum Wattage": "65 watts",
    "Battery Cells": "3-cell",
    "Number of M.2 Slots": "2",
    "Number Of Internal 2.5\" Bays": "0",
    "Front-Facing Camera": "Yes",
    "Front Facing Camera Megapixels": "0.92 megapixels",
    "Front Facing Camera Video Resolution": "720p",
    "Built-In Microphone": "Yes",
    "Customizable Keyboard Lighting": "No",
    "Foldable Screen": "No",
    "GPS Enabled": "No",
    "Touchpad Type": "Precision",
    "Media Card Reader": "Yes",
    "Media Card Slot": "Secure Digital",
    "Customizable Case Lighting": "No",
    "Audio Technology": "MaxxAudio Pro (Windows) / Stereo Speakers (Windows)",
    "Speaker Type": "2 W x 2 = 4 W total",
    "Windows AI": "Copilot",
    "Cable Lock Slot": "None",
    "Stylus Dock": "None",
    "Product Height": "0.75 inches",
    "Product Width": "14.11 inches",
    "Product Depth": "9.27 inches",
    "Product Weight": "3.66 pounds",
    "ENERGY STAR Certified": "Yes",
    "EPEAT Qualified": "Yes",
    "EPEAT Level": "Silver",
    "Included Software": "McAfee+ Premium 30-day trial, Microsoft 365 30-day trial",
    "Optical Drive Type": "None",
    "Numeric Keypad": "Yes",
    "Stylus Included": "No",
    "Warranty - Parts": "1 Year Mail In Service",
    "Warranty - Labor": "1 Year Mail In Service",
    "UPC": "884116430728"
  },
  "all_reviews": [
    {
      "title": "Excellent",
      "body": "I’ve been using the Dell Inspiron 15-inch laptop equipped with an Intel Core i7 processor, 16 GB of RAM, and 1 TB of SSD storage, and I can say with complete satisfaction that it has exceeded my expectations.\n\nFrom the very first use, the system’s fluidity is evident. The Core i7 processor delivers excellent performance, ideal for both demanding tasks and everyday use. The response speed is impressive, allowing me to work without interruptions and run multiple programs with no slowdowns.\n\nIn addition, the 16 GB of RAM provides a smooth multitasking experience, and the 1 TB SSD storage not only ensures plenty of space but also allows the system to boot up and load files in seconds. It’s truly a pleasure to work with such a fast and responsive laptop.\n\nAs for the interface and design, it’s modern, intuitive, and comfortable. Everything is designed to enhance the user experience. I also have to highlight the graphics card, which performs perfectly for editing, design tasks, or simply enjoying multimedia content in excellent quality.\n\nIn summary, I’m delighted with this laptop. It has met and even exceeded my expectations. It’s an investment that’s worth every penny for its performance, speed, and overall efficiency.",
      "rating": "5"
    },
    {
      "title": "Reliable, Fast, and Great for Everyday Use!”",
      "body": "I’ve been using the Dell Inspiron 15 for few weeks now, and I’m genuinely impressed. The combination of 16 GB RAM and a 1 TB SSD makes everything feel super smooth—from startup to launching multiple applications at once. I usually have several browser tabs open, along with Excel and Photoshop, and this laptop handles it without breaking a sweat.\nThe 1 TB SSD is a game-changer. It’s incredibly fast and I don’t have to worry about running out of storage any time soon. File transfers are quick, and the system boots in under 10 seconds.",
      "rating": "5"
    },
    {
      "title": "Dell Inspiron 15 i7 Review: A Powerful Performer f",
      "body": "With the i7 processor and 16GB RAM, the laptop handles multitasking with ease. Whether I’m running multiple Chrome tabs, using Excel, or editing light videos, everything runs smoothly without noticeable lag. The build is sleek and professional, though it’s mostly plastic. It’s sturdy enough for daily use, but not the most premium feel compared to higher-end Dell XPS models.",
      "rating": "5"
    },
    {
      "title": "Homeboy",
      "body": "Great product for a fantastic price.processor, size of SSD and ram is great",
      "rating": "5"
    },
    {
      "title": "Amazing",
      "body": "Awesome laptop, very smooth and cool screen and amzing fast speed",
      "rating": "5"
    },
    {
      "title": "Great work computer",
      "body": "Brought this for my husband for his business.  So far, it has been very fast in processing and he usually has several different sites open at one time.",
      "rating": "5"
    },
    {
      "title": "A good laptop!",
      "body": "This is an amazing laptop! Is fast and I love the keyboard layout and how the keys click. I hadn’t upgraded my laptop in around 10 years. I had an Acer before this that I hated. Dell is a good and trusted brand I can always count on. I sometimes have to use it for work and I’m remote and I work a busy job with lots of programs opened. It works wonderfully, no lagging. I’ve had it 2 weeks now. I’m very happy with my purchase.",
      "rating": "5"
    },
    {
      "title": "Fantastic Overall Laptop",
      "body": "The Dell product has been a fantastic work computer. I had never owned a Dell laptop until this purchase, and I am happy I chose this product. If you're in the market for a good overall laptop, I highly recommend giving the Dell team a try. The only downside so far has been that the battery life is not particularly impressive, but I usually don't need to rely on the battery and can plug it into an outlet.",
      "rating": "5"
    },
    {
      "title": "Great computer",
      "body": "This laptop is great for college. It is the perfect size and works fast.",
      "rating": "5"
    },
    {
      "title": "Not a Fan",
      "body": "System roars, but the weak link is the screen, which seems smaller than past 15inch, in part this could be a lower height or the lousy implementation of Win11. No way to control the task bar which is HUGH, and takes up too much room. \n\nThe sound is also lower than in prior Dell models , acceptable but lower. \n\nI would look for a larger screen, and perhaps a different vendor. I use an additional screen, and this works way better than in Win10.",
      "rating": "4"
    },
    {
      "title": "Very light; good value!",
      "body": "I am very impressed with this laptop, at least based on my first impression. It's very lightweight, and seems to be performing quite well. I wish it had an ethernet port, but many laptops nowadays have omitted built-in wired networking. Highly recommended, overall!",
      "rating": "5"
    },
    {
      "title": "Good deal",
      "body": "Nice computer. Easy to setup,great hard drive space. Very smooth to use.The only problem is it is in s mode which means all apps must be xownloaded from the windows store,but its an easy dix,you are able to opt out of s mode and that allows you to open apps from goodle or other aights. I really like this computer.",
      "rating": "5"
    },
    {
      "title": "Dell Inspiron 15 laptop computer Review",
      "body": "This is my second Dell Inspiron 15 laptop . I like the lightweight and HD touch display screen. I like that Microsoft keeps a back up \nI was able to back up from my old Dell Inspirion 15.6 laptop from it's hard drive to the new laptop very quickly with no technical problems. very fast to set up as well.",
      "rating": "5"
    },
    {
      "title": "School Work",
      "body": "Very pleased with the Dell Inspiron computer.\nIt is very easy to use.",
      "rating": "5"
    },
    {
      "title": "Laptop",
      "body": "It is all good very good speed apps come up fast and easy to work",
      "rating": "5"
    },
    {
      "title": "Good computer",
      "body": "This computer is a nice one.... but I wish it had two USB plug in...I can always buy an external one. And it won't read my SD cards....so guess I have to buy something to connect to it to read those cards.  It has the plug.... but won't read.   Maybe I should have looked closer at it and bought a bigger one, but I didn't need a gaming computer",
      "rating": "4"
    },
    {
      "title": "Good but with a Dell catch...",
      "body": "Good computer for the money. Taking off 1 star due to Anker docking station not compatible with it. Pretty sure Dell wants you to buy their docking station and other peripherals. Being able to bundle your Dell computer with other peripherals was why I bought Dell before. Now they have their own chargers, docking stations, etc.",
      "rating": "4"
    },
    {
      "title": "Very pleased!",
      "body": "Nice purchase with special offer, more memory, excellent sales rep, excellent help in transferring data by Geek Squad, recommended to friend who wondered where to buy a computer.  Knowing I can contact Geek Squad again with any issues...important to me.",
      "rating": "5"
    },
    {
      "title": "Dell Inspiron 15 is first rate",
      "body": "This laptop delivers everything that it is advertised to do. It enables me to do everything that I need to do both on it and in connection with the Internet, the touchscreen is a useful addition and the response speed is much appreciated.",
      "rating": "5"
    },
    {
      "title": "Great home laptop",
      "body": "We were looking for a home laptop and this checked all of the boxes. We are not gamers so having space for that was not necessary. We have 1T memory and touchscreen is great. Highly recommend for home use.",
      "rating": "5"
    },
    {
      "title": "Good value!",
      "body": "Great deal! My sole complaint is sometimes certain keys will not type when pressed and I have to restart the machine, Hoping this bug is fixed with an update. Other than that, it was a great value!",
      "rating": "5"
    },
    {
      "title": "Nice machine",
      "body": "So far, it seems like a good device. It serves my needs and I am happy with it. This is the first laptop that I have owned so it took a little getting use to but I like that it has a touch screen as well as the ability to use a mouse.",
      "rating": "5"
    },
    {
      "title": "Great PC",
      "body": "This is a great computer, although I wasn't surprised by that. This is the third inspiring 3500 serieslaptop I have had and its a very reliable machinefor the price.",
      "rating": "5"
    },
    {
      "title": "Great computer for home use",
      "body": "Great computer for the cost.  High process power for this computer.  A little pricy but if you have a coupon/wait for a deal it can quickly turn into a steal.",
      "rating": "5"
    },
    {
      "title": "Doug",
      "body": "I needed a new laptop with Windows 11 as my old one was not upgradeable.  I don't game or do anything fancy, so this is everything that I need.  It runs all the 365 stuff and onedrive converted everything from my old computer.",
      "rating": "5"
    },
    {
      "title": "Seamless purchase",
      "body": "The online purchase and store pickup process was seamless!  The laptop is functioning well and is just what we needed for our church.",
      "rating": "5"
    },
    {
      "title": "Ready ro Work",
      "body": "Light to carry everywhere,  faster and easy to use.",
      "rating": "4"
    },
    {
      "title": "Dell Inspiron 15",
      "body": "I am pleased with my Dell Inspiron 15. It was relatively easy to setup. My only wish is that it would have a larger screen and keyboard for spreadsheet work.",
      "rating": "5"
    },
    {
      "title": "great deal",
      "body": "I've had the Dell Inspiron 15 with Windows 10  that was expiring and got a newer model with Windows 11. Was easy to set up and runs great.",
      "rating": "5"
    },
    {
      "title": "Great laptop",
      "body": "Great laptop. If you are thinking about buying it, just stop thinking and go ahead and make the purchase.",
      "rating": "5"
    },
    {
      "title": "Very happy customer",
      "body": "I am really enjoying my new Dell computer and HP printer. The technicians at the Geek Squad were able to transfer data from my old computer hard drive to my new one. Yay!",
      "rating": "5"
    },
    {
      "title": "Holy laptop !",
      "body": "Great...decent price and good quality.\nJust right for our Chruch scriptures on the TV screen.",
      "rating": "5"
    },
    {
      "title": "Works as expected",
      "body": "Lightweight laptop that works as expected. Need something fairly priced that ran windows 11. This fits the bill.",
      "rating": "5"
    },
    {
      "title": "Nice",
      "body": "It works perfectly and is perfect for my use. I love this laptop and I used for work.",
      "rating": "5"
    },
    {
      "title": "My Laptop",
      "body": "I am enjoying the laptop.I spend hours on it.I love browsing through websites and listening to music.",
      "rating": "5"
    },
    {
      "title": "City Secretary",
      "body": "Was in urgent need for a new company Laptop for a training seminar. BestBuy had the best pricing and availability for what we needed.",
      "rating": "4"
    },
    {
      "title": "got a great deal",
      "body": "I got this with a great deal, its really powerful for what I'm using for.",
      "rating": "5"
    },
    {
      "title": "Good Laptop",
      "body": "I’ve had this laptop about two weeks so far it’s been really good. Runs fast and no issues so far.",
      "rating": "5"
    },
    {
      "title": "Dell laptop",
      "body": "I really like it , nice color , works fast , I prefer a bigger screen",
      "rating": "5"
    },
    {
      "title": "Excellent computer",
      "body": "Fast and reliable,  so far working excellent. Computer brand good.",
      "rating": "5"
    },
    {
      "title": "Dell laptop",
      "body": "Looks good works well for my home use and fits well in backpack",
      "rating": "5"
    },
    {
      "title": "Dell Laptop",
      "body": "Excellent purchase. Excellente product and excellent brand!!!",
      "rating": "5"
    },
    {
      "title": "Dell Lapyops A+",
      "body": "I had a Dell for 7 years before purchasing this one. I love the touchscreen-and it’s a good solid laptop.",
      "rating": "5"
    },
    {
      "title": "Good so far",
      "body": "So far, seems like a great computer. Love the touchscreen.",
      "rating": "5"
    },
    {
      "title": "Great Laptop",
      "body": "Love this laptop.  Easy to start up and meets all my needs",
      "rating": "5"
    },
    {
      "title": "Hp laptop",
      "body": "Performance was good and excellent and battery performance was also good",
      "rating": "5"
    },
    {
      "title": "Ed's Dell",
      "body": "Nice little and powerful system for the price, bought it for my wife to use",
      "rating": "5"
    },
    {
      "title": "New Dell.",
      "body": "I always buy Dell laptops. This one is so fast and easy to use. Lightweight.",
      "rating": "5"
    },
    {
      "title": "Excellent value",
      "body": "This is an excellent value in terms of speed and memory. Rated well also.",
      "rating": "5"
    },
    {
      "title": "Inspiron 16\"",
      "body": "Install was easy. All works as it should, migrated apps easily. Wish it had additional USB",
      "rating": "5"
    },
    {
      "title": "Inspirion Laptop",
      "body": "Like the screen brightness and size, easy to navigate on the laptop and the battery life",
      "rating": "5"
    },
    {
      "title": "Dell is awsom",
      "body": "Excelent product i recomend it. I’m very glad with the results. Thank you",
      "rating": "5"
    },
    {
      "title": "Overjoyed",
      "body": "Great! Superb! Excellent for extensive usage!\nI would recommend this to all college students and gamers!",
      "rating": "5"
    },
    {
      "title": "Great value",
      "body": "Product is great! I love you using it! Great for the money",
      "rating": "5"
    },
    {
      "title": "Love my new Dell Inspiron",
      "body": "I absolutely love this laptop, and Best Buy provided great customer service.",
      "rating": "5"
    },
    {
      "title": "Earbuds",
      "body": "Fantastic Earbuds I Would Recommend Them To Anyone",
      "rating": "5"
    },
    {
      "title": "Great Product",
      "body": "Works perfect with my docking station to allow me to work on 3 screens!  The only downside is the battery life.",
      "rating": "4"
    },
    {
      "title": "Inspiron 15",
      "body": "The page up down is really too small.  They will probably wear out first.",
      "rating": "4"
    },
    {
      "title": "Very helpful",
      "body": "Good Service - representative informative and accurate information",
      "rating": "5"
    },
    {
      "title": "Dell inspiron laptop",
      "body": "Great price. Verry affordable  it is agreat product.",
      "rating": "5"
    },
    {
      "title": "good dell laptop",
      "body": "Great value.. one of the best dell experiences I had so far. only problem is it runs a bit hot so no laps for this laptop",
      "rating": "4"
    },
    {
      "title": "My Laptop",
      "body": "So far, excellent device it is i must say. I am very happy with this device.",
      "rating": "5"
    },
    {
      "title": "Dell computer",
      "body": "Great computer no problems yet I would recommend for any age group easy to use.",
      "rating": "4"
    },
    {
      "title": "Worth every penny",
      "body": "Package was delivered on time and in excellent condition.",
      "rating": "5"
    },
    {
      "title": "Fan clicking",
      "body": "Need to return. The fan is making a clicking sound. Other than that seems to be working as needed but surprised that it has mechanical problems after a month of use.",
      "rating": "2"
    },
    {
      "title": "Loud Fan",
      "body": "When i am not running programs the fan is really loud.",
      "rating": "1"
    },
    {
      "title": "Computer won’t run.",
      "body": "This computer had an operating system that wouldn’t let me complete the beginning computer set up procedures. The front desk associate discovered what the issue was and politely refunded my money.",
      "rating": "1"
    },
    {
      "title": "Oversold on this",
      "body": "We were oversold on this. We were oversold on this",
      "rating": "1"
    }
  ]
}