{
  "name": "HP 16-as0023dx",
  "price": "799.99",
  "rating": "4.7",
  "reviews": "81",
  "specs": " OmniBook X Flip 2 - in - 1  -  Copilot+ PC  -  16\" 2K Touch - Screen Laptop  -  Intel Core Ultra 7  -  16GB Memory  -  1TB SSD  -  Eclipse Gray",
  "product_url": "https://www.bestbuy.com/site/hp-omnibook-x-flip-2-in-1-copilot-pc-16-2k-touch-screen-laptop-intel-core-ultra-7-16gb-memory-1tb-ssd-eclipse-gray/6613865.p?skuId=6613865",
  "full_specs": {
    "Screen Type": "IPS",
    "Screen Size": "16 inches",
    "Screen Resolution": "1920 x 1200 (Full HD+)",
    "Touch Screen": "Yes",
    "Brightness": "400 nits",
    "Processor Model": "Intel Core Ultra 7 Series 2",
    "Storage Type": "SSD",
    "Total Storage Capacity": "1024 gigabytes",
    "System Memory (RAM)": "16 gigabytes",
    "Graphics": "Intel Arc 140V",
    "Display Connector(s)": "1 x HDMI 2.1, 1 x Thunderbolt 4",
    "Battery Life (up to)": "23 hours",
    "Battery Chemistry": "Lithium-ion polymer",
    "2-in-1 Design": "Yes",
    "Backlit Keyboard": "Yes",
    "Brand": "HP",
    "Model Number": "16-as0023dx",
    "Product Name": "OmniBook X Flip 2-in-1 - Copilot+ PC - 16\" 2K Touch-Screen Laptop - Intel Core Ultra 7 - 16GB Memory - 1TB SSD",
    "Color": "Eclipse Gray",
    "Year of Release": "2025",
    "Display Type": "LED",
    "Color Gamut (Standard RGB)": "62.5 percent",
    "Processor Brand": "Intel",
    "Processor Model Number": "256V",
    "CPU Boost Clock Frequency": "4.8 gigahertz",
    "Number of CPU Cores": "8-core",
    "CPU Cache Memory Level": "L3",
    "L3 Cache": "12 megabytes",
    "Neural Processing Unit (NPU)": "Yes",
    "Maximum NPU Performance": "47 trillions operations per second",
    "Solid State Drive Capacity": "1024 gigabytes",
    "Solid State Drive Interface": "PCIe 4.0",
    "Type of Memory (RAM)": "LPDDR5X",
    "System Memory RAM Speed": "8533 megahertz",
    "Graphics Type": "Dedicated",
    "GPU Brand": "Intel",
    "GPU Video Memory (RAM)": "8 gigabytes",
    "Operating System": "Windows 11 Home",
    "Number of HDMI Outputs (Total)": "1",
    "Number of Thunderbolt Ports (Total)": "1",
    "USB Ports": "1 x USB-C 3.1, 2 x USB-A 3.1",
    "Number of USB Ports (Total)": "3",
    "Headphone Jack": "Yes",
    "Microphone Input": "Yes",
    "Wireless Connectivity": "Bluetooth, Wi-Fi",
    "Wireless Networking Standard": "Wi-Fi 6E",
    "Number Of Ethernet Ports": "0",
    "CPU Cooling System": "Air",
    "Power Supply Maximum Wattage": "65 watts",
    "Battery Cells": "4-cell",
    "Front-Facing Camera": "Yes",
    "Front Facing Camera Megapixels": "5 megapixels",
    "Built-In Microphone": "Yes",
    "Touchpad Type": "Multi-touch",
    "Media Card Reader": "No",
    "Audio Technology": "DTS: X Ultra",
    "Speaker Type": "Poly Studio with dual speakers",
    "Windows AI": "Copilot+ PC",
    "Security Features": "Privacy camera",
    "Casing Material": "Aluminum",
    "Product Height": "0.61 inches",
    "Product Width": "14.02 inches",
    "Product Depth": "9.67 inches",
    "Product Weight": "4.15 pounds",
    "ENERGY STAR Certified": "Yes",
    "EPEAT Qualified": "Yes",
    "EPEAT Level": "Gold",
    "Optical Drive Type": "None",
    "Numeric Keypad": "No",
    "Warranty - Parts": "1 year",
    "Warranty - Labor": "1 year",
    "UPC": "198990145372"
  },
  "all_reviews": [
    {
      "title": "A Great All-Around Laptop!",
      "body": "The OmniBook X Flip is a great all-around 2-in-1 laptop. With its powerful Intel Ultra Core 7 processor and an Intel Arc 140V integrated GPU, this laptop can do it all. From simple tasks like word processing, web browsing, watching films, to some more task-heavy tasks like some light gaming. This laptop is a versatile piece of tech that is great for a student or a business professional who requires that extra processing power or tablet capabilities. This is my review of the HP OmniBook X Flip 2-in-1 laptop. Read on to learn about some Pros and Cons of the OmniBook X!\n\n*TLDR at the bottom\n\n=========\nIN THE BOX/SET-UP:\nSo, what’s in the box? A laptop that is neatly wrapped in a soft cover, a 65W USB-C charger with a nice, braided cable, and some documentation.\n\nSetup is straightforward. It is your typical Windows 11 out-of-the-box experience. I typically go through the laptop and delete any bloatware or apps I won’t ever use before setting up my stuff. There were some bloatware applications like McAfee and some intrusive HP apps, but overall, I do appreciate that the laptop did not have a lot of bloatware preinstalled.\n\n=========\nDESIGN/SPECS:\nThe OmniBook X Flip 2-in-1 laptop sports a nice matte black color (HP calls it Eclipse Gray, but the color appears black). I love the matte black color, and while the cover is a fingerprint magnet, I’ve noticed that the keyboard doesn’t leave much of an oily finger residue compared to some other laptops I have used. The keys on the keyboard are significantly larger compared to some other keys I have used in the past. It did take a little bit of getting used to the size and travel distance of these keys. There is also no number pad. I prefer a number pad, but it is not a deal breaker for me. Like the keyboard, the trackpad is very large. The large trackpad was somewhat cumbersome when I was typing, and suddenly, my wrist accidentally clicked down on the trackpad or moved the mouse pointer. Something I like about this laptop is the number of available ports for your different peripherals. The laptop has 2 USB-A 3.1, 1 USB-C 3.1, 1 Thunderbolt 4, 1 AUX, and 1 HDMI. Finally, a major selling point is the touchscreen display.  The touchscreen can be used in many ways. It is responsive, but there are certain areas where your clicking will need to be more precise (e.g., closing a Chrome tab because sometimes the touch does not register). There is no stylus, but at this price point, I strongly think one should have been included. \n\nThe OmniBook X contains some powerful internals. An Intel Core Ultra 7 processor, a decent internal GPU (Intel Arc 140V), 16GB of memory, and a 1TB SSD.\n\n=========\nPERFORMANCE:\nI was able to use the OmniBook X in a variety of situations over the past couple of days. I work in IT and was able to stress test its business capabilities there. I also played some video games and watched a couple of movies/live events in tablet mode. Finally, I ran several benchmark software programs. I will first cover the benchmark software. The first one I ran was 3D Mark. This was used to test out the laptop’s gaming capabilities. While this is not marketed as a gaming computer, the OmniBook X is capable of light gaming. PC Mark was used to test out the computer’s capabilities with modern office applications like Word, video conferencing software, web browsing, data processing, etc., and Cinebench was used to test out the computer’s CPU rendering. The scores for these benchmark applications can be seen below. \n\n3D Mark\nSteel Nomad Light Score: 3114\n\nPC Mark\nOverall Score: 4604\n*Individual scores for a specific application in the PC Mark image\n\nCinebench\nCPU (Multi Core): 8813\nCPU (Single Core): 1860\n\nThe benchmarks say this is an excellent office computer that can handle many process-heavy tasks, such as video processing or running virtual machines. A student who uses Premiere Pro or AutoCAD will find that this laptop is great at handling these process-heavy applications. On the other hand, the OmniBook X’s gaming capabilities aren’t ideal, but can be used for light gaming. I played a variety of games, from FPS games like Black Ops 6 to some newer games like Expedition 33. I was also able to play some lighter games like Stumble Guys, which the laptop handled extremely well. The display has a max refresh rate of 60Hz, which is okay for casual gaming. In Stumble Guys, I was able to max out the refresh rate. On B06, I got an average of 58 FPS on basic settings. Not ideal for competitive gameplay, but for casuals, it should be okay. On Expedition 33, the OmniBook X did struggle significantly. I had to set all graphic settings to low, and even on low, I was averaging 33 FPS. Overall, the OmniBook X handles office tasks exceptionally and can handle some video games okay.\n \n=========\nFEATURES/OTHER NOTES:\nThe following lists some features and other notes I have about the OmniBook X.\n\n- Built-in speakers are surprisingly good, but the lows are lacking \n- The minimal amount of Bezels makes the display appear larger\n- Built-in camera is good, the Poly Camera Pro app helps enhance your video calls and allows video effects\n- The 400 nits screen brightness is bright and vibrant\n- Great cooling system, the fans are extremely quiet\n- An Intel Wi-Fi 6E card is installed in the computer\n- 3 free months of PC Game Pass are included with the device. \n\n=========\nCONCLUSION/TLDR:\nOverall, the OmniBook X is an excellent office laptop and an okay laptop for gaming. If you are a student or business professional who uses creative apps like Premiere Pro or technical apps like VirtualBox or AutoCAD, this laptop will suit you well. The OmniBook X handles office applications like a champ. On top of handling office apps, the 2-in-1 ability makes this laptop a versatile note-taking tool or a tablet to watch videos. While the laptop can handle games, don’t expect a top-of-the-line performance. More graphically intensive games, such as Expedition 33, I was only able to get about 35 FPS on low settings, which is not ideal. But other games like BO6, I was able to almost max out the 60Hz refresh rate. Regardless, I would still consider the OmniBook X a great all-around laptop that I wholeheartedly recommend you check out!",
      "rating": "5"
    },
    {
      "title": "Powerhouse HP Omnibook X Flip 2-in-1",
      "body": "Wow, this thing is a workhorse! I was replacing older 16in HP Omnibook that is great, but I wanted more of the new AI and Copilot features that the newer models have. Let me start by saying how well this Flip Laptop is built. Distinctly solid and aluminum feel, unlike some of the other models out there, you pick this up and you can see and feel how well built it is. Now, that said, it is not light, it is over 4lbs, but if you’re buying a 16in laptop, you’re going to be in this weight range.\n\nThe display is a beautiful 2K 1920 x 1200. HDR for video streaming is supported while using HDR. Let’s be clear, if you are using anything less than 16 inches today, you are going to be blown away by the screen real estate on this machine! The fact that it’s a very accurate touch screen, and a flip as well, are just bonus features that make this laptop amazing. While this box may be a bit heavy for the frequent traveler, if you are traveling and going to be in one place for a week or so, it is amazing that you can use this to play YouTube, watch movies, watch YouTube TV, you flip this thing around, or use it in tent mode and wow, you have an absolutely beautiful screen that is significantly better than any smaller laptops. The touch is very responsive for me. There is also a built-in camera cover which I love this feature because then I don’t have to get one of those sticker based camera covers. The camera is 5megapixel front facing. It’s the little attention to details like this in the Omnibook series that are really appreciated. \n\nInterestingly, the keyboard and keys “feel” large and easy to use but when you set this down and look at it holistically, the keyboard doesn’t seem to take up much real estate. Track pad is large and easy to use and speakers take up more than an inch on each side of the keyboard. You just have to remember that it’s this way to accommodate the screen size, which is fine. The only thing missing from this awesome machine is a fingerprint reader. I have really gotten to like that feature and it’s about the only thing missing!\n\nAs for power and performance, this Omnibook doesn’t disappoint. It has 16GB of RAM, 8GB of onboard video RAM from the Intel Arc 140V graphics. Performance is smooth and quick with multiple Word, Excel and PowerPoint files up simultaneously. Although this is not an official gaming laptop, its specs support moderate gaming usage. Another thing I noticed is the superior cooling that this laptop has. I never was bothered by any fan noise and could easily keep the machine on my lap for several hours without even noticing any heat. With 1TB SSD, you won’t run out of space on this box and it’s ideal for locally stored video streaming.\n\nThis is a Copilot+ PC, it’s not my first one but I will say, if you haven’t used Copilot+ (Microsoft’s AI), then you are missing out. With the powerful 47 NPU, leveraging all that Copilot has to offer is fast and easy. There is no reason to use most other search engines. Asking Copilot anything you would normally search for, and research is a whole new experience. The depth of information and available is truly mind-boggling. Copilot remembers searches so you can go back later and dig back in. I strongly recommend that you look on YouTube for “prompting” learning and guidance. Learning how to “ask” or prompt Copilot is key to getting not only more of what you are looking for but also a depth of information to improve your experience. You can really improve all your Microsoft 365 applications by leveraging Copilot+ within them. \n\nThis Omnibook also supports up to Wi-Fi 6 as well as Bluetooth 5.3. I was also impressed with the onboard Poly Studio and dual speakers. Sound quality was superior to other laptops I have used and tested. As for ports, it has 1-Thunderbolt 4 USB-C, 1-USB-C, 2-USB Type A, 1-HDMI and 1-headphone/microphone port. \n\nBattery life is slated at up to 23 hours of video playback time. I never ran anything that long but I will say that the battery life that I have experienced is several days of multi-hour use to where I finally hit around 15% so I plugged it in. Compared to my wife’s laptop and a couple of others I use, this HP Omnibook excels at battery life. \n\nI would recommend this to others; I am giving it 5 stars because it is such a solid performer. If I had any cons at all, it would be the weight at 4.3lbs. It is heavy but it sure is a beautiful and powerful performer!!",
      "rating": "5"
    },
    {
      "title": "A Large 2-In-1, Beautiful Display",
      "body": "The HP OmniBook X (Intel Core 7 Ultra, 16GB RAM, 1TB SSD) is a large 2-in-1 with a really nice IPS display that will satisfy many users.\n\nOne thing I've learned over the years of owning laptops and servicing them is that everyone likes different combinations of features.  What I like, you might not like, and vice versa.  So the key when shopping for a laptop is to learn what you like and then finding one that has those features.\n\nI've always been a big fan of 2-in-1 laptops.  One of the main reasons is for travel.  On an airplane, you don't have to power them down like a laptop during takeoff and landing if it is folded flat, like a tablet.  So you can continue to be productive for those extra 40 or so minutes, which can be handy.  And as long as the touchscreen functions well (which this one does), the experience can be very good.\n\nMost of the 2-in-1 laptops I have owned have been on the smaller side--13.3\" or 14\".  I do find the 16\" to be a bit big for a 2-in-1, and a little heavier than I would like.  The weight of the laptop alone is 4 lbs, 9 oz.  It still fits nicely in my backpack, but without a resting surface, it can get heavy for the hands and arms over time.  However, I do appreciate that the power supply is not an enormous brick like so many other larger laptops.  That makes the overall package easier and lighter to carry.  The total weight, including the power supply, is 5 lbs, 3 oz.\n\nThe screen is IPS technology at 400 nits of brightness.  I found the display to be plenty bright with rather deep blacks and bright whites.  The screen is not quite OLED level, like on more expensive laptops, but it is very nice--and as I mentioned before, the touch function is responsive and works very well.\n\nThe keyboard is a zero-lattice keyboard, meaning there is no space between the keys.  This is the latest styling cue of some more expensive laptops.  This HP integrates the speakers on both sides of the keyboard to fill in the extra space.  Personally, I think the keys are a bit too big and they also have a lot of travel.  I would have rather had smaller keys and a dedicated number pad.  This is a personal preference.\n\nRegarding the speakers, the sound quality was OK.  I did not feel there was enough bass, and the clarity was average.  Volume range was good.  I would have preferred more premium speakers, with the speakers mounted on the underside of the laptop--again, so I could have a dedicated number pad.\n\nFor speed and usability, the OmniBook X has the Intel Core 7 Ultra, which is a step above the Core CPUs (formerly the i7, for example).  Intel ARC graphics are a step above the typical Intel Iris graphics.  I ran GeekBench on the system and was a bit underwhelmed with the results.  One of my other laptops has an Intel Core 5 Ultra with 8GB of RAM and the Intel Iris graphics.  The HP having the Intel Core 7 Ultra with 16GB of RAM and the ARC graphics, I expected the GeekBench numbers to be a bit better.  The HP clocked in at 2369 for single core and 10443 for multi-core, with graphics at 27130 with OpenCL.  The other laptop with the Core 5 Ultra was about the same at 2244 / 10480 / 25424.  Further investigation found out exactly why.  The Core Ultra 7 in the HP is running at 2.2GHz with 8 cores and 8 logical processors.  The other laptop with the Core Ultra 5 is running at 3.6GHz with 14 cores and 18 logical processors.  More cores / logical processors means more applications can run simultaneously without bogging down the laptop.  That includes multiple browser tabs.\n\nHowever, the HP in general functioned well with good scrolling on the internet, no lag with multiple browser tabs open, and good performance with multiple applications running simultaneously.  So for the everyday user that is not overloading the laptop with heavy tasks, it will perform just fine.  I just would have expected more of a jump in the GeekBench numbers, that's all.  The ARC graphics would come into play more with AV-intensive work, like photo or video editing.\n\nHowever, the Core Ultra 7 is a bit more power efficient, and it shows with the battery life.  While not nearly as long as the new Snapdragon chips, this laptop did stay powered up for the entire workday with plenty left in the tank when I plugged it in for overnight charging.\n\nDuring operation, there was some fan noise, but overall it was minimal and not loud.  The laptop also ran nice and cool.\n\nI do like the number of ports on the laptop.  The right side has a USB-A and headphone jack, while the left side has another USB-A, an HDMI out, and 2 USB-C ports (one of whcih is Thunderbolt).  The matte finish of the laptop case gives it a sleek and modern look.\n\nOut of the box, there was a lot of HP bloatware.  While some of it is useful, I found a lot of it to not be useful.  Uninstalling it took a few minutes and was easy.\n\nOverall, the HP Omnibook X 2-in-1 is a nice package.  It has a premium feel and a really nice display.  The battery life is very good and the system overall is peppy.  1TB of storage is also very generous.  I would have preferred a dedicated number pad and more premium speakers.  I also thing the laptop is a little heavy for a 2-in-1.",
      "rating": "4"
    },
    {
      "title": "High-quality HP OmniBook X Flip 2-in-1",
      "body": "I have been a long-time fan of HP brand of laptops and even desktops prior to that. I appreciate the high-quality work and parts that they use when manufacturing their latest touch-screen laptops.  I had a good HP laptop that was about 5 years old prior to obtaining this brand-new HP OmniBook X Flip 2-in-1 which has Copilot+ on it but also HP’s own version of an AI tool that comes in handy for the work I do. I was impressed when I unboxed this laptop and saw how beautiful the touchscreen appeared and that it was easy to flip it from a laptop to a tablet type of laptop with a great touch screen. This is my first flip version of an HP laptop so I was hoping it would meet and exceed my expectations with the graphics and sound quality, and it did. I was impressed with the wide16-inch 2k Touchscreen with Ips because it produced a sharp enough image that was a pleasure to stream movies on as well as playing occasional games and then producing my regular work.\n\nI do like using the windows Copilot product since it is available on laptops and my mobile devices as well. I was hesitant to use it at first but over time I have become more at ease by making sure the settings are at a level I am comfortable with as far as sharing or storing any of my information. \nThe processor that HP decided to put in this model is the Intel Core Ultra 7 256v Processor with Intel Ai Boost (47 Npu Tops) that is perfect for power users, people who create multimedia presentations, along with those who need to multitask on several programs at once without causing the laptop to get bogged down. They also loaded the laptop up with 16gb Lpddr5x Memory (ram) which makes it run smoothly no matter the task you are performing. I also liked that for the high-quality graphics card they chose is the Intel Arc 140v Gpu (8gb), which they combined with more AI abilities to create even better-looking images.\n\nOne of the most important features I look for in a laptop is the available storage and this one has 1 TB SSD storage which is my favorite and I have still not been in a situation where a 1 TB was not enough storage, for me it is plenty and if for some reason in the future I end up saving too many large multimedia creations I might just switch to storing some of the date in a cloud service I subscribe to.\n\nIn regard to the sound setup they used DTS: X Ultra Technology which they claim is spatially accurate, that makes it sound like 3D sound in whatever type of media you are watching. They added in a special sound system called the Poly Studio with dual speakers that is a mix of AI that can be pitch perfect according to the company literature but stood out to me when I was testing the webcam and trying out the settings available in the Poly Studio.\n\nNow in terms of Wi-Fi the laptop comes with a 6e (2x2) standard setup that can also operate in the 6 GHZ band which I use the most on my home network but also use Wi-Fi 7 which is backwards compatible and works great with this laptop. In terms of Bluetooth technology they used a 5.3 Wireless Card.\n\nThe last area of importance from the company specifications is all the various ports they have included on the laptop. 1 Thunderbolt 4 With USB Type-C 40Gbps signaling rate, USB Power Delivery, DisplayPort 2.1, HP Sleep and Charge), 1 USB Type-C (10Gbps signaling rate, USB Power Delivery, DisplayPort 1.4a, HP Sleep and Charge), 2 USB Type-A (10Gbps signaling rate), 1 Headphone/microphone combo, 1 HDMI 2.1.\n\nThey included a 65 W USB Type-C power adapter, and the dynamic laptop only weighs a little more than 4lbs which is a nice relief to carry vs heaver older models.\n\nI have had so much fun exploring all the various features of the new laptop but also the next gen AI apps that they included for entertainment and creativity. I would recommend this laptop to my friends and family because of how much HP packed into the lightweight laptop yet used the latest technology to make it stand out even more.",
      "rating": "5"
    },
    {
      "title": "A Slick, Nearly Great Machine. Not The Best Screen",
      "body": "The OmniBook X Flip is an attractive machine. It feels fairly light, has a spacious keyboard and respectable trackpad, and had an ‘edge-to-edge’ style screen with thin bezels - all of which create a nice impression for a new laptop in 2025. A quality processor and Windows’s Hello compatibility (and the conveniences that come with it) are also solid inclusions… It’s unfortunately in the screen quality and speakers that hold this machine back from achieving greatness.\n\n\n__ Screen and Speakers:  __\n\nBefore getting into more of the positive aspects of this machine, I want to call out the main detractors that make me unlikely to recommend it, despite it otherwise being a well designed and capable machine. - At 1920 x 1200, it’s not quite the true 2K resolution that HP lists, but really a standard 1080 HD screen with a bit more height to it (i.e. 1200 instead of that 1080). That added height can let you see a bit more of a webpage before scrolling or feel more natural if holding it as a tablet in portrait, but at 16” in size, the density of those pixels start to be noticeable in a way that it wouldn’t on a smaller, say, 14” screen. I’d say it’s actually ok and passable here, but that’s not the end of my gripes with the screen. The panel quality is mid-tier in general, achieving only 400 nits, a point at which you’ll probably be fine in most circumstances, but under bright lights, it may not feel bright enough. It’s also edge-lit, and while that’s not terrible, it can leak light in from the edges slightly irregularly on a black screen. Viewing angle is also not the best (despite being an IPS panel), getting a bit blown out when viewed off-angle. \n\nI’d argue that the screen is one of the most important aspects of any new machine, and while I appreciate that much of the cost of creating this laptop went to improving other aspects, like fast Ram and a good, AI-ready CPU, the screen is equally important not to skimp on, IMO.\n\nSimilarly, my next point of contention… the speakers. I didn’t experience audio at the quality that HP states in their description. Despite firing up Poly Studio and taking all of the suggested software updates, audio remained flat in a signature ‘laptop speaker’ kind of way, lacking bass, but otherwise able to get loud enough without terrible distortion. In comparison to my other machines, it’s near the bottom in terms of sound quality. \n\nDespite its large screen, these two misses makes this machine better for productivity than media or games.\n\n\n__ Design & Portability: __\n\nEven with my emphasis on the above, this laptop otherwise excels in a lot of other ways. First in its design. It simply looks the part of a modern machine. While large at 16\", if feels good and fairly light in the hand. The rear hinges seem solid and it has an overall, professional look - including its dark grey metallic body, large keys, and modern typeface on each key. Despite being only 5MP, its webcam is fairly respectable, capturing my lighter skin tone well and in better clarity than some of my other machines. And maybe more importantly is its inclusion of Window’s Hello compatibility, allowing you to easily sign in with this webcam by simply positioning yourself in front of the machine. This convenience went even further as Chrome made it easy to use this feature to fill in passwords online as well. These little things can really add up in a positive way. The included charging cable is also attractive, though much more bulky than it needs to be. Luckily, charging vis USB-C means that more compact third-party chargers will work just as well. And finally, an integrated webcam shutter is icing on the cake.\n\n\n__ Quality CPU, Ram, and Integrated Graphics: __\n\nMuch of the other internal components are quite respectable. It’s modern Intel Core Ultra 7 processor with NPU make it AI ready, while 16GB of fast DDR5 ram is plenty good enough for the vast majority of people. Intel’s integrated Arc 140V graphics can handle some mid-tier 3D games much better than earlier versions of integrated graphics could. I saw frame rates around 40-50fps, but not without some ‘tearing,’ skipped frames or stuttering at times. In other words, gameplay with a lot of motion was not a smooth as it could be, but still performing without issue on less intensive games. Wifi 6E is good for higher speeds and handling places where wifi may be saturated or where interference with other machines may be a more likely. Lastly, the included Thunderbolt 4 allows for connecting up to two 4K displays with a single cable - not bad if you want to set this up as your desktop as well.\n\n\n__ Summary: __\n\nHP has created a modern, attractive machine with a lot of good components, but without a better screen… and to some extent, better speakers, I would personally aim to spend a bit more to get improvements there. If you’re looking for a machine for work, these aspects may not matter as much to you. It still excels in a lot of ways with small design features that will add up to a better experience than you might have otherwise had - from Windows Hello login, presence sensing, an integrated webcam shutter, a large screen in a taller aspect ratio, and more. \n\n\n\n*** The Good Stuff ***\n\n- Professional looking modern design, relatively lightweight.\n- Large keyboard with larger typeface on keys.\n- Higher tier CPU.\n- Fast DDR5 Memory.\n- Long battery life.\n- Windows Hello convenience in its decent webcam.\n- Integrated webcam shutter.\n\n\n*** The Less Than Good Stuff ***\n\n- Mediocre screen and pixel density.\n- Speakers lack bass, sound a bit tinny or hollow.",
      "rating": "4"
    },
    {
      "title": "The Screen Ruins An Otherwise Wonderful Laptop",
      "body": "CONCLUSION 7.35/10:\n\nI think one of the most important metrics in a laptop is how it feels to use. Do you look forward to opening it up and getting on it or not? And for this guy I do enjoy using it. It has a sleek look. Made from aluminum. It is relatively lightweight for its size. I really enjoy the keyboard. The trackpad is good enough. The 2-in-1 feature is nice in certain scenarios. The main weak points are the speakers and screen resolution/color accuracy/refresh rate. You’ll need to decide what your priorities are. If it’s a high-quality screen, with high refresh rate, and high color accuracy, then look for the OLED model. If you are looking for a large 16-inch laptop at a very respectable price for the amount of storage, RAM, CPU, and battery life then this is a good choice. Overall, this device does more things right than it does wrong making it a solid choice. But maybe not the best choice for the money. \n\nSCREEN 5/10:\n\nThe screen is the most important aspect to me as it is the thing you interact with the most. This screen is quite the conundrum. Doing some things well but other things poorly. It’s a 16-inch IPS, LED, 1920x1200 (full HD), 16:10, 60 Hz, touchscreen, edge-to-edge glass, micro-edge, up to 400 nits, and 62.5% of the sRGB color range. 62.5% sRGB is unacceptable seeing as almost all other laptops near this price range support 90 – 100% of the DCI-P3 range (which is about 15% more colors which is a lot). Making everything look washed out. Which for a 16-inch screen that most will want to watch media on seems like a massive L. Contrast is much better than expected, which helps save it. 1920x1200 is a bit low just because it makes things a bit fuzzy on this big of a screen. This also helps save battery life. It comes with all the pros/cons of typical IPS screens. 60Hz seems low to me in 2025. Overall, this is a low-end display. But performs very well in its low end display category. And is the thing I dislike the most about this laptop. As if this was better, this would be such a better machine. I recommend looking for the OLED variant. As it would be worth the upgrade in the long run. With it being IPS I would have liked to see higher brightness than 400 nits which is OLED territory. \n\nTRACKPAD 6.5/10:\n\nThey trackpad is the second most important aspect, as if it sucks, the laptop is useless, as I use laptops for their portability and carrying a mouse around limits that greatly. This one is large, with a unique plastic-like texture, non-uniform click, where the bottom it is easier than the middle, with nothing on the top. Despite how it feels, which I think is lower end, it is still accurate. It has a hybrid feel where it feels like the bad old-school windows trackpads, but has the new-school accuracy. But lags behind MacBook’s force touch trackpad or the Microsoft Surface 7’s precision haptic touchpad. \n\nKEYBOARD 8/10:\n\nThe keyboard is the third most important aspect to me. With the size of this laptop, I’d expect full-size keys, but that isn’t the case. The delete key being left of the power key is frustrating. Thankfully, the power key requires more force. Shortcuts are unique and include: projecting your screen, emoji, screen brightness, backlight (its white, low or high brightness, 30 sec, 3 min, always on options which is great) that is very uniform, volume mute (has LED when muted), volume up/down, mic mute (has LED when muted), play/pause, quick launch Omen or MyHp app, screen shot. All keys are perfectly flat, requires moderate/severe pressure to depress, and very strong spring back up which I love. It is louder than a lot of other laptops. Where if I’m in a quiet room (work, school lecture) people can hear me typing. Overall, the more I use it the more I enjoy it. \n\nBATTERY LIFE 9/10:\n\nBattery life is also critical in a portable machine. The latest chips have significantly improved this. I had a hard time testing this adequately. Which is a good thing. Out of the five days of testing I never ran out of juice. I was able to get through 4 hours or work (50- 60% brightness, keyboard backlight on, doing nothing to the stock settings, mixed use of watching videos, word documents, emails, multiple things open, webpages, not caring what I was doing, etc.) and it would be at like 70 – 80%. Making me expect with mixed usage and light/moderate workloads probably leading to 8 – 10 hours of battery life easy. Probably closer to 12 – 13. With much more if watching battery and just doing video playback. So this will easily get you through a workday and/or school day without any issues. HP claim 23 hours of video playback and 15 hour and 45 minutes with mixed usage. Also, supports up to 50% quick-charge in 45 minutes. \n\nSPEAKERS 6.5/10: \n\nWith a big chassis I expected better. They get very loud but are very tinny. They lack bass. Making it so I can understand things just fine. They get plenty loud. However, due to their treble focus they can start to hurt my ears after a while. It comes with Bluetooth 5.3 and a headphone jack so they should fix/mediate that issue if you have those. \n\n2-IN-1 FUNCTIONALITY 9/10:\n\nThis I would say is one of the main selling points of this laptop. As if you aren’t going to use it then its better to go with an alternative as I think part of the price is tied up in this. The touchscreen on this is excellent. Very accurate and the glass is smooth making it enjoyable to interact with. Switching to “tablet” mode is quick, easy, and works every time. If you rotate the device it will automatically rotate the screen. I found this is awesome for three tasks. 1. When you are watching something being able to get a different angle or closer and then go through touch is a unique and pleasurable experience. 2. When you are reading a document, scrolling, or browsing content going into tablet mode is a lot of fun. But this device is big and heavy which detracts a bit. 3. If you buy the stylus from HP (which I think is like $60) you can also take notes on this device. Which may work great for some people depending on their workflows. For a student I think that would be great if you aren’t buying an iPad and wanting digital notes. I also found that when using this as a secondary screen (for example I’m referencing something often while doing something) this 2-in-1 feature really shines. \n\nPERFORMANCE 7.0/10:\n\nThis comes with the Intel Core Ultra 7 Series 2, 256V, 8-cores, 8 thread, w/ 4.8 ghz boost, and 47 NPU TOPS. Which equates to an upper-mid range to high-end laptop. Being similar in performance to Apple’s MacBook Air M3 on Cinebench at least. It also comes with Intel Arc 140V graphics card with 8 GB of VRAM. Meaning you’ll be able to play a lot of modern games at around 30 – 60 fps at very low settings. But the cooling may be an issue as single fan that I never heard. Along with being able to video edit simple to moderate complexity (one to two video streams ideally at 4k or less with minimal/moderate effects) without any problems. However, RAM may be a limitation at 16 GB. Also, with the display having poor color accuracy you can’t trust what you’re seeing.\n\nTesting on Cinebench showed: \nPOWERED: \nBalanced: Single 1874, Mulit 10,440, \nHigh Performance: Single: 1890, Multi: 9557\n\nBATTERY: \nBalanced: \nSingle: 1094, \nMulti: 8498\nHigh Performance: \nSingle 1899, \nMulti-core 9698\n\nIn comparison Very High-End/premium Laptops are going to be getting 1800 – 2200 single core and about 20,000 – 30,000 multi-core. But that is usually plugged in. \n\nAs for the SSD. It is a 1 TB SSD. In Crystal Mark I got 6139 read and 5344 write. Which is excellent for a stock SSD. The max speed you can get on Gen 4 SSD is Read of 7000 - 7500 and write of 6000 – 7000 MB/s. So we are almost there. \n\nThe 16 GB of LPDDR5X 8533 megahertz RAM is solid. That is the minimum I would recommend but also enough that most users shouldn’t have any problems. Is the sweet spot. No complaints here. \n\nIt boasts Wi-Fi 6E. Wi-Fi 7 is the latest standard technically. But this is awfully close so there is no real loss here. I didn’t have any problems with connecting after sleep/restart or any drops of connection. Speeds were excellent at 1484 down and 1635 up. \n\nFEATURES 8/10:\n\n- It has 1x HDMI 2.1 port which I was able to get 4K @144Hz with. But couldn’t get 2560x1440 @240 Hz only 144 Hz. \n- 1x USB-C Thunderbolt 4. Able to get 4K144Hz and achieve 2560x1440@240Hz. Which also worked on the other USB-C non-thunderbolt port. \n- Via HDMI and USB-C. I was able to get my laptop display, 4K60 hz (not any higher refresh rate as it wouldn’t work), and 2560x1440 at 144Hz at the same time. For Dual USB-C I could get laptop, 4K@94 Hz and 2560@240 Hz at the same time. Which is interesting… Note with other laptops/PC I am able to get full Hz ranges and resolutions with these cables. \n- 1x USB-C 3.1 (would have preferred this to be another thunderbolt port but support same resolution as thunderbolt for external displays) and \n- 2x USB-A 3.1. Which is appreciated. Again, would have preferred to see USB-A 3.2 ideally. \nLove to see a headphone jack, which it has.\n- Along with manual privacy camera shutter. \n- Already discussed the backlit keyboard. \n- Comes with a 65 watt USB-C power adapter. \n- Does NOT have a numpad. \n- Windows Hello facial: Which worked like 50% of the time for me for some reason. \n\nBUILD QUALITY 8/10:\n\nBuilt out of aluminum. Some flex to the top and bottom, not the trackpad, where you rest your hands, or keyboard. I like that the edges are kind of tapered making it appear a lot thinner than it actually is. As where you grip is thin but where it sits is not. It requires four screws to open up. RAM is soldered. SSD is replaceable. Only one slot. As is the wireless/Bluetooth card. Otherwise stuck with what you have. Weight, for size is respectable at 4.15 lbs. Hinges are solid. With it being a 2-in-1 you have full movement. Screen stops wherever you place it. Does not bounce when typing or anything.",
      "rating": "4"
    },
    {
      "title": "A Versatile Powerhouse",
      "body": "The HP OmniBook X Flip 16-inch Laptop Next Gen AI does a good job at blending power and adaptability. Unlike a traditional laptop, its “Flipping” ability makes it a versatile machine with good hardware for many applications, and its AI feature is a welcome addition.\n\nThis model has 16GB of RAM, a generous 1TB Solid State Drive and comes equipped with the Intel Core Ultra 7 256V processor that is powerful enough to deliver a responsive and smooth experience for most common applications and projects. Embedded in this processor is the “Next Gen AI” feature that handles some AI-related tasks such as improving productivity within Windows, enhancing video calls experience and upgrading content creation. This is done through the AI Companion app; I tried a few features and they work as intended but I think it’s just scratching the surface of what AI assistance can truly do. It’s a bit limited in my opinion.\n\nThe 16-inch display looks big next to my 14-inch laptop. It’s a 2K IPS LED touchscreen that is responsive to the touch and provides clear visuals and dynamic colors. I’ve been enjoying watching movies and the sound quality is surprisingly good, and make long listening hours a pleasure. I also use it for work, and it handles documents and graphics images with good clarity. It can get bright enough in a well-lit environment. For external connection, it offers 2 USB-A ports, 2 USB-C ports, 1 HDMI connection and 1 audio out connection for wired headphones.\n \nThe 2-in-1 design of the OmniBook X Flip with its 360-degree hinge, provides great versatility. From the traditional clamshell configuration, you can flip the screen to tent mode, or go further to tablet mode complete with the touch experience, or to reverse mode for collaboration. The hinge is solid, well built and easy to flip back and forth. It has a good build quality overall, and some people might have issues with its size at 16 inches but it’s light enough to be easily carried around in a sleeve or a backpack.\n\nThe HP OmniBook has good ergonomics suitable for everyday use. The large, well calibrated touchpad responds well to the touch. The backlit keyboard is made of good quality plastics, and is comfortable to type on and looks high-end when lit. The absence of a numeric pad is not a deal breaker, but would be welcomed. The battery has a decent duration and can go a couple of days of heavy usage before needing recharging. Only area of weakness for me was the camera that had a few issues and would sometimes not recognize me in low light environments. My other laptop cameras never had such issues. In its defense, the “AI” offered to help by registering my face; a neat feature that seemed to improve the camera’s performance.\n\nIn conclusion, the HP OmniBook X Flip laptop won me over for its versatility, solid quality build and its overall performance. Its big clear screen displays beautiful colors and its sound outshines many higher end laptops. The AI features are a plus but a bit limited for now. As long as you are not looking to play high end games or run graphic intensive software, the OmniBook X Flip comes close to being the perfect device for everything from work tasks to creative projects and entertainment.",
      "rating": "4"
    },
    {
      "title": "Gorgeous and highly functional",
      "body": "I’ve realized I might have a problem- I am obsessed with finding the ideal laptop for the live I’m living. \nI’m fortunate to travel frequently and have an in-office schedule that is substantially under my control, but when I need to work (and I work on everything from design-to project management-to photo editing. What do two situations mean? \nI have to be able and inspired to perform efficiently and at a high level at any given moment, anywhere in the world. \nWhen the HP OmniBook X Flip arrived, I was impressed with the presentation and unboxing experience.  But that fades.  What sticks with me is this stunning recycled aluminum device is a pleasure at which to look and hold. The build is very high-quality. The touchscreen is gorgeous. It is glossy, but I haven’t been as frustrated with fingerprints as on other devices.  The charcoal colored case itself doesn’t  really show much contact at all.  This is nice since the Flip means you can effectively use the HP as a tablet.  \nDon’t get me wrong though, this 16” model is hefty and needs to be conscientiously handled.  It doesn’t feel fragile, it’s simply at the max form factor for my use (your physical and working situation obviously will vary) The 14” might be optimal for most people.\nThat said, it is nice to have a large screen for drawing and photo reviews.  Images are crisp and vivid. I did find colors rendered differently from just about every device I have (reds in particular). I ran a color analysis and made adjustments to my own preferences.  The touch feature is responsive and enjoyable. \nSo far, kudos on the build and design.  The reality these days is the competition is fierce. Once you get past that criteria, the selling points are performance and features.  I found performance to be very good with the exception of an irritating glitch at times with Bluetooth devices such as keyboards and mice.  It’s an occasional delay, and probably something that will get fixed with a device driver tweak that has not been addressed at the writing of this review. I also liked a very clear ability to cover the camera for privacy. Sound was very good, even impressive at times. \nPerformance successes include an impressive battery life (so far 12-16 hours for my usage), the flip feature allows for multiple usage scenarios: laptop, tablet (keys are disabled) and viewing/working. \nFeatures are generous. Using Microsoft CoPilot AI, you can enjoy on-device AI research of your own documents without sharing data with HP, nor Microsoft.  There are some cool and useful video features including Magic Background, Live Stream Integration, and the ability to layer multiple video sources. \nPhysical features- all good or nice: trackpad is large and responsive, Ports:  10Gbps USB B (2) and C, HDMI, USB-C Lightning and a mini headphone. \nThe keyboard is large and responsive. I don’t love the feel, but it’s another personal taste item. \nOverall, I really like this devices. I seek reasons to open and use it frequently.",
      "rating": "4"
    },
    {
      "title": "Great 2 in 1, fast AI computing, not real 2K.",
      "body": "Looking for a portable PC with the power and versatility of a desktop is relatively easy to find, until you want a touchscreen and tablet functionality, then the options start to dwindle. The HP OminBook X Flip is now available in 16\" format and promises all the features of a desktop in a relatively compact size. \n\nI like how thin and compact it feels and looks with the tapered edges, yet remains premium and solid. The hinges are strong and hold the screen at any angle you choose, which is especially helpful in getting the right angle for handsfree movie viewing. The keyboard is big and spacious enough for my large hands, though I'm surprised they couldn't manage a numpad in the layout. The backlit keyboard has some good light piping on both low and high settings; I like the ability to set the time the light stays on from 30s, 3min, or always. The speakers don't disappoint with very good surround simulation and loud, full range sound. You'd have to be an audiophile to not like the sound, the bass is good as expected for such small speakers, sound is projected well. You get a super-fast Thunderbolt 4 USB-3 port for up to 40gbps transfer speed and display port capability, as well as a standard USB-C and A and HDMI, and headphone jack. Really, the only thing missing is a microSD slot, but you could always get an adapter for photo and video transfer. \n\nMy least favorite feature is the screen. While as a touchscreen, it registers multi-finger touch quick and accurately, the resolution and light dispersion leave much to be desired. Initially, when 4K came out, the xK resolution is multiplied by 2 to get the megapixels you should expect, thus a 2k would be 4Mp, 3K is 6Mp, and 4K is 8Mp. By the original definition, this would be equivalent of a 1K screen or 1080p (1200p). The light dispersion is blotchy at low illumination, clearly evident on startup, but looks fine at higher NIT and contrast settings. Color reproduction is really good for an LED. There's no separate GPU, rather an embedded Intel Arc 140v with 128MB of dedicated memory and 8GB max shared. That said, gaming is good with most titles; AI acceleration really shines at getting the frame rates you need. I got a few hiccups and ghosting while on DBZ Sparking Zero, but still better than my usual rig running an AMD Ryzen 9 extreme.\nThis is a well featured laptop with tablet functionality that sports built-in AI allowing for offsite computing help with demanding tasks making it appear faster than it otherwise would be. Plenty of great features rolled into this unit, and if you're not getting it for hardcore gaming or movie-binging, then the screen should be fine. Otherwise, there are other models, similarly priced that offer 3k OLED displays for less compromises.",
      "rating": "4"
    },
    {
      "title": "HP OmniBook X Flip: Premium 2-in-1",
      "body": "I was excited to get my hands on the Omnibook X Flip 16, a 16-inch touchscreen laptop that also flips into a tablet. It's one of the new AI PCs, that has built-in AI tools to help with things like writing, organizing, and analysis. I put it to work with a variety of productivity tasks and entertainment.  The Omnibook X Flip showed little weakness, HP did a great job here!\n\n*Design and Build*\n\nRight from the start, this laptop's build feels premium. It’s got a dark gray metal body that looks clean, weighs about 4 pounds and is a little more than half an inch thick. Even with a 16\" screen it’s still pretty slim and not too heavy. The 360 degree hinge lets you fold the screen all the way around, so you can use it like a regular laptop, flip it into tent mode to stream videos or watch movies, or even turn it into a tablet with a touchscreen. Typing on the keyboard is a smooth experience. The keys are big and easy to see thanks to the backlighting (a few customizations on backlighting too), and feel great with satisfying feedback and a smooth click. The trackpad is large and responsive too. There are several ports to choose from which is nice considering all of the peripherals I use: (2) USB-A 10Gbps ports, (2) USB-C ports (one with Thunderbolt 4 at 40Gbps and one at 10Gbps), an HDMI 2.1 port, and a headphone/mic jack. It is missing a media slot if you are a photographer. The webcam does a great job for video calls. You can set it as high as 1080p, and even 4K if you are recording videos. It has a physical privacy shutter and supports facial recognition, which makes logging in fast. The camera can track your face and blur the background, which is great when I’m in video meetings. There is a significant amount of customization for video calls. Overall, the design and feel is premium.\n\n*Specs and Features*\n\nThis laptop comes with an impressive hardware suite. An Intel Core Ultra 7 155H processor, which is part of Intel’s lineup focused on performance and AI capabilities. It has a separate NPU that can handle certain AI tasks without using the cloud. The laptop also comes with 16GB of LPDDR5x memory, which helps with multitasking and opening several apps at once. The 1TB PCIe Gen 4 NVMe SSD is quick when loading apps or opening files, and there’s plenty of space for storage. It uses Intel Arc integrated graphics, which are better than your typical built-in GPU. It won’t replace a gaming laptop, but it’s good enough to play some casual games and handle creative tasks like video editing or digital art. The Arc graphics also handled creative suites with no problems. There’s a dedicated key to launch AI tools, along with the usual media keys and an emoji key. The 16-inch 2K touchscreen (1920x1200) is vibrant, responsive and is approximately 400 nits. The screen is glossy, which makes colors pop and movies look great indoors, but can be more reflective outside if you plan on taking it out in the sun.  It also supports a stylus, unfortunately you will have to buy the style/pen separate.\n\n*Software*\nThe camera has extra features like HP Enhanced Lighting and HP Camera Control, which help make video calls look better. There were a couple of preinstalled apps I didn’t need, like antivirus trial software, but those were easy to remove.\n\n*Performance*\n\nThis laptop runs really smooth. I can have a ton of tabs open, listen to music, and work on creative suites at the same time without lag. The CPU, NPU, and memory do a great job handling multitasking.  I tested a few light games on medium settings and they ran well. It’s not made for heavy gaming, but it’s good enough for casual gaming and creative work.  The laptop stays cool most of the time, and the fans only spin up when doing something more intense like video editing. Even then, it’s not too loud and it's definitely safe for your lap. These new Intel Ultra processors are very efficient but also run very cool. Battery life is solid and HP claims more than 20 hours but that depends on what you're doing. I'm getting about 15 to 20 hours on a charge with regular use. That covers a full day for me. It also charges quickly, about half a charge in 30 minutes, which is great if you’re in a rush.\n\n*Pros and Cons*\n\nPros:\n\nStrong build and premium design\n\nBig, bright 16\" 2K touchscreen\n\nPowerful CPU & NPU for AI\n\nLong lasting Battery\n\nComfortable keyboard and large trackpad\n\nFast ports \n\n*Suggestions/Needs Improvement*\n\nSpeakers are average\n\nNo Pen/Stylus\n\n\nAfter spending time with the HP OmniBook X Flip 16, I can say it’s a great all-around laptop. It’s fast, it's efficient, it's powerful, and it looks great. The 2K screen is perfect for work and entertainment, and the fact that it folds into different modes makes it even more useful.  I’d recommend the HP OmniBook X Flip 16 to students, work professionals, or those looking for a versatile laptop with AI features/capability.",
      "rating": "5"
    },
    {
      "title": "OmniBook X Flips Brings Do-It-All Style",
      "body": "I really think computers that can fit into that \"laptop\" / \"tablet\" space really bring a lot to the table and are a great buy. But HP steps it up with their latest OmniBook X Flip as it adds some awesome specs plus the power of CoPilot AI!\n\nPROS:\n- Onboxing this laptop, it's a very visually appealing laptop! The color looks great, the material feels very upscale, and just has a nice look to it.\n- My favorite part of this laptop is going to be the screen for a number of reasons! First, the bezels are super thin and I love the look it it. It also has a 2K screen which gives the color and clarity a lot of pop! Of course, the big selling point too is the touchscreen and it's very responsive and fun to use for both work and play. Lastly, it's a huge screen! 16\" on a laptop makes it great to work on either at a desk or on the go.\n- On that topic, the 2-in-1 aspect works great with this. The hinge on it does not feel cheap but you can easily flip it around to go from laptop to tablet and you can put it in a number of different positions that help for creating content or viewing content.\n- HP brings the typical awesome specs on top of all of that as well. It has a great processor, tons of memory, plenty of SSD storage, and just overall feels like it zips between programs while using it.\n- Windows 11's CoPilot+ I have found really useful too. It helps simplify some of my work, navigate questions easier, and makes me more confident in what I am trying to accomplish. I think its a nice way to incorporate AI into every day use or specific tasks.\n\n\nCONS:\n- This is a great size laptop but I do think it would benefit from being even thinner and lighter than it is. Of course I understand the trade off would be less ports, but just my thought.\n\nBOTTOM LINE:\n- Having a computer that is great for sitting down and getting stuff down, as well as enjoying yourself, is something I think a lot of people want. And the HP OmniBook X Flip really brings that level of fun and work. It has a tremendous screen, awesome flip style with the touchscreen, and is loaded with top level specs. I think this will be a daily driver for a lot of people!",
      "rating": "5"
    },
    {
      "title": "A lot of capability in a small package",
      "body": "This is a beautiful laptop and more. Sporting an Intel Core Ultra 7 256V processor, a nice, large 16\" (1920 x 1200) 500 nit IPS LED touch display, 5MP IR camera, a 1TB NVMe PCIe4 SSD, and 16GB LPDDR5X SDRAM, all weighing-in at 4.15 pounds, this machine sports blazingly fast performance along with beautiful aesthetics. On the outside, you'll find sufficiently robust I/O, which includes 2 USB Type-A ports, an HDMI 2.1 port, a headphone/microphone combo connector, 1 Thunderbolt 4 with USB Type-C (40Gbps!) that also serves as a USB charging port, and 1 USB Type-C (10Gbps) that, like the previous port, can be used for charging the laptop. To facilitate robust AI performance, this machine includes Intel® AI Boost (performing at 47 NPU TOPS).\n\nThe unboxing was uneventful. The industry trend is to park the charger and any related cables under the laptop in the box, and this product was no exception. The laptop was in a nice protective cover to help ensure that the finish was perfect out of the box.\n\nSetting up Windows was quite easy, as that process has gotten much more streamlined over the years.\n\nYou might guess by the product name that this can be used as a tablet, and you'd be correct. It can be used in that manner. I got this laptop for my wife, and we are both \"old school\" and this laptop will most likely never see this use-case.\n\nTo be determined is battery life. HP advertises \"up to 15 hours\", but like all vendors those numbers generally do not reflect reality. If this machine gets ~10 hours between charges, I'll be happy.\n\nThis is a beautifully designed machine and has a lot of horsepower. I don't believe you would be disappointed if you purchased one.",
      "rating": "5"
    },
    {
      "title": "Quality Conputer",
      "body": "Very fast computer. I love the size of the screen too.",
      "rating": "5"
    },
    {
      "title": "HP OmniBook X Flip 2-1 2K Screen",
      "body": "I purchased this pc to replace an hp that could not be upgraded to windows 11 The OmniBook X Flip 16 2k is a 2025 model, very quick in app launch, both boot up  shut down LED display is excellent very sharp, clear, clean and crisp The 2 USB A and Thunderbolt 4 usb c & std usb c provide easy wired connections The touch screen is very responsive and the cooling fan is quiet. I decided to get the My Best Buy Total membership for initial setup, app installs, Geek Squad support and product protection I gave it 4 stars only because it doesn't have number keys It is an excellent pc so far",
      "rating": "4"
    },
    {
      "title": "Ron",
      "body": "I really like my HP laptop. I didn't realize it didn't have a number keyboard until I got it home. That was my mistake. I would exchange it if I could for what I really wanted. But, botom line The laptop works great and myu Best Buy service was what I would have expected. Thanks",
      "rating": "5"
    },
    {
      "title": "Review of HP Laptop",
      "body": "So far so good! Battery life is good. Size is great. I bought it for school. I think it is a great value for the price!\n\nThe only con I have is the keyboard is flat and there is no space between the keys. It is difficult to find the home keys when typing in a hurry. I think it will be fine once I get used to it. Or I will add a wireless keyboard.",
      "rating": "4"
    },
    {
      "title": "Positive reviews.",
      "body": "Awesome lap top. A little on the heavy side but it has\nMore positive aspects such as fast speed, touch screen and wide screen. The keys are well spaced and the battery has a long life. I purchased mine on sale a week ago and it was good buy",
      "rating": "5"
    },
    {
      "title": "Very Pleased",
      "body": "This laptop has a good balance between usability and portability; I like the smaller size and it's lite weight. My old laptop's battery life and storage were about nonexistent, but this one has plenty!",
      "rating": "5"
    },
    {
      "title": "Excellent product and assistance!",
      "body": "Excellent laptop. Meeting all my needs. As a member the Geek Squad was helpful in setting it up and answering all my questions!!! Thanks to Will and Will!",
      "rating": "5"
    },
    {
      "title": "Product impression",
      "body": "This the 16” version we own, we also purchased the 14” version for travel. Screen brightness could be better if it is OLED. Battery life if good. Product quality control of the product is good.",
      "rating": "5"
    },
    {
      "title": "HP Laptop",
      "body": "Great laptop. Keyboard is very nice to type with compared to other laptops I have used and the touch screen function is a plus.",
      "rating": "5"
    },
    {
      "title": "Highly recommended",
      "body": "I’ve been using the HP OmniBook X Flip 2-in-1 for a few weeks, and it’s been a solid companion for work, and some downtime streaming. Slick and sturdy design!",
      "rating": "5"
    },
    {
      "title": "Great laptop with great speed!",
      "body": "Great laptop with great speed. Color display is great. I love the versatility of this PC, and affordibility.",
      "rating": "5"
    },
    {
      "title": "Good purchase",
      "body": "So far, so good.  This is a nice laptop. Easy to use and super fast.  The Geek Squad was extremely helpful",
      "rating": "5"
    },
    {
      "title": "Bang for your bucks",
      "body": "So far, love, it i mainly got it for school, and emails and documents, and it is snappy in those aspects.",
      "rating": "5"
    },
    {
      "title": "Happy customer",
      "body": "Clear sharp screen. Larger letter keyboard which makes it easier on older eyes.  Very happy with product.",
      "rating": "5"
    },
    {
      "title": "Great laptop !",
      "body": "Excellent service /advice on purchasing this fantastic new laptop. I've only had it two weeks ,but haven't found any issues.",
      "rating": "5"
    },
    {
      "title": "Very Happy",
      "body": "Excellent computer, meets all business and personal needs.  Great processor on Graphics applications",
      "rating": "5"
    },
    {
      "title": "HP Omnibox",
      "body": "Have been using for a week now and so far no problems. Very happy with the purchase and support received after purchase.",
      "rating": "5"
    },
    {
      "title": "Best Computer",
      "body": "I love this computer alot. I truly recommend this computer to everyone. The load time is amazing very fast and show great color.",
      "rating": "5"
    },
    {
      "title": "HP Omni book",
      "body": "Works great and plays some high intensity games. I did buy a cooling pad, because it does emit a lot of heat",
      "rating": "5"
    },
    {
      "title": "Great computer and deal!",
      "body": "Excellent computer that does everything you need! Nice color and easy to set up.",
      "rating": "5"
    },
    {
      "title": "Works Well",
      "body": "Only been using it about a week. Everything is fine, still trying to get it completely set up, though.",
      "rating": "5"
    },
    {
      "title": "Laptop/tablet flexibility a plus",
      "body": "Love the flexibility of using this PC as a laptop or as a tablet.\nDoes everything I need it to do.",
      "rating": "5"
    },
    {
      "title": "Great Laptop for the price",
      "body": "Always liked the HP products.  Best Buy had this in stock. Suits my needs.",
      "rating": "5"
    },
    {
      "title": "Very user friendly",
      "body": "Very user friendly computer.  Even for users with limited computer skills",
      "rating": "5"
    },
    {
      "title": "Great Speed",
      "body": "I love the start up speed. I open the lid and it starts up even after shutting it down, even with having all the same files and programs on it.",
      "rating": "5"
    },
    {
      "title": "HP-OmniBook X Review",
      "body": "Great computer and great service and help from Best Buy in my purchase!",
      "rating": "5"
    },
    {
      "title": "OmniBook Laptop",
      "body": "great screen size, keyboard easy to use, the touch screen make it easy to maneuver",
      "rating": "5"
    },
    {
      "title": "Great laptop",
      "body": "Pretty attractive laptop if I must say. Has everything I need to complete my daily tasks.",
      "rating": "5"
    },
    {
      "title": "Highly Recommend",
      "body": "Amazing product, super friendly customer service. This is exactly the Laptop I wil need for schooling and beyond.",
      "rating": "5"
    },
    {
      "title": "This is great for my needs so far",
      "body": "This was everything i was looking for especially speed and functionality. The size is perfect as well. The only issue i have is i wish the battery would last longer.",
      "rating": "4"
    },
    {
      "title": "Great one",
      "body": "Very nice laptop I would buy one again thanks have a great day",
      "rating": "5"
    },
    {
      "title": "Great choice",
      "body": "Haven’t had a chance to try out all the bells & whistles but it’s faster than my old laptop and I love the ability to flip it around to use as a tablet.",
      "rating": "4"
    },
    {
      "title": "Great Buy",
      "body": "Great Buy wish I had done this a lot sooner than I did",
      "rating": "5"
    },
    {
      "title": "Home owner",
      "body": "This laptop is a lot faster than my old one.i like the fact that it has the touch screen.",
      "rating": "5"
    },
    {
      "title": "Hp Laptop",
      "body": "Awesome Laptop. Fast and very light. User friendly and powerful...",
      "rating": "5"
    },
    {
      "title": "Excellent Omnibook",
      "body": "Great computer. It works super fast and gets the job done",
      "rating": "5"
    },
    {
      "title": "Best Buy",
      "body": "Quality of product good service friendly staff all good",
      "rating": "5"
    },
    {
      "title": "Solid laptop",
      "body": "Machine works as expected. The flip top tablet option is very nice",
      "rating": "5"
    },
    {
      "title": "Laptop",
      "body": "Not issues so far in product other than makes a odd start up sound internal click but works fast!",
      "rating": "4"
    },
    {
      "title": "HO Laptop",
      "body": "Fast machine. Easy to use. Excellent screen quality.",
      "rating": "5"
    },
    {
      "title": "retired",
      "body": "I really like my new HP Ultra7 so far it is great.",
      "rating": "5"
    },
    {
      "title": "OmniBook",
      "body": "Easy setup.  Great laptop with large, clear display.",
      "rating": "5"
    },
    {
      "title": "Great Value",
      "body": "This is a great computer that fits all of my needs for both personal and business use.",
      "rating": "5"
    },
    {
      "title": "Hp",
      "body": "Excellent!!!! I'm 100% contented. The product met my need.",
      "rating": "5"
    },
    {
      "title": "Maureen's Laptop",
      "body": "The salesman was very helpful in listening to my needs and giving me the lap top to fit them.",
      "rating": "5"
    },
    {
      "title": "Awesome PC",
      "body": "Love this laptop PC which also can be used as a tablet. PC is sleak and light portability",
      "rating": "5"
    },
    {
      "title": "Replacing a old Laptop for a New One",
      "body": "Awesome  Laptop super fast and graphics  is amazing",
      "rating": "5"
    },
    {
      "title": "New laptop!",
      "body": "Love it so much!!!!!! Exactly what I needed!!!!!!!",
      "rating": "5"
    },
    {
      "title": "Owner",
      "body": "Amazing product. I bought multiple of them for my employees",
      "rating": "5"
    },
    {
      "title": "great",
      "body": "just needed a new laptop to replace outdated one so far this HP is great",
      "rating": "4"
    },
    {
      "title": "All Good",
      "body": "So far so good. No problems yet. Husband likes it.",
      "rating": "5"
    },
    {
      "title": "Fun with Omni book",
      "body": "Love the screen. Had great service from staff and Geeks!",
      "rating": "4"
    },
    {
      "title": "Great Everyday 2-in-1",
      "body": "I've been using the HP OmniBook X Flip for just over a week now, and overall, it's been a very capable and flexible laptop for my daily needs. Doesn’t lag very much when using it, very snappy and quick. I like the large touchscreen, and battery life (longest I got 15 hours). The OmniBook X is a sleek, professional-looking laptop. While it has a few quirks, especially the keyboard design, it’s a solid pick for most users looking for a powerful, modern 2-in-1.\nPerformance:\nWith the Intel Core Ultra 7 and 16GB of RAM, this laptop easily handles multitasking. I’ve used it for web browsing, video streaming, document editing, and light creative work, and it never felt slow or laggy. The 1TB SSD provides plenty of storage and keeps things snappy. Whether you're working in Microsoft Office, bouncing between 20+ browser tabs, or using AI tools like Windows Copilot or live captions, the system runs smoothly and stays cool.\nDisplay & Media Experience:\nThe 16-inch 1920 x 1200 touchscreen is crisp and responsive.  The title say 2k screen but the description say FHD+. It’s not a true 2K panel (2560X1600 pixel), but it still looks great for everyday use. I watched movies at night on this laptop, and the display was bright and colorful enough to enjoy in low-light conditions. The large screen and decent color contrast make it perfect for Netflix, YouTube, or picture viewing. \nSpeakers:\nI was surprised by how loud the speakers are—they can easily fill a room with clear audio. Whether I was watching videos at home or listening to music while working, the sound quality was more than adequate. No external speaker needed.\nBattery Life:\nBattery life has been excellent so far. I’ve been averaging about 9 hours of real use (15 hour was the longest) , which includes working on documents, streaming, and general browsing. It’s more than enough to get through a full workday or a long study session at a coffee shop without needing to plug in.\nDesign & Portability:\nThe build quality feels solid. It has a premium look with the Eclipse Gray in some light finish, though I’m not entirely sure if the chassis is metal or high-grade plastic. Either way, it feels sturdy and well made. It's a bit large for using in handheld tablet mode for long periods, but great when propped up in tent or stand mode for presentations or watching shows. It’s not ultra-light, but I had no problem carrying it in my backpack and working on the go.\nKeyboard & Trackpad:\nHere’s the main downside for me: the keyboard. The keys are oversized and don’t have much spacing between them. It almost feels like typing on a touchscreen, and it took some getting used to. Some people may like it, but if you're particular about key spacing or do a lot of typing, you might want to test it in person. On the plus side, the trackpad is large, smooth, and very responsive.\nFinal Thoughts:\nThe HP OmniBook X Flip is a versatile and powerful 2-in-1 laptop with great battery life and a sharp, responsive display. It’s a great fit for professionals, students, or anyone needing a flexible device for both work and entertainment. Just be aware of the keyboard layout—it’s not for everyone.",
      "rating": "4"
    },
    {
      "title": "Impressive in every way",
      "body": "I have owned many computers over the past 40 years, and this HP OmniBook X Flip is the best so far. From the moment I took it out of the box I knew that it is commanding of attention. It is a solid computer that looks great and has paid attention to every detail. Plug in the USC-C power supply and turn it on. The keyboard lights up and reveals the large letters on the keys and the efficient layout of the specialty keys. The large trackpad makes it easy to move around the screen or just touch the screen. The computer takes you through a series of well-designed prompts to inform the computer how you want to set it up. Once through the setup and update process, you are free to use the computer in a multitude of ways, as a laptop or as a tablet. The intel Core Ultra 7 CPU also packs a powerful GPU (Graphic Processing Unit) and NPU (Neural Processing Unit). The computer also has 16 GB of Memory and a 1 TB Solid State Hard Drive; the result is a blazingly fast computer that does everything exceedingly fast. There is not a task that I have given this computer that I was not impressed by the results. The screen is bright and clear. The keyboard has a smooth and nice tactical feedback that is confident. The battery life is impressive; I can spend the entire day on battery power without a concern. The Wi-Fi 7 speed is fast. I spend several hours a day on video conferences and the camera and performance is incredible, my other colleagues have all sorts of issues and with this computer it is all very smooth and performant. It is enabled to take full advantage of all the capabilities that Windows 11 has to offer like Windows Hello security, and CoPilot AI support. HP has managed to pack in two 10 GB USB-A ports, two Thunderbolt 4 USB-C ports, an HDMI port, and an audio jack. This computer will not disappoint. I am a software developer and a power user, so I put a great deal of demand on my computers; this computer handles it all very well.",
      "rating": "5"
    },
    {
      "title": "Not so great",
      "body": "It's an ok laptop but the charger hets hot when charging the computer and without paying for an membership with Best buy the return window is really short.",
      "rating": "3"
    },
    {
      "title": "Ok",
      "body": "Works nice I guess.  Review has to be 50 characters so I'm just typing words now",
      "rating": "3"
    },
    {
      "title": "It's a very portable, fast, quality laptop",
      "body": "I really like this HP OmniBook X Flip 16 inch Laptop.\nThe processor is fast, it has plenty of SDRAM for my applications and a large capacity SSD. \nThe battery lasts for hours running videos, playing app games, and surfing the internet. \nIt is sleek and lightweight making it very portable. \nI love the large screen.  The touchscreen is responsive, though I did find it to be slightly inaccurate. In times of needing to tap small icons I have needed to tap a little to the left to get the appropriate response, such as tapping on the x to close windows. The on screen keyboard is large enough that it responds accurately without any adjustment on my part.\nThe ability to flip or stand this laptop in so many ways is great. The hinges feel strong while working smoothly.  \nVideos play smooth, the speakers work great,  the 5MP camera is clear and video calls have been no problem with this machine. \nThe flexible quick charging USB-C cord is easy to take along.  \nIt's a very portable, fast, quality laptop.",
      "rating": "5"
    },
    {
      "title": "HP as in High Performing",
      "body": "[PROS]\n\nConvertible: It's a known that this laptop can be used in multiple positions. However, I did own a HP many years ago capable of the same abilities, but hinge mechanism became defective. The verdict is still out, but I find myself quite impressed with the craftsmanship thus far. I've been able to position the laptop as needed without having to constantly readjust.\n\nPower Packed: The processor, RAM, and SSD combination that's found \"underneath the hood\" is where the OmniBook X shines. I'm able to swiftly conduct an abundance of AI requests while running other applications and store all of the files/data without a storage capacity concern. Furthermore, all the external USB ports have allowed me to conduct fast file transfers as needed.\n\nGaming Functionality: This is primarily a productivity device. Yet, I was pleasantly surprised at how well the Intel Arc 140v GPU handled gaming with its profile. This feature might get overlooked, but the GPU adds a major benefit to this laptop. I was able to get 40 to 50fps in a large number of titles albeit with some tweaked settings. Regardless, the GPU adds another dimension to the OmniBook X.\n\nLong Battery/Fast Charge: This laptop can go. I've been able to use it continuously for 12+ hours without the the battery dying. Charging gave it a quick boost so I don't fear the need to be tethered to a cable anymore throughout the day.\n\nOther positives: The Poly Camera software has been nice to use during meetings. I'm fond of the changes that I can make on the fly to enhance my video. WiFi and Bluetooth connectivity has been very stable. I'm able to move about to different areas without a disruption.\n\n[CONS]\n\nDisplay Shortcomings: The resolution is nice enough, but its just a bit shy of being a QHD (1440p) screen. It has a moderate brightness level, and its definitely not the best in dealing with color.\n\nSmall nitpicks: The RAM is sufficient, but not upgradeable. The keyboard lacks a side keypad, but this can be overlooked as well.\n\n[CONCLUSION]\n\nFrom my experience, this laptop pretty much matches up with its description. I've been able to integrate the OmniBook X into my development workflow with ease. Its not perfect, but performs well.",
      "rating": "5"
    },
    {
      "title": "Disappointed",
      "body": "I have the laptop for less than one month and it won’t turn on. Went to geek squad and told the hard drive needs to be wiped and reset.",
      "rating": "1"
    },
    {
      "title": "Great multipurpose computer",
      "body": "I love the versatility of this Flipbook. The screen size is perfect in my opinion- big enough to stream movies and play games without missing any of the action, but not so big to be a hassle to carry around. The sound is surprisingly good for this type of computer. Kind of shocking how loud it can be (but not distorted at all). Processing is fast. Downloads and installs are quick. If you are a serious gamer, I'm sure you are looking for more, but for people looking for a fast, efficient, and versatile laptop/touchpad- this is it. I love the size of the keyboard buttons and layout-very easy and comfortable to use. Graphics and color are really nice. The Copilot and HP AI Companion apps are extremely helpful for whatever projects you are working on or information you are trying to find. They are always learning based on your usage and will make suggestions to help you get the most out of whatever you are trying to accomplish. Using the unit as a tablet is easy as well. The touchscreen is simple and intuitive. I think my son is going to steal this from me when he leaves for college next fall for his first-year engineering program, so I will enjoy it while I can. I highly recommend this product.",
      "rating": "5"
    },
    {
      "title": "Workhorse laptop",
      "body": "I’ve been spending some time with the HP laptop. And it’s a perfect business workhorse. Straight of the box the build quality is super nice and feels great. It has great I/O ports for productivity and not needing a separate dongle just to use a USB. But also is tasteful where you aren’t slammed with way too many ports. The keyboard feels fantastic and responsive it’s has a good tactile feel which I love and the keys are fairly large which make it comfortable to use. The screen is beautiful and clear. And speaking of the screen. It flips to allow for it to be used and a drawing tablet with is super nice. But what is really cool is you are able to spin the laptop and have it stand vertically to allow for ease of use of spreadsheets and browsing. I use the laptop sideways and use a dock and have the vertical screen as my second screen while connected to a separate monitor. This laptop is perfect for work and the battery will keep up with you every step of the way. That battery lasts so long I forget that I have a charger. Definitely a great workhorse laptop.",
      "rating": "5"
    },
    {
      "title": "Takes advantage of all Window 11 has to offer",
      "body": "This laptop is the perfect companion for Windows 11. It is configured to work flawlessly with Co-Pilot AI and HP has its own Beta AI companion application. It looks great using as a laptop and the keyboard keys are full size and easy to use. However, there are no separate number keys or lights on the keys. The power cable is compact the power brick small is and only the size of a small power unit. The webcam has built in cover which is nice for privacy. It stands up firm and steady in tower view and works great in tablet mode also, however it is a little heavy. The touchscreen is responsive and easy to use. Setup was straightforward and it is loaded with no bloatware which is something you don't see in many computer setups. It includes a 30-day subscription to pre-installed MacAfee internet security software. The specifications give it all the power for daily tasks, work and power applications. There is 16GB of RAM and you can play basic games, but the graphics are integrated and not designed for high-end gaming. The quality of the build and the latest internal specs for running AI, will give this laptop a long future to run the latest software.",
      "rating": "5"
    },
    {
      "title": "A Great College/First Job Ready Laptop",
      "body": "HP's OmniBook X Flip 2-in-1 is an amazingly solid laptop for the price point. It's future-ready whether you're taking on a new job or heading off to school.\n\nTL;DR:\n- won't replace your gaming machine\n- solid choice for your everyday productivity laptop\n- high quality 2K touch display, keyboard\n- slim form factor at 16\" - it's not heavy or chunky\n- all-day battery life even with gaming and streaming\n- out-of-the-box storage at 1TB plus integrated AI Arc graphics card\n- Copilot+ is a productivity amplifier\n\nHP's OmniBook X Flip 16 is not the most top-of-the-line gaming system or beefy maxed out production machine. It wasn't built to be that. Instead, it's meant to be a solid contender for your everyday laptop, and it's amazingly qualified for that.\n\nThe OmniBook has a sleek look - it's not clunky (just over half an inch tall) or heavy (only 4lbs), despite having solid battery life. I tested unplugged full day content creation, heavy internet usage, videos, and gaming, and still had plenty left over for the next day's work.\n\nThe onboard AI is interesting from both the hardware and software perspectives. The inclusion of a pseudo- 8GB graphics card (Arc) means that the OmniBook X can actually game by way of using the Neural Processing Unit (NPU). It's not a top of the line gaming machine by any means, but it certainly handled a fair assortment from Steam with mid to low settings. This AI chip also means that the laptop can handle an on-board HP AI agent, and it seems to come bundled with a few options for those via the HP AI software. I was pleased with the results from some simple queries that seemed to stay native to the machine. Will it outperform a live Copilot query? No, but if you're on the go and have limited connectivity, it will still do the trick... \n\nSpeaking of Copilot+ - there are some truly interesting features that you'll want to explore which benefit extensively from the onboard NPU and since it's AI-ready out of the box, you know there's more to come as they roll out new software features. There's also a dedicated AI button on the keyboard so you can very quickly access Copilot. With Office and Edge working in tangent with Copilot+, the OmniBook X has positioned itself as an AI sandbox, if you want to use it that way - and it can really quickly bust through tasks.\n\nOf the things that the NPU enables you to do, the most relevant to your daily usage will probably be Cocreator (generating images) and live captions. Recall is fine but you may want to opt out for privacy considerations and windows studio effects in video calls seem like a nice trick that needs some polishing. \n\nI found most every productivity and content creation need was capably handled by the OmniBook X - including some light graphics work, memory-heavy browser apps, and chonky spreadsheets and word documents. The 16GB of ram could be a bit higher but efficiency in power consumption was the name of the game here.\n\nThe number and positioning of the USB-C and USB-A ports didn't give me a headache. The touchpad and keyboard had a nice form factor and I felt pretty comfortable typing for an extended period. The heat distribution was also not uncomfortable extended uses. The power brick has a decently long and canvas coated cable and a small form factor, and can be easily re-routed (although only one side of the laptop has power access).\n\nHP utilizes recycled metals and plastics on the casing and the keyboard and speaker enclosures and there was not a ton of plastic in the actual box itself.\n\nHere's the one and only downside I've found so far: the actual audio output from the speakers was kind of disappointing. And if this was my one and only streaming device, I'd want to invest in some bluetooth external speakers or something similar.\n\nGiven that this laptop doesn't aim to be the craziest gaming machine or the most maxed out graphics slinging mobile production studio, this would be the kind of laptop I'd send along with my kids to school or something I'd want to pick up for my first job. It's a cozy laptop which gets the job done and something I can feel good about taking with me on the go, since I know it's not going to run out of power after a few hours.\n\nThe onboard AI tools are absolutely interesting and fun to work with, and you get the sense that they're gearing up for more as those features roll out.\n\nAll in all, this is a solid laptop choice for your daily driver.",
      "rating": "5"
    },
    {
      "title": "Flippin cool laptop",
      "body": "I have been using 13\"/14\" laptops for a while now and my aging eyes are starting to struggle with the smaller screens. So I wanted to give 16\" screen a try. The HP OmniBook x Flip appears to be a versatile 2-in-1 laptop that combines good performance for daily computing tasks with a twist.\n\nMultitasking isn't an issue with Intel Core Ultra 7 processor, 16GB Ram and 1TB SSD. The Omnibook X Flip excels at multitasking and smoothly handles multiple applications without lag, providing a seamless experience for everything that I need a computer for (mainly email, web surfing office related tasks). The OmniBook X Flip has an integrated graphics, but for streaming videos and basic photo editing it is sufficient. However, it is not going to suit most gamers needs or graphics-intensive tasks that require discrete graphics.\n\nI didn't know how I would like the keyboard when I first opened the laptop, but the backlit full-sized keys are comfortable to type with and have a good travel to them making it a pleasurable experience to type on. I am typing this review on this laptop on my couch with the lights down low and I have NO problems reading any of the keys. One thing I immediately noticed was the power button just above and next to the backspace and delete buttons.  At first I thought I would be shutting the laptop down every time I'd miss the delete or backspace buttons, but it doesn't shut the laptop down unless you press and hold for a few seconds. I'd still prefer the button be a little further away from the main keyboard. The touchpad is responsive and accurately detects multi-touch gestures. Windows Hello functionality via the web cam facilitates quick and secure logins even in dimly lit environments, adding to the convenience factor. There is also a privacy shade for the webcam. Keep in mind Windows Hello will not log you in if that shade is closed.\n\nA feature that I don't find myself using often is the laptop's 2-in-1 functionality. Holding a 16\" screen is comically large. Especially if you remember the first LCD screens were 15\". Transition between laptop and tablet mode is simple. The 360-degree hinge is sturdy and appears well built. I do use it in \"tent configuration from time to time. Having the touch screen is handy for that.\n\nThe device features a 16-inch 2K display with vibrant colors and good viewing angles. The brightness is adequate for indoor use, though users might experience some difficulty in direct sunlight or bright environments due to the glossy screen, but the screen does have a coating on it that reduces some light glare. I usually prefer matte screens to glossy, but this screen does not bother me.\n\nThe OmniBook x Flip stays relatively quiet under light to moderate load conditions. However, during more intensive tasks, the fan noise becomes noticeable, but not distracting as far as I am able to notice.\n\nThe laptop offers a standard array of I/O ports, including 2 USB-C, 2 USB-A, HDMI and 3.5mm headphone jack. Unfortunately no SD card reader here . \n\nOverall, the HP OmniBook x Flip 16 with Intel Core Ultra 7 is a solid choice for those seeking a powerful yet portable 2-in-1 laptop, offering excellent multitasking capabilities and a flexible design that suits a variety of computing needs while looking attractive.",
      "rating": "5"
    },
    {
      "title": "Powerful 2-in-1 OmniBook from HP",
      "body": "This HP OmniBook X Flip 16 Next Gen AI PC is part of HP's new laptop lineup and is now available with your choice of processors. This laptop has a sleek design and is engineered to be used in multiple modes - laptop, tablet, tent, and reverse. This Copilot+ PC is powered by Intel Core Ultra 7 processor powerful enough to handle all your day-to-day things and cater to your personal AI experience. It can also handle multitasking without any lag.\n\nThe laptop comes with a beautiful and bright edge to edge 16\" 2K touchscreen display that boosts crisp images and vibrant videos. There is no stylus included, but it does support one. The flexible design includes a full-size backlit keyboard with Poly Studio audio dual speakers on the side. They are pretty good for a laptop of this size. Being a Copilot+ PC, it fully utilizes Windows 11 and designed AI experiences for creativity and productivity. The included NPU helps in supporting the AI features.\n\nThere is no shortage of storage and memory. This laptop comes with 16 GB of DDR5 RAM and 1 TB of storage, both plenty enough to accomplish all your tasks. The 5 MP IR camera and integrated microphones work well with video meetings as well as with Windows Hello functionality. There is a built-in camera shutter that comes in handy when you want to turn off your camera.\n\nAs for the battery, HP states that you can get 23 hours of video playback and 15+ hours of mixed usage. I am impressed with the long battery life. I was able to use it for a few days before I needed to plug in. This will easily get you through a full day of work without worrying about recharging. The laptop comes with a 65W USB C power adapter. It also supports fast charge, which charges the battery to 50% in 45 minutes.\n\nDespite its sleek design, the OmniBook still accommodates 2 USB C ports, 2 USB A ports, 3.5mm audio jack, and a HDMI port. The laptop can be charged using either of the USB C ports. The Wi-Fi 6E and Bluetooth 5.3 cards are a welcome addition as they support fast data transfers.\n\nOverall, this is a versatile laptop that can do multitude of things with a complete blend of design and performance that helps you tackle your work or creativity from anywhere.",
      "rating": "5"
    },
    {
      "title": "Nice 2-in-1 from HP",
      "body": "I have enjoyed my time using my OmniBook Flip, it has done everything I've throw at it while staying cool and quiet. The 16\" IPS touchscreen looks great, I have grown to love the 16:10 aspect ratio. It works well in tablet mode when you have the screen flipped around, my main complaint is it is only a 60hz screen. Only other concern with the screen and aspect ratio is fitting it into your laptop bag, most are designed for 15\" or smaller these days. They were able to keep the form factor light and thin, while still offering good connectivity overall. It would have been nice if both USB C ports were 40gb Thunderbolt 4 but having at least one is still appreciated. The fast charging is nice, giving you around a 50% charge in only 45 minutes. Battery life has been good overall for light workloads certainly not married to the wall charger like Intel laptops of a few years ago. If you are into the AI boom this intel processor can do all the copilot+ stuff, some of it able to run locally for better security. If you aren't interested in using copilot it still offers great performance, between web browsing, microsoft 365 apps, and youtube I've gotten 8-10hrs consistently; not macbook good but legitimate full day use away from the plug. The webcam is nice and works with windows hello so logging in is painless and doesn't require you to type anything in. Keyboard feels pretty nice, a bit heavy to press but quiet and not cheap feeling at all. Nice size track pad completes the package; it is responsive, easy to use, and I haven't had any accidental clicks while typing. Two large upward firing line each side of the keyboard, they don't sound great but do get plenty loud. I'd recommend headphones for most use cases, bluetooth or wired with a 3.5mm plug. There really isn't much to not like about this laptop, doesn't blow you away with features or performance but has everything you need especially if you are looking for a 2-in-1 design.",
      "rating": "5"
    },
    {
      "title": "Simple albeit bulky convertible laptop/tablet",
      "body": "I found myself somewhat conflicted as I was using this laptop trying to decide how to review it. Upon first start up, light bleeding from the edges of the screen was very noticeable. Once the computer was up and running the image quality is great, but I can see how the laptop would not necessarily provide a great cinematic experience when watching movies or playing games with dark areas given the bleeding of the light from the edges.\n\nSpeaking of the screen, it is pretty big at 16\". It is also a touch screen, which is obviously a necessity given the convertible nature of the laptop. I believe the display reaches something like 600 nits, if I recall reading that correctly somewhere. It is bright enough in most indoor environments, but I am not sure how good the screen would be if using it outside.\n\nThe keyboard is a little underwhelming. Given the real estate associated with a 16\" screen, I think it was an unfortunate choice to forego the numeric keypad. Instead, the keyboard consists of what I would describe as oversized keys that seem to have less space between them when compared to a typical laptop keyboard. I am guessing this was to minimize the risk of dirt and other contaminants getting between the keys, especially when the laptop is converted into a tablet. Ultimately, the keys have a good \"springy\" bounce to them which make it easy to type on. As a touch typist, however, I found the completely flat and oversized keys a little difficult to navigate, however, as my fingers wanted to drift from the home keys and the lack of contouring or spacing between the keys made it difficult to realize. The touchpad seemed to work well, but I still prefer the tactile and \"glassy\" feel of the touchpad on a MacBook or a Surface.\n\nThe camera has a manual sliding door/window that allows you to physically block the camera, which is a nice feature for the safety/security minded. The visual indication that the window is closed is a little subtle, though, which could be annoying or appreciated, depending on the user's preference. Given the integration with Windows Hello, however, using this feature relegates the user to using a password every time to log in.\n\nThe part I have yet to figure out is the utility of being able to switch a full laptop, like this one, into a tablet. The feature works well and Windows does a decent job of accommodating either laptop or tablet mode, but at 16\", this is a big (and heavy, in my opinion) laptop. Carrying this behemoth around in tablet mode is a workout. When in tablet mode, I would say the device is almost an inch thick. There is also a ridge that runs around the entirety of the screen, which can make it a little uncomfortable to use if you rest your wrists on the periphery of the screen. I also found the \"tablet\" somewhat difficult to pick up as the bottom edges (essentially, the keyboard and surrounding area) have a squared edge that sits flush with the table. I found myself having to grab the tablet between the screen and \"base\" to pick it up. I also do not like the idea of sitting the keyboard flush with whatever surface I am setting the tablet on. It was easy to keep the tablet upright by adjusting the angle of the hinges and it supported both horizontal and vertical orientation. Again, though, I fail to see the utility of the feature. I suppose, if I were on a flight and wanted to watch a movie, I could \"get rid\" of the keyboard, of sorts, so that it takes up less space. There is no stylus included or anything like that, so tablet mode is a touch only experience.\n\nAs for the audio, I found the sound to be a little \"tinny\" without very good bass. True, audio can be very subjective and I have learned to never expect impressive audio from a laptop, but there are some that do it better than others and this laptop is, what I would consider to be, average in this regard.\n\nHP does include some \"shovelware\" on the device, including McAfee virus scanner (that wants you to subscribe), along with their own programs for device management (which seem to require you to have an HP account and login to the account to access many of those features). You are required to send data to HP to verify your warranty status and the pop-up to upgrade your warranty (even if it expires in a year's time) is annoying. HP also includes their AI Companion (in beta). I have no idea what that tool does differently than Windows own Copilot. (Again, you have to log in with an HP account and consent to the collection and use of personal data to use the service.)\n\nBattery life seemed to be decent given routine use. This would probably be a good laptop for a student or a business professional using typical tools (web browsing and office-related applications). Boot up is relatively quick and responsiveness was good. (I did not run through anything too processor intensive.) There are two USB-A ports, two USB-C ports, a headphone jack, and an HDMI out. No SD card and the USB-C ports were only on one side of the laptop. (No ports on the back; they were on the side only, which makes sense given the convertible nature of the laptop.) The external finish is nice with a slight tactile feel that does not appear to be a fingerprint magnet.\n\nUltimately, though, I was underwhelmed and would probably consider this unit to be average. Nothing horrible, but also nothing that will greatly impress. If the price is good given the specs, this would be a reasonable purchase, in my opinion. Beyond that, though, there is nothing compelling that really tips the proverbial scales to make this a must buy.",
      "rating": "3"
    },
    {
      "title": "Great 16 Inch Laptop",
      "body": "This HP OmniBook16 inch laptop is a fairly nice machine and is certainly a step above when it comes to the typical fit and finish of typical HP laptops.  I've been impressed by the picture quality of the screen and how colors seem to pop rather vividly.  Audio quality has like wise impressed me with the level of depth that this thing generates.  Both features have really impressed me, especially when compared to what i have gotten used to from HP.  It feels sturdy in the hand and not the typical cheap plastic feel that is typical today.\n\n But as good as all that stuff is this thing really shines with how smooth it runs.  After the initial setup stuff this machine has some serious pep in her step.  If you are doing \"typical\" non-gaming activities in this machine you do not experience any sort of lag or hiccups during daily use.  Apps launch quick with low load times even when launching a huge spreadsheet.  The touchscreen is very responsive  and accurate to any touch inputs, either from your finger or a stylus.  Battery life has been excellent and it stays cool to the touch with the fan Hardly ever being heard.\n\nOverall I have to admit I'm  more than a little impressed.",
      "rating": "5"
    },
    {
      "title": "Good for school",
      "body": "It runs smoothly and i like the feel and weight will definitely come in handy with schoolwork",
      "rating": "5"
    }
  ]
}