{
  "name": "Lenovo 83JR0002US",
  "price": "999.99",
  "rating": "4.6",
  "reviews": "21",
  "specs": " Yoga 7 2 - in - 1  -  Copilot+ PC  -  14\" 2K OLED Touchscreen Laptop   -  AMD Ryzen AI 5 340  -  16GB Memory  -  512GB SSD  -  Seashell",
  "product_url": "https://www.bestbuy.com/site/lenovo-yoga-7-2-in-1-copilot-pc-14-2k-oled-touchscreen-laptop-amd-ryzen-ai-5-340-16gb-memory-512gb-ssd-seashell/6615841.p?skuId=6615841",
  "full_specs": "N/A",
  "all_reviews": [
    {
      "title": "Laptop Review",
      "body": "This laptop strikes an excellent balance between compactness and affordability, while also offering sufficient power to handle PDF CAD files and deliver quick responses for stock market decisions. After using it for three weeks, I am pleased with my choice. To enhance my setup, I recently acquired a mobile 3-in-1 screen expansion, ensuring I am well-equipped for the demands of multiple screens when the stock exchange opens.",
      "rating": "5"
    },
    {
      "title": "Excellent 2-in-1 Laptop for Everyday Use",
      "body": "The Lenovo Yoga is a fantastic 2-in-1 laptop with smooth performance and a sleek, durable design. The touchscreen is responsive, the battery life is impressive, and it easily handles everyday tasks and multitasking. Perfect for work, school, or entertainment on the go. Highly recommend!",
      "rating": "5"
    },
    {
      "title": "Fast and compact",
      "body": "Laptop is easy to use and transfer data. Works fast. Screen is extremely bright and clear.",
      "rating": "5"
    },
    {
      "title": "Yoga",
      "body": "Happy the employees showed me this love the 2-1 capabilities",
      "rating": "5"
    },
    {
      "title": "Beauty and Performance - a lightweight champ!",
      "body": "A far better investment than a tablet/IPad. \nI am so happy with the performance and beauty of this 2 in 1! It is extremely lightweight but works like a champ. I have been using Macs for the last 8-9 years but now have a work situation that require PC for network security reasons. \nBattery life is amazing. >12 hours off the charger and I still have juice. \nThis baby is perfect. I’ve had it for almost a week. Will comeback and update if there are any changes.",
      "rating": "5"
    },
    {
      "title": "First impression improved.",
      "body": "At first I did not like this computer at all!  The truth of the matter is if I would have spent the $100. to have data transferred I would have saved myself a lot of grief.  I have worked for several days to get it the way I want it and to experience what is new.  I have changed my mind.  It is not a bad little laptop at all.  It has some options that are quite nice and helpful.  It is just the right size, the screen is very bright and the speed has improved.  I find it to be satisfactory. By the way, if you are shopping Best Buy in Bloomington/Normal, IL ask for Chris.  Quite a nice kid!",
      "rating": "4"
    },
    {
      "title": "Great Laptop for an amazing price",
      "body": "Great Laptop for anyone.\nLaptop had a nice discount of 200$. That made the Lenovo laptop a great deal. Screen is beautiful, laptop is light weight, quiet during normal operation.\n\nI had to delete some software as it comes loaded with trail versions.",
      "rating": "5"
    },
    {
      "title": "GOODDDD",
      "body": "This laptop is amazing it is great the keyboard is perfect so is the trackpad \n\nThe chip set is perfect for office work and on the go light gaming",
      "rating": "5"
    },
    {
      "title": "Would Recommend",
      "body": "Having some connectivity issues and the Geek Squad had to fix something they did in the data transfer, but the computer is working great.",
      "rating": "5"
    },
    {
      "title": "Lenove laptop review",
      "body": "I love it really, i am just having a hard time converting myself from regular mouse to pad, the picture quality is beautiful!!!  Got it for my husband to use while recuperating from knee replacement",
      "rating": "4"
    },
    {
      "title": "Love my new Lenova",
      "body": "Love the clarity of the screen and keys are so easy to use. It occassionall freezes on me but I'm sure that is more due to the internet connection than the laptop itself.",
      "rating": "4"
    },
    {
      "title": "Lenovo Yoga",
      "body": "I love my new Lenovo Yoga. It is so light and easy to use.\n\nI love the Geek Squad for helping me",
      "rating": "5"
    },
    {
      "title": "Good for work!",
      "body": "Light weight and works well for work use. Did have one instance where I had to do a hard rest but has functioned perfectly fine since.",
      "rating": "4"
    },
    {
      "title": "Great",
      "body": "The best laptop ever, it’s so fast I can personalize it to my liking I can multitask. I just love it.",
      "rating": "5"
    },
    {
      "title": "Good Value",
      "body": "This is a very nice lap top with great features and good value.",
      "rating": "5"
    },
    {
      "title": "Lenovo yoga",
      "body": "Great laptop i love the picture and 2 in one is excellent",
      "rating": "5"
    },
    {
      "title": "Great Laptop",
      "body": "I am enjoying my laptop, the ease of use. Its small and simple, what I needed.",
      "rating": "5"
    },
    {
      "title": "Excellent Laptop!",
      "body": "Excellent!! Quality, size and all features in one!!!",
      "rating": "5"
    },
    {
      "title": "MR",
      "body": "I Like it, but the keyboard with the light behind it is hard to see the letters.",
      "rating": "4"
    },
    {
      "title": "Best laptop ever",
      "body": "Ive never had a lenovo before, but I’ll probably never bu anything else!",
      "rating": "5"
    },
    {
      "title": "Disappointed",
      "body": "After 2 weeks the fingerprint access has stopped working, and cannot resolve, and Windows has crashed.  Not the quality I expect from Lenovo",
      "rating": "2"
    }
  ]
}