{
  "name": "Lenovo 82VG00TYUS",
  "price": "579.99",
  "rating": "4.8",
  "reviews": "214",
  "specs": " IdeaPad 1 15.6\" Full HD Touchscreen Laptop  -  AMD Ryzen 5 7520U  -  8GB Memory  -  256GB SSD  -  Abyss Blue",
  "product_url": "https://www.bestbuy.com/site/lenovo-ideapad-1-15-6-full-hd-touchscreen-laptop-amd-ryzen-5-7520u-8gb-memory-256gb-ssd-abyss-blue/6610894.p?skuId=6610894",
  "full_specs": {
    "Screen Type": "IPS",
    "Screen Size": "15.6 inches",
    "Screen Resolution": "1920 x 1080 (Full HD)",
    "Touch Screen": "Yes",
    "Brightness": "300 nits",
    "Processor Model": "AMD Ryzen 5 7000 Series",
    "CPU Base Clock Frequency": "2.8 gigahertz",
    "Storage Type": "SSD",
    "Total Storage Capacity": "256 gigabytes",
    "System Memory (RAM)": "8 gigabytes",
    "Graphics": "AMD Radeon 610M",
    "Display Connector(s)": "1 x HDMI 1.4, Display connection via USB port",
    "Battery Life (up to)": "9 hours",
    "Battery Chemistry": "Lithium-polymer",
    "2-in-1 Design": "No",
    "Backlit Keyboard": "No",
    "Brand": "Lenovo",
    "Model Number": "82VG00TYUS",
    "Product Name": "IdeaPad 1 15.6\" Full HD Touchscreen Laptop - AMD Ryzen 5 7520U - 8GB Memory - 256GB SSD",
    "Color": "Abyss Blue",
    "Year of Release": "2025",
    "Display Type": "LCD",
    "Processor Brand": "AMD",
    "Processor Model Number": "7520U",
    "CPU Boost Clock Frequency": "4.3 gigahertz",
    "Number of CPU Cores": "4-core (quad-core)",
    "Number of CPU Threads": "8",
    "Unlocked Processor": "No",
    "CPU Cache Memory Level": "L2, L3",
    "L2 Cache": "2 megabytes",
    "L3 Cache": "4 megabytes",
    "Solid State Drive Capacity": "256 gigabytes",
    "Type of Memory (RAM)": "LPDDR5",
    "System Memory RAM Speed": "5500 megahertz",
    "Number Of Memory Slots": "0",
    "Graphics Type": "Integrated",
    "GPU Brand": "AMD Radeon",
    "Operating System": "Windows 11 Home",
    "Number of HDMI Outputs (Total)": "1",
    "Number of DisplayPort Outputs (Total)": "0",
    "Number of Thunderbolt Ports (Total)": "0",
    "Number of VGA Ports": "0",
    "DisplayPort Over USB-C": "DisplayPort 1.2",
    "USB Ports": "1 x USB-A 2.0, 1 x USB-A 3.2, 1 x USB-C 3.2",
    "Number of USB Ports (Total)": "3",
    "Headphone Jack": "Yes",
    "Microphone Input": "Yes",
    "Wireless Connectivity": "Wi-Fi, Bluetooth",
    "Wireless Standard": "AX",
    "Wireless Networking Standard": "Wi-Fi 6",
    "Number Of Ethernet Ports": "0",
    "Power Supply Maximum Wattage": "65 watts",
    "Battery Cells": "3-cell",
    "Battery Capacity": "3735 milliampere hours",
    "Front-Facing Camera": "Yes",
    "Front Facing Camera Video Resolution": "720p",
    "Built-In Microphone": "Yes",
    "Customizable Keyboard Lighting": "No",
    "GPS Enabled": "Yes",
    "Touchpad Type": "Multi-touch, Precision",
    "Media Card Reader": "Yes",
    "Media Card Slot": "Secure Digital",
    "Customizable Case Lighting": "No",
    "Audio Technology": "Dolby Audio",
    "Speaker Type": "2 x 1.5W",
    "Windows AI": "Copilot",
    "Security Features": "Privacy camera",
    "Cable Lock Slot": "None",
    "Casing Material": "Plastic",
    "Product Height": "0.7 inches",
    "Product Width": "9.29 inches",
    "Product Depth": "14.18 inches",
    "Product Weight": "3.47 pounds",
    "ENERGY STAR Certified": "Yes",
    "EPEAT Qualified": "No",
    "Optical Drive Type": "None",
    "Numeric Keypad": "Yes",
    "Warranty - Parts": "1 Year",
    "Warranty - Labor": "1 Year",
    "UPC": "198155777660"
  },
  "all_reviews": [
    {
      "title": "Good equipment",
      "body": "Hi, I am very satisfied with my purchase.  The laptop works perfectly. I like it and it is an excellent tool for my daily use.",
      "rating": "5"
    },
    {
      "title": "Good deals",
      "body": "The best prices in town. Excellent customer service allways. Great deals.",
      "rating": "5"
    },
    {
      "title": "Lenovo computer",
      "body": "I love my new computer.  It is not a death of web like my old computer.",
      "rating": "5"
    },
    {
      "title": "Hhh",
      "body": "It’s very nice laptop, my daughter really love it.",
      "rating": "5"
    },
    {
      "title": "Solid & Simple: Lenovo IdeaPad 1 Shines",
      "body": "This Lenovo IdeaPad 1 delivers well for light home use. Sharp display, good sound, not too heavy. Great for home or on the go. The touchscreen display is a nice \"touch.\"",
      "rating": "3"
    },
    {
      "title": "New IdeaPad",
      "body": "This Lenovo Ideapad suits my needs nicely.\nSo far it has performed all the tasks I have required of it admirably and seems to be of excellent quality.\nThe keys on the keyboard are well spaced and respond quickly without much pressure. \nThe touchpad is responsive and reasonably precise. \nThe touchscreen is a convenient feature and seems more sensitive than the touchscreens on other laptops I have owned.\nThe battery life is a little short compared to other laptops I have used but it does recharge quickly.\nWindows 11 has some unique idiosyncrasies that make the operating system a bit frustrating to work with at times (It had to update itself for four hours before it would boot the first time and it assumed it was being hacked after I checked some settings in the BIOS).\nThis laptop is a good model and does its job well for me, I am pleased with its aesthetic and performance.",
      "rating": "5"
    },
    {
      "title": "Excellent Value and Performance – Perfect for Ever",
      "body": "I’ve been using the Lenovo IdeaPad 1 for several weeks now, and I couldn’t be happier with my purchase. For the price, this laptop really delivers more than I expected.\n\nThe touchscreen is surprisingly responsive and makes navigation feel smooth and intuitive, whether I’m browsing the web, working on documents, or streaming videos. The full HD display is clear and vibrant, and I appreciate the extra screen space when multitasking.\n\nWhat stands out most is the portability. It’s lightweight and slim, making it easy to carry to class, and for traveling. The keyboard is comfortable for long typing sessions, and the overall build feels sturdy.\n\nPerformance-wise, the Ryzen 5 processor and 8GB of memory handle everyday tasks with ease. I use it for office apps, video calls, light photo editing, and streaming—and it keeps up without slowing down. The SSD also helps everything boot up and load quickly.\n\nIt's a reliable laptop that gets the job done without breaking the bank. It offers the right balance of value, performance, and convenience. I’d absolutely recommend it to friends or family.",
      "rating": "5"
    },
    {
      "title": "A Great Buy",
      "body": "This computer has performed exactly as promised, out the box. Easy setup and it has some cool features, such as the touchscreen. Lightweight and dependable!",
      "rating": "5"
    },
    {
      "title": "Affordable performance",
      "body": "The laptop is fast and very user friendly.  It’s got enough power and storage for what I need.",
      "rating": "5"
    },
    {
      "title": "Premium Look, Budget Price - Impressive Design",
      "body": "I'm really impressed with the sleek and modern design of this Lenovo IdeaPad 1. The Abyss Blue color gives it a sophisticated, premium look that stands out from typical budget laptops, with clean lines and a minimalist profile that looks much more expensive than its price point suggests. The 15.6\" Full HD touchscreen has nice thin bezels that add to the contemporary appearance, and the build quality feels solid with a beautiful blue finish that catches the light perfectly. Combined with the capable AMD Ryzen 5 7520U processor, 8GB RAM, and 256GB SSD that handle everyday tasks smoothly, this laptop delivers both attractive design and reliable performance - it's the kind of device you'd be proud to use anywhere, as it definitely doesn't look like a budget laptop despite its affordable price range.",
      "rating": "5"
    },
    {
      "title": "Very Happy",
      "body": "The laptop has been easy to set up and use. Very lightweight. Happy so far.",
      "rating": "5"
    },
    {
      "title": "Lenovo IdeaPad perfect size",
      "body": "I have a Lenovo IdeaPad 3 that I purchased several years ago that is my go to computer.  I needed to replace my older Sony laptop that we keep in the gameroom.  Of course I chose another Lenovo because it's compact, practical and easy to use.  This is a IdeaPad 1 but is more than adequate for my needs.  The team member at my Best Buy assured me this Lenovo would fit my needs and it surely does.  The screen is the perfect size for us; it's lightweight so easily portable.  I love that it's touchscreen even though usually use a mouse.  We're very low tech and older and I would recommend this Lenovo for my fellow seniors.",
      "rating": "5"
    },
    {
      "title": "Love it",
      "body": "Love this laptop! Lightweight, fast and affordable",
      "rating": "5"
    },
    {
      "title": "Good experience with Lenovo Laptop purchase",
      "body": "The laptop works well and we got excellent advice from the store people and also from the Geeks - The Geeks set it up very well. Overall, we are happy with the buying experience  and feel we got a fair price for a good product, thus the excellent rating.",
      "rating": "5"
    },
    {
      "title": "Excellent for our use",
      "body": "I bought this laptop to replace a 2017 model that had become incredibly slow to boot up and extremely slow on response times. The final straw was the last Microsoft update took nearly 24 hours to complete! This computer is used minimally and NOTHING gets stored on it, so it has a perfect amount of storage, bells & whistles. My husband (he is the primary user) is very happy with this laptop. I had the Geek Squad set up this laptop, merging over the small amount of data on the previous one. They also wiped the old one and recycled it for me. Finishing the setup at home was relatively quick and I appreciated the extra time the tech took to walk me through a few of the steps i would need to complete at home. Definitely recommend this laptop if you're looking for a basic machine and don't need screaming fast graphics for video games, etc.",
      "rating": "4"
    },
    {
      "title": "I Love This Computer!",
      "body": "I was looking for a solid but inexpensive laptop for basic use; web browsing, documents, spreadsheets etc.. and that I could install and run a Linux system on. Turns out this Lenovo laptop works perfectly for my purposes!!  I have other higher end laptops but I find myself using this laptop as my primary computer!  Pick up on sale!! You won't regret it!",
      "rating": "5"
    },
    {
      "title": "Great Student Laptop :) Mom Approved!",
      "body": "Very happy with this purchase. I was looking for something practical and affordable for my daughter to use at school, and this Lenovo IdeaPad 1 exceeded my expectations. It's lightweight and fast, with good storage, and the touchscreen makes schoolwork even easier. The price was very reasonable for everything it offers. Perfect for assignments, online classes, and school projects. As a mom, I feel confident knowing she has a reliable, easy-to-use device.",
      "rating": "5"
    },
    {
      "title": "Just a Mom",
      "body": "The screen is a little longer then my old computer and I really like that I can close screen, etc with a touch on the screen. That is so cool!!\nThe Best Buy team member was very helpful with his knowledge of the different types of computers and pointing me to the one that would assist me with my needs for my computer!!  A+ with the gentleman’s assistance and the computer is meeting all my computer needs!!",
      "rating": "5"
    },
    {
      "title": "Ms",
      "body": "Runs very well. Pretty easy to use. Light weight. Worked with my existing mouse.",
      "rating": "5"
    },
    {
      "title": "Good choice",
      "body": "I recently purchased the Lenovo 15.6\" Full HD Touchscreen Laptop (8GB Memory, Abyss Blue), and I’m very pleased with the product. It’s an excellent laptop and a great value for the price.\n\nMy niece absolutely loves it and finds it extremely useful for her school activities. It’s reliable, easy to use, and meets all her academic needs.",
      "rating": "5"
    },
    {
      "title": "Best Buy's Happy Senior",
      "body": "Having replaced my old laptop with the Lenovo IdeaPad, I also purchased Geek Squad coverage for a year.  Absolutely no regrets.  As a Senior, I easily adapted to the few subtle updates with the help of the excellent Geek Squad. Great value, great performance and will keep coming back to Best Buy after more than 20 years!",
      "rating": "5"
    },
    {
      "title": "I love it!",
      "body": "This has been a great daily driver.  I immediately swapped out the hard drive and installed Linux.  The touchscreen works great.  However, the webcam and built in microphone aren’t the best.  Additionally, it would be nice to be able to upgrade/add RAM.  I really like the screen size and the keyboard (10 key is really nice to have).  All in all, this is a very nice computer for the money.",
      "rating": "5"
    },
    {
      "title": "Computer",
      "body": "Great computer for the price point with great graphics and speed.",
      "rating": "5"
    },
    {
      "title": "Best entry level laptop in this price range.",
      "body": "Nice entry level computer with touch screen. Appreciate the Ryzen 5 for above average graphics for this price range. Bought specifically for my lady to play sims 4 and it runs flawlessly on the highest graphic settings. Good every day computer. Only complaint is the speakers are a little quiet but we Bluetooth to our sound system so no worries there.",
      "rating": "5"
    },
    {
      "title": "Laptop",
      "body": "I am very pleased with this laptop it does everything that I want to get done and fast",
      "rating": "5"
    },
    {
      "title": "Not happy with how your customer service and how y",
      "body": "Yeah, the laptop was great, but when I ordered both laptops and the cover for the one laptop, they were all supposed to be delivered to my house. You guys delivered one laptop and had the laptop and the sleeve for the other laptop for me to pick up, then you were the next day you sent the other laptop to me And then four days later you told me the sleeves in and you’re gonna charge me nine dollars to deliver it I told you the ticket ticket and it was no way I was paying for you to take it off my bill so now I’m not very happy with you people and how you do your things there",
      "rating": "4"
    },
    {
      "title": "From GR82CYA 2 Spirit B ing",
      "body": "It's well worth the money u pay 4 it!! As 1st time author, I needed my 1st computer in @10 years. Oh how I missed the technology!! This is turning out 2 b exactly what I needed!! I just mostly do the simplest of computing with it. Thank God 4 this 1derful tool!! Book 2 b published @12/25 with a name of:",
      "rating": "5"
    },
    {
      "title": "Awesome first experience",
      "body": "I had an awesome experience with the staff at Best Buy including the Geek Squad. They helped set up my computer and provided assistance in recovering my documents from my old computer which was determined to have a bad battery.",
      "rating": "5"
    },
    {
      "title": "Computer review",
      "body": "It's a great product I love the touch screen feature.",
      "rating": "5"
    },
    {
      "title": "Great computer.",
      "body": "Does everything I need it too and it does it super quickly!",
      "rating": "5"
    },
    {
      "title": "George laptop",
      "body": "Down size from my desktop works great . Easy to work with",
      "rating": "5"
    },
    {
      "title": "Grest lap top",
      "body": "We bought this for my wife to use to pay bills mostly. It is fast and works very well for her.  Glad that I was able to talk her into purchasing it, so is she since she started using it   Well worth the money",
      "rating": "5"
    },
    {
      "title": "Linux compatible.",
      "body": "Price was great and performance has been wonderful. I did nit ever boot it  into windows. On first startup installed Linux Nix OS on it. Works flawless and was super easy to install even with secure boot.",
      "rating": "5"
    },
    {
      "title": "Very impressed",
      "body": "For a basic no frills laptop no complaints. Went with this over HP on advice of store employee and no regrets. Fast. Boots quick. No bloatware. Using basic tasks so can’t comment on gaming but certainly would not buy this laptop for gaming. \nFor what it is impressed.",
      "rating": "5"
    },
    {
      "title": "Review",
      "body": "Great service in the store, very knowledgeable, provided options, and completed the process professionally. The in house setup went very smoothly and professionally. We could not be happier.",
      "rating": "5"
    },
    {
      "title": "Excellent laptop.",
      "body": "I have found this product to be easy to use. It boots up quickly. It's functioning is quick and makes tasks easy to get done easily. I would recommend it to anyone looking for a good laptop",
      "rating": "5"
    },
    {
      "title": "Great features and great price!",
      "body": "Purchased this laptop as a gift for my wife - she primarily uses it for school. The laptop has great features and has good speed. It is easy to use and she really enjoys the HD touchscreen.",
      "rating": "5"
    },
    {
      "title": "Great Pick",
      "body": "Fast and easy to navigate. Works great for my classes.",
      "rating": "5"
    },
    {
      "title": "Glad I choose Best Buy!!",
      "body": "I dont know much about computers so I didnt know what I was looking for but the staff member was great at listening to me and helping me decide! Great product and great service!!",
      "rating": "5"
    },
    {
      "title": "Great Laptop",
      "body": "This is my second Lenovo laptop. I am pleased with the quality and price. Highly recommend this brand and style for others — especially grandma’s like me who count on an easy to use and dependable computer!",
      "rating": "5"
    },
    {
      "title": "Works as expected.",
      "body": "Does everything I’d hoped it would do. The screen is a nice size for what we use it for: emails, browsing, and YT. Haven’t had it long and are still getting used to it. Speed is great as is battery life.",
      "rating": "5"
    },
    {
      "title": "Value for your bucks",
      "body": "Purchased this computer while it was on sale. 8GB ram with a decent SSD space for less than $400 is a steal in my book. So far so good, does what it needs to do. Only need it for minimal internet browsing.",
      "rating": "5"
    },
    {
      "title": "Must have for price!",
      "body": "Price - Very affordable for memory and size of laptop.\n\nDesign - Thin and simple, easy to take with you.\n\nApps - Easy to use and serves the purpose of why I purchased the laptop.\n\nI would recommend to friends and family.",
      "rating": "5"
    },
    {
      "title": "Lenovo Computer",
      "body": "Love my computer. It is so easy to use and just what I need. I have used Best Buy in the past and have always been happy with both the product and service.",
      "rating": "5"
    },
    {
      "title": "Nice laptop",
      "body": "Needed an inexpensive laptop with windows 11 since my laptop would not upgrade from 10 to 11. Had this for a couple moyand been satisfied.  Long lasting battery set u and good response",
      "rating": "5"
    },
    {
      "title": "Good laptop for the price.",
      "body": "I bought this Lenovo IdeaPad 1 from Best Buy, and it’s been a great buy. It’s fast enough for everyday things like browsing, streaming, and doing work or school tasks. The screen looks nice, and the laptop feels light but solid. Battery life is decent.\n\nFor the price, you really can’t go wrong. Perfect for anyone who needs a basic, reliable laptop without spending a lot.",
      "rating": "4"
    },
    {
      "title": "Best computer for college",
      "body": "Great computer for the price. I am using it for college, and it has the perfect capacity for school needs. writing papers, using the school's web-based programs. 10/10 recommend.",
      "rating": "5"
    },
    {
      "title": "Great for the price!",
      "body": "This computer is great for what I need. It’s fast, light weight, good for everyday use. Absolutely love this one! The price is affordable and it exceeded my expectation.",
      "rating": "5"
    },
    {
      "title": "Lenovo IdeaPad",
      "body": "Bought for my granddaughter.  She wanted a computer she could take to work with her.  Good color - just what she needed as far as memory etc.",
      "rating": "5"
    },
    {
      "title": "Very satisfied Customer--great value for money",
      "body": "Beautiful screen (display), fast, easy to transport, lots of storage space.  I think this laptop was very good value for money. I couldn't be happier with the purchase.",
      "rating": "5"
    },
    {
      "title": "Good Computer for the price",
      "body": "I bought this for a student in high school. I chose this one because I previously bought the same computer in a different color and that has been working great. Speed is good and it works well.",
      "rating": "5"
    },
    {
      "title": "More",
      "body": "This is my first time using lenovo laptop and it works perfectly. I recommend friends and lovers of good things to follow my foot steps.",
      "rating": "5"
    },
    {
      "title": "Best Lenovo Laptop",
      "body": "This Laptop has been a lifesaver. I absolutely love it, still getting use to working it since I am coming from a Chromebook but I love this laptop. Definitely have been recommending it to others.",
      "rating": "5"
    },
    {
      "title": "Great Laptop!!",
      "body": "Great computer and very light without compromising the size. colors are really vivid and bright. Sound quality is great as well.",
      "rating": "5"
    },
    {
      "title": "Enchanted with my laptop, it's amazing.",
      "body": "I find it amazing mo article, it makes my job 100% easy, I thank Best Buy because they really are the number one in technology.",
      "rating": "5"
    },
    {
      "title": "Lenovo laptops are the best for home",
      "body": "Lenovo laptops are the best for home use at a great cost. Light weight, speed are great. Looks great in my home office.",
      "rating": "5"
    },
    {
      "title": "Nice",
      "body": "Light weight, easy to carry. Pretty thin and good screen resolution",
      "rating": "4"
    },
    {
      "title": "Great Laptop",
      "body": "I needed to replace my old laptop after 7 years. This is a great touchscreen laptop for everything I need to do. The price was a good bargain for all the functionality it has.",
      "rating": "5"
    },
    {
      "title": "Great Budget Friendly Laptop",
      "body": "It's a Great Budget Friendly Laptop, good battery life. But the screen display is average. But, hey! for this price, I can't complain.",
      "rating": "5"
    },
    {
      "title": "Perfect for college",
      "body": "This is a great computer at a fantastic price.  Bought this for my daughter to start college, she loves this computer.  It’s perfect for research and writing papers.",
      "rating": "5"
    },
    {
      "title": "Very nice budget laptop",
      "body": "I bought 3 of these when they were on sale for $400.  They all seem like solid budget laptops.  You will have a hard time finding a faster laptop at this price point.",
      "rating": "5"
    },
    {
      "title": "Pretty Swell",
      "body": "Very great purchase, especially for the price. The touchscreen isn't annoying. The resolution is above decent and the screen is a nice size.",
      "rating": "5"
    },
    {
      "title": "Would Recommend",
      "body": "Great to use, has a touch screen, bought for uncle, he enjoys it!",
      "rating": "4"
    },
    {
      "title": "Easy peasy!",
      "body": "Good laptop for everyday uses. Like the vivid color and ease of use. Battery life is good and its speedy too.",
      "rating": "5"
    },
    {
      "title": "Great computer",
      "body": "Great computer! It met all my expectations in terms of speed, performance, and quality. Highly recommended.",
      "rating": "5"
    },
    {
      "title": "Amazing Touchscreen Lenovo Blue",
      "body": "Excellent laptop, with amazing tochscreen, high quality and velocity! Great processor and performance, battery life is very high!",
      "rating": "5"
    },
    {
      "title": "Husband",
      "body": "Love lt so far, my husband use it all the time.  Pleasure as well church sermons and business.  He is a Pastor of two churches.",
      "rating": "5"
    },
    {
      "title": "Lenovo",
      "body": "I really enjoy the technical quality of my new\nLenovo.  It is very fast, has a beautiful screen \nAnd I get to hear my zoom group finally!",
      "rating": "5"
    },
    {
      "title": "Lenovo laptop",
      "body": "Great service and product.  My laptop data transfer was done in a short period of time negating the need for a return trip.",
      "rating": "5"
    },
    {
      "title": "Lenovo Review",
      "body": "Great computer!  Love the features! Would buy this brand again! Would recommend to everyone!",
      "rating": "5"
    },
    {
      "title": "Lenovo",
      "body": "Been well pleased with the performance of the laptop. Size is good for portability and it has handled everything I needed so far.",
      "rating": "5"
    },
    {
      "title": "Laptop",
      "body": "Rodney was a great help I learn something from him as well when it came down to picking the right laptop that was suitable for me and my needs",
      "rating": "5"
    },
    {
      "title": "THE BEST",
      "body": "I the best Laptop I ever had, is easy, fast, big have good sound and the prices was great",
      "rating": "5"
    },
    {
      "title": "Review of Lenovo Laptop",
      "body": "A perfectly suitable laptop for the price. It's helped me through work and school, and has handled like a dream.",
      "rating": "5"
    },
    {
      "title": "relace old laptop",
      "body": "This newer laptop is lot faster that the old 17in Lenovo the new feature to learn all the new feature and how to use them , great price",
      "rating": "5"
    },
    {
      "title": "Awesome Lap!!!",
      "body": "Love this laptop. Super fast and beautiful. Back light on the keyboard. Pretty awesome.",
      "rating": "5"
    },
    {
      "title": "Best bang for my buck, hands down",
      "body": "Laptop does everything I need it to. I got it on sale and couldn’t find a Ryzen 5 cheaper than this at 379.98. It’s quite snappy",
      "rating": "5"
    },
    {
      "title": "Great Laptop",
      "body": "Great value!  Love the full keyboard and touchscreen.\nPurchased online and picked up at the store.  Took about 5 minutes.",
      "rating": "5"
    },
    {
      "title": "An excellent laptop",
      "body": "It works great and is fast while browsing. I’ve had it for a month and no complaints",
      "rating": "5"
    },
    {
      "title": "Great Value for lite use",
      "body": "For the price the value is all there. Offered everything we were looking for in a budget laptop for office, school and social use.",
      "rating": "5"
    },
    {
      "title": "Lenovo Thinkpad!",
      "body": "Great laptop! Bang for your buck in fearures, functionality, and ease of use!",
      "rating": "5"
    },
    {
      "title": "Great Laptop!",
      "body": "Great laptop and easy for a 85 year old.  We purchased this for my Mother in law and she loves it.  Easy set up and powerful.",
      "rating": "5"
    },
    {
      "title": "Lenovo laptop",
      "body": "Well designed, fast speeds  and reliable! Perfect for long life general use.",
      "rating": "5"
    },
    {
      "title": "Laptop",
      "body": "Was perfect laptop for school. Bought it for my granddaughter a freshman in high school this year.",
      "rating": "5"
    },
    {
      "title": "Perfect",
      "body": "I absolutely love my laptop, it’s not to big not to small it’s just right. Thankful for the guy who told me to get it ;)",
      "rating": "5"
    },
    {
      "title": "Good computer",
      "body": "Got this for my son. Because he loves to play the Sims. He hasn’t complained once about it.",
      "rating": "5"
    },
    {
      "title": "Great machine",
      "body": "This laptop is perfect for our staff members' day-to-day use. It looks great, has good battery life, and performs well.",
      "rating": "5"
    },
    {
      "title": "Get this laptop!!",
      "body": "I was looking for a computer that moved a lot faster than the MacBook that I had. THIS EXCELS WHAT I WAS LOOKING FOR!",
      "rating": "5"
    },
    {
      "title": "Perfect for school/work",
      "body": "Great budget laptop with a responsive touchscreen, smooth everyday performance and a sleek design—perfect for school or work",
      "rating": "5"
    },
    {
      "title": "A lot of computer for a budget price",
      "body": "This was a great value purchase and very easy to set up.  The keyboard is smooth and the screen is of high quality.",
      "rating": "5"
    },
    {
      "title": "Great work laptop",
      "body": "Fast shipping! I got next day! Reliable laptop, I have ordered a few of these and no complains, great machines!",
      "rating": "5"
    },
    {
      "title": "Great purchase",
      "body": "The way I bought it was so smooth and easy. And the staff super nice.",
      "rating": "5"
    },
    {
      "title": "Laptop",
      "body": "My sales representative recommended the perfect laptop for my needs both in terms of capacity as well as price point",
      "rating": "5"
    },
    {
      "title": "Susan's Lenovo",
      "body": "I love it. It's reasonably priced, fast, and easy to use. I only use it for personal use, not work do It's perfect.",
      "rating": "5"
    },
    {
      "title": "Just buy it great price for the performance",
      "body": "Great for the price  bought it to run a dtf and sublimation printer",
      "rating": "5"
    },
    {
      "title": "Great midlevel laptop",
      "body": "Perfect Laptop for the money ands very fast also has a sleek design",
      "rating": "5"
    },
    {
      "title": "MsTechi",
      "body": "I enjoy the Lenovo yogoa, purchase for my granddaughter & my self.",
      "rating": "5"
    },
    {
      "title": "Good choice",
      "body": "So far, I'm obsessed. It does so great for my school work while also allowing me to quickly browse the internet.",
      "rating": "5"
    },
    {
      "title": "Laptop Review",
      "body": "Easy to navigate. Great screen. I recorded this laptop to others.",
      "rating": "5"
    },
    {
      "title": "Love my new computer!",
      "body": "Very happy with this purchase! Easy set-up. Great little laptop!",
      "rating": "5"
    },
    {
      "title": "Review of new laptop",
      "body": "I like this laptop works for me.  I use it for personal use only and it works great.",
      "rating": "5"
    },
    {
      "title": "Great value and performance!",
      "body": "Amazing computer for the price, it runs fast, looks sleek, and handles all my tasks without any issues.",
      "rating": "5"
    },
    {
      "title": "Great Laptop",
      "body": "Very sufficient, great battery life. Light weight which is great to take anywhere",
      "rating": "5"
    },
    {
      "title": "New laptop review.",
      "body": "My Lenovo laptop is working well.  Support from Geek squad has been a big help!",
      "rating": "5"
    },
    {
      "title": "Great entry level W11 Laptop",
      "body": "Fast shipping, item as described! It's pretty capable for office and web navigation. Great Price-value.",
      "rating": "5"
    },
    {
      "title": "best affordable laptop",
      "body": "Works perfectly for work and school. Perfect amount of storage and battery life",
      "rating": "5"
    },
    {
      "title": "Laptop",
      "body": "Great product just like the salesman at the store recommended and backed 100%",
      "rating": "5"
    },
    {
      "title": "Great Computer for the Money",
      "body": "This computer has worked great, and has done everything I’ve wanted it to.",
      "rating": "5"
    },
    {
      "title": "Laptop",
      "body": "Best Laptop to use for school and Games very reliable",
      "rating": "5"
    },
    {
      "title": "Great laptop!",
      "body": "I needed a second laptop for some side work I was doing. Didnt need a suped up machine and this has performed flawlessly.",
      "rating": "5"
    },
    {
      "title": "Lenovo Laptop",
      "body": "Absolutely love this laptop ! It’s the best purchase I’ve made in a while",
      "rating": "5"
    },
    {
      "title": "Mr",
      "body": "Works great at the right price for what I need ……….8",
      "rating": "5"
    },
    {
      "title": "Great Intermediate Laptop",
      "body": "This is a great intermediate computer for everyday uses save documents files and etc with no problems",
      "rating": "5"
    },
    {
      "title": "A great laptop",
      "body": "Great for work and projects in the office setting.",
      "rating": "5"
    },
    {
      "title": "Excellent laptop",
      "body": "I use it for streaming and it works excellent!!! The touch screen comes in handy",
      "rating": "5"
    },
    {
      "title": "Mrs",
      "body": "Meets our needs for a computer. Connects with our other tech items",
      "rating": "5"
    },
    {
      "title": "Mr..",
      "body": "My guy had easy setup and easy for me to use. Great battery life.",
      "rating": "5"
    },
    {
      "title": "Good basic laptop.",
      "body": "It seems to be a good value for a basic, no thrills laptop.",
      "rating": "5"
    },
    {
      "title": "Lenovo",
      "body": "Laptop was so easy to set up. I was using it almost immediately. I would buy it again!",
      "rating": "5"
    },
    {
      "title": "Lenovo",
      "body": "Great deal  Best store to buy from when you need a quality item to purchase",
      "rating": "5"
    },
    {
      "title": "Good product",
      "body": "I like this laptop, my only complaint would be the audio quality. It has exceeded my expectations on everything else, I use it for my school work and research and it does just fine.",
      "rating": "4"
    },
    {
      "title": "Mr",
      "body": "the sales person did an excellant job of explaining the product",
      "rating": "5"
    },
    {
      "title": "Nice laptop",
      "body": "Nice laptop! Excelent seller.\nThis laptop has a great value.",
      "rating": "5"
    },
    {
      "title": "Great Laptop, Great Price.",
      "body": "quick and snappy, gets the job done for a good price",
      "rating": "5"
    },
    {
      "title": "Laptop",
      "body": "I just love this product and it's what I been  looking for",
      "rating": "5"
    },
    {
      "title": "great value!",
      "body": "Great computer for my granddaughter heading to college.",
      "rating": "5"
    },
    {
      "title": "5 stars",
      "body": "No complaints, worked as intended. Great gift for my dad",
      "rating": "5"
    },
    {
      "title": "Budget friendly",
      "body": "Excellent laptop for the price, easy setup. Would highly recommend.",
      "rating": "5"
    },
    {
      "title": "Church",
      "body": "We don’t use much but so far it’s doing what is needed",
      "rating": "5"
    },
    {
      "title": "Lenovo Review",
      "body": "so far it appears to be a fine pc. had to quickly replace 9 year old laptop.",
      "rating": "5"
    },
    {
      "title": "Laptop",
      "body": "Good laptop for the price works good doesn’t freeze up",
      "rating": "5"
    },
    {
      "title": "Work tool",
      "body": "It's  great to have a  peaceful time working with  my laptop",
      "rating": "5"
    },
    {
      "title": "new laptop",
      "body": "very nice for the price, really enjoy the touchscreen",
      "rating": "5"
    },
    {
      "title": "Great value!",
      "body": "Works perfectly for the application I’m using it for!",
      "rating": "5"
    },
    {
      "title": "Great",
      "body": "Great my wife loves it. She gets her school work done",
      "rating": "5"
    },
    {
      "title": "Great bang for your buck",
      "body": "Works well very smooth no complaints, has a nice color very durable too.",
      "rating": "5"
    },
    {
      "title": "Not Bad",
      "body": "Great laptop for work, school, streaming movies and tv. Wish the battery would last a little longer, even on energy efficiency mode still drops a decent rate.",
      "rating": "4"
    },
    {
      "title": "Great Buy",
      "body": "Very good computer for the price. Very user-friendly, great for all ages",
      "rating": "5"
    },
    {
      "title": "works great",
      "body": "Works great! small, thin and compact@! Excellent!!",
      "rating": "5"
    },
    {
      "title": "It's Great",
      "body": "Easy to use.  Was set up perfect for me.  Definately 5 stars",
      "rating": "5"
    },
    {
      "title": "Best price-quality laptop",
      "body": "Fast, lightweight, everything I need it at an awesome price!",
      "rating": "5"
    },
    {
      "title": "good lap top",
      "body": "just as expected. This laptop fits my needs for private use.",
      "rating": "5"
    },
    {
      "title": "New PC Win11",
      "body": "Just as promised, smooth transition from old PC to new PC.Great price.",
      "rating": "5"
    },
    {
      "title": "Computer review",
      "body": "Great computer. Works well and fast and easy. Affordable and worth it.",
      "rating": "5"
    },
    {
      "title": "Great Laptop",
      "body": "It has all the power my husband needs.  It was easy to set up and get him going.",
      "rating": "5"
    },
    {
      "title": "Good laptop.",
      "body": "Very nice form factor, nice color and good processor. Perfect weight.",
      "rating": "5"
    },
    {
      "title": "Mom’s laptop",
      "body": "Excellent laptop! Well made and easy to use. Mom loves it!",
      "rating": "5"
    },
    {
      "title": "Idea pad",
      "body": "Perfect small business homeowner computer. Doe what I need",
      "rating": "5"
    },
    {
      "title": "Works.",
      "body": "Does what it is supposed to. Nothing special but good budget laptop.",
      "rating": "5"
    },
    {
      "title": "Lenovo Laptop",
      "body": "Lenovo laptop is working quickly, efficiently and easily.",
      "rating": "5"
    },
    {
      "title": "Lenovo",
      "body": "nice computer.  very happy with it.  I am very pleased with Lenovo.",
      "rating": "5"
    },
    {
      "title": "Very good",
      "body": "I bought it for my grandma and it works very well for her",
      "rating": "5"
    },
    {
      "title": "Totally adequate",
      "body": "A lot of computer, fast for me anyway. Under $400. These people know their business. From floor sales to Geek Squad.  Not disappointed in 20 years.",
      "rating": "4"
    },
    {
      "title": "Perfect",
      "body": "Great computer for the price, does what we need it for",
      "rating": "5"
    },
    {
      "title": "Great Budget Laptop for Work",
      "body": "The is is a great budget laptop that is capable of simple computing tasks in a work environment.",
      "rating": "5"
    },
    {
      "title": "Solid computer",
      "body": "Does whats needed, wife uses for school work and basic surfing. No hiccups or challenges smooth surfing and can handle multiple apps",
      "rating": "4"
    },
    {
      "title": "Great Laptop",
      "body": "Great laptop, didn’t realize it was touchscreen also!",
      "rating": "5"
    },
    {
      "title": "Awesome laptop!",
      "body": "I'm very happy with my new Lenovo laptop!!    It fits my needs perfectly!",
      "rating": "5"
    },
    {
      "title": "Great Service",
      "body": "Good buy great assistance they helped me pick out a nice laptop",
      "rating": "5"
    },
    {
      "title": "Fast Laptop",
      "body": "Great laptop, very fast & the touchscreen works flawlessly.",
      "rating": "5"
    },
    {
      "title": "Mark Green’s new Lenovo",
      "body": "Am thoroughly enjoying my purchase so far.  Have downsized and it appears to be just right.",
      "rating": "5"
    },
    {
      "title": "Review of Lenova laptop",
      "body": "A very nice and easy to use laptop.  The price was amazing!",
      "rating": "5"
    },
    {
      "title": "Laptop",
      "body": "Love my laptop\nFast start up\nBest battery life\nPetfect size",
      "rating": "5"
    },
    {
      "title": "computer",
      "body": "I am very satisfied with my purchases, laptop, printer and router. Tech support with Geek Squad was very helpful. Thank You.",
      "rating": "4"
    },
    {
      "title": "Worth it for its price",
      "body": "I like the product, the price is good is an affordable laptop that will help you with easy stuff such as school projects",
      "rating": "4"
    },
    {
      "title": "Peanut1",
      "body": "it is easy to use. very fast, was very easy to setup",
      "rating": "5"
    },
    {
      "title": "Good budget computer",
      "body": "Computer works great no issues.\nEasy to setup and use.",
      "rating": "5"
    },
    {
      "title": "Great",
      "body": "Excellent and fast computer! Display is very clear and bright!",
      "rating": "5"
    },
    {
      "title": "Owner",
      "body": "Great laptop it works wonderful and very easy to operate",
      "rating": "5"
    },
    {
      "title": "admin sec.",
      "body": "got this for my grandson for graduation and he loves it.",
      "rating": "5"
    },
    {
      "title": "Laptop",
      "body": "I love it! Great tool for my college works and other worl related asignents",
      "rating": "5"
    },
    {
      "title": "Nice computer",
      "body": "Very nice computer. I just use it for personal projects and it has everything I need.",
      "rating": "5"
    },
    {
      "title": "Works great",
      "body": "Works great and the price was good!!\nWould buy again,",
      "rating": "5"
    },
    {
      "title": "Laptop",
      "body": "The environment was clean and the associates were professional.",
      "rating": "5"
    },
    {
      "title": "Lenovo laptop",
      "body": "Excellent laptop!! Easy to set up and price is great",
      "rating": "5"
    },
    {
      "title": "Customer",
      "body": "Easy setup and very user friendly. Highly recommend",
      "rating": "5"
    },
    {
      "title": "Great Value",
      "body": "Perfect for our needs. Works great and so far has been reliable.",
      "rating": "5"
    },
    {
      "title": "Starter computer",
      "body": "Good started computer for a middle school student.",
      "rating": "5"
    },
    {
      "title": "Lenovo",
      "body": "Easy set up. Transfered info from previous computer came over without any issues.",
      "rating": "5"
    },
    {
      "title": "Laptop",
      "body": "Great for my husbands business.  Sound is good as well",
      "rating": "5"
    },
    {
      "title": "Laptop Review",
      "body": "Great product for doing your day to day office tasks or school work. Battery life is also good. Would definitely recommend this",
      "rating": "4"
    },
    {
      "title": "Very good",
      "body": "Very good the computer I love your funciones and your capacidad",
      "rating": "5"
    },
    {
      "title": "Lenovo Laptop",
      "body": "Excellent computer with great quality and graphics.",
      "rating": "5"
    },
    {
      "title": "Good buy",
      "body": "It’s a basic windows laptop that does what it’s supposed to.",
      "rating": "5"
    },
    {
      "title": "Affordable Gem",
      "body": "Great features and performance at a really affordable price.  Excellent value.",
      "rating": "5"
    },
    {
      "title": "So far so good",
      "body": "The computer had been great for what we hve been using it for.",
      "rating": "5"
    },
    {
      "title": "Trustworthy & Dependable",
      "body": "It is what I needed. Works well. Sometimes it does not shut off????",
      "rating": "4"
    },
    {
      "title": "Excellent laptop.",
      "body": "Excellent laptop for home use, the battery life is good.",
      "rating": "5"
    },
    {
      "title": "Great lap top for price",
      "body": "Very good lap top for the price. Works great and runs fast. No complaints at all. Would definitely recommend!!",
      "rating": "4"
    },
    {
      "title": "Mouse icon hard to see.",
      "body": "Using the mouse  instead of the touch screen, has been a little slow and sometimes hard to see on the screen.",
      "rating": "4"
    },
    {
      "title": "Nice laptop",
      "body": "Nothing fancy, but fits my needs. It’s easy to use.",
      "rating": "5"
    },
    {
      "title": "Great laptop for price point",
      "body": "This laptop has been great for what I needed it for.",
      "rating": "5"
    },
    {
      "title": "usage",
      "body": "Good Laptop For what i need for light usage and ga",
      "rating": "5"
    },
    {
      "title": "Laptop",
      "body": "Good laptop for the price.                                              \n\n\n\n\n\n.",
      "rating": "4"
    },
    {
      "title": "good laptop",
      "body": "It good laptop for my daughters schooling, no issues at this time. price was right for us.",
      "rating": "4"
    },
    {
      "title": "New laptop",
      "body": "My new Lenovo IdeaPad is the best laptop I have used.  It was easy to start using and the features have been easy to access.",
      "rating": "4"
    },
    {
      "title": "Lenovo for the Win",
      "body": "Lightweight and very fast. I like the sound quality and it is worth it for the price.",
      "rating": "4"
    },
    {
      "title": "Great middle of the road laptop",
      "body": "Very efficient for my needs. Probably could have used a little more RAM.",
      "rating": "4"
    },
    {
      "title": "Computer",
      "body": "Great touchscreen great computer all around highly recommended",
      "rating": "4"
    },
    {
      "title": "Good value for the price.",
      "body": "This is easy to enjoy all the feature, will purchaser another one",
      "rating": "4"
    },
    {
      "title": "Basic but good",
      "body": "Good laptop for work, just wish it came with Microsoft",
      "rating": "4"
    },
    {
      "title": "Good computer",
      "body": "Great computer. Easy to use. Love the touchscreen, a little slow sometimes",
      "rating": "4"
    },
    {
      "title": "Senior friendly computer plus.",
      "body": "Easy to navigate, lots of features, touch screen, pricing was affordable.",
      "rating": "4"
    },
    {
      "title": "Good laptop",
      "body": "Good laptop for every day use and normal work such as with MS office",
      "rating": "4"
    },
    {
      "title": "My review",
      "body": "It is nice I enjoyed working on it. Speed is good and stoagr",
      "rating": "4"
    },
    {
      "title": "Not a good computer investment",
      "body": "As an IT Professional I rarely have time to review computers. I feel I have to in this case to warn people considering this as a purchase. The \"8GB\" ram is soldered onto the motherboard and CANNOT be upgraded. It gets worse though. Your system will not actually be given the full \"8GB\" of memory. More like 5.6 GB after the AMD graphics card allocates memory for itself. A new computer is not usable with 5 GB ram. You will be buying a new computer within a couple years because it will be so slow. Get a computer with 16GB Ram right off the bat. 8 GB is the BARE minimum these days.",
      "rating": "1"
    },
    {
      "title": "lenovo",
      "body": "it fills my needs blah blah blah blah blah blah blah",
      "rating": "4"
    },
    {
      "title": "Ok product",
      "body": "Overall it is a great product, just wish product had cd/DVD (or Blu-ray) capabilities",
      "rating": "3"
    },
    {
      "title": "Avoid avoid avoid",
      "body": "The intel version of the lenovo is the one you want to get. For whatever reason, This version with the AMD processor does not let you upgrade the memory. So youre stuck w/ 8GB which is now considered the 4GB of the world. Today's application require atleast 16GB. The intel version of the lenovo laptop lets you upgrade without issue. This laptop doesnt even have a memory slot. Oh and the intel version is around the same price.",
      "rating": "1"
    },
    {
      "title": "Never get this brand",
      "body": "Battery life is wake, running speed is slow, totally pieces of waste, only thing it’s good is display that’s all.",
      "rating": "1"
    },
    {
      "title": "I like",
      "body": "works as it should. All connections and updates were done easily. Wi-Fi, Bluetooth, all good. This was refreshing after having to return a “new” one from another vendor, because it could not connect to Wi-Fi no matter what. This one may not be “new” but it was listed as in “excellent “ condition and it is. Love it. Just what I needed.",
      "rating": "5"
    },
    {
      "title": "Excellent",
      "body": "Fast, clean and very useful for work of study. Good price for a good computer",
      "rating": "5"
    },
    {
      "title": "Soldered on memory and smaller storage drive",
      "body": "So for those who don't know, Lenovo's previous version of this laptop was an i5 with 8GB of memory.  Exact model was the 82QD00HMUS.  It was priced at $319 and you had one slot to upgrade the memory to 16GB.  Came with 512GB of storage and Intel Iris XE graphics. Perfect value laptop for what you got.   As soon as I received this laptop, I noticed that the memory is locked to 8GB and no RAM slot to upgrade to 16GB.  Even for basic users, standard should be 16GB, and for gamers minimum 32GB-64GB.  The fact you can't upgrade this to 16GB is enough for me to return this device.  Yes yes, you can gain some performance with having it soldered on, but at the end of the day, you are still locked at 8GB.  On top of that, they cut the storage in half, from 512GB to 256GB. \n Granted you can upgrade storage but it's just another cheap tactic.  Bad move Lenovo, you can have it back.",
      "rating": "1"
    },
    {
      "title": "DON'T BUY laptop sucks.",
      "body": "I have owned a lenovo idea pad 1 15.6\" for 3 years.  it wil not charge the battery even though I have bought a new adaptor & a new battery.  What is the worse feature in this laptop is the on & off switch.  It has some little oval window that does not turn on the computer.  Bad way to use a switch for a laptop.   the battery keeps losing charge with no way to recharge (35% now).   DON'T BUY.",
      "rating": "1"
    }
  ]
}