{
  "name": "Dell i3535-A735BLK-PUS",
  "price": "799.99",
  "rating": "4.7",
  "reviews": "158",
  "specs": " Inspiron 15.6\" Touch Screen Laptop  -  AMD Ryzen 7 7730U with 16GB Memory  -  1TB SSD  -  Black",
  "product_url": "https://www.bestbuy.com/site/dell-inspiron-15-6-touch-screen-laptop-amd-ryzen-7-7730u-with-16gb-memory-1tb-ssd-black/6610629.p?skuId=6610629",
  "full_specs": {
    "Screen Type": "IPS",
    "Screen Size": "15.6 inches",
    "Screen Resolution": "1920 x 1080 (Full HD)",
    "Touch Screen": "Yes",
    "Refresh Rate": "60Hz",
    "Brightness": "220 nits",
    "Processor Model": "AMD Ryzen 7 7000 Series",
    "CPU Base Clock Frequency": "2 gigahertz",
    "Storage Type": "SSD",
    "Total Storage Capacity": "1000 gigabytes",
    "System Memory (RAM)": "16 gigabytes",
    "Graphics": "AMD Radeon",
    "Display Connector(s)": "No external display connection",
    "Battery Life (up to)": "11 hours",
    "Battery Chemistry": "Lithium-ion",
    "2-in-1 Design": "No",
    "Backlit Keyboard": "No",
    "Brand": "Dell",
    "Model Number": "i3535-A735BLK-PUS",
    "Product Name": "Inspiron 15.6\" Touch Screen Laptop - AMD Ryzen 7 7730U with 16GB Memory - 1TB SSD",
    "Color": "Black",
    "Year of Release": "2024",
    "Display Type": "LED",
    "Synchronization Technology": "Not Applicable",
    "Display Surface": "Anti-glare",
    "Color Gamut (NTSC)": "45 percent",
    "Processor Brand": "AMD",
    "Processor Model Number": "7730U",
    "CPU Boost Clock Frequency": "4.5 gigahertz",
    "Number of CPU Cores": "8-core",
    "Number of CPU Threads": "16",
    "CPU Cache Memory Level": "L1",
    "L1 Cache": "20 megabytes",
    "Neural Processing Unit (NPU)": "No",
    "Solid State Drive Capacity": "1000 gigabytes",
    "Solid State Drive Interface": "PCIe",
    "Type of Memory (RAM)": "DDR4",
    "System Memory RAM Speed": "3200 megahertz",
    "Number Of Memory Slots": "2",
    "Graphics Type": "Integrated",
    "GPU Brand": "AMD Radeon",
    "Operating System": "Windows 11 Home",
    "Operating System Architecture": "64-bit",
    "Number of HDMI Outputs (Total)": "1",
    "Number of VGA Ports": "0",
    "USB Ports": "1 x USB-C 3.2, 1 x USB-A 3.2, 1 x USB-A 2.0",
    "Number of USB Ports (Total)": "3",
    "Number of USB-A Charging Ports": "0",
    "Number of USB-C Charging Ports": "0",
    "Headphone Jack": "Yes",
    "Microphone Input": "Yes",
    "Wireless Connectivity": "Bluetooth, Wi-Fi",
    "Wireless Standard": "AC",
    "Wireless Networking Standard": "Wi-Fi 5",
    "Number Of Ethernet Ports": "0",
    "Network Connectivity": "None",
    "CPU Cooling System": "Air",
    "Power Supply Input": "DC Jack",
    "Power Supply Maximum Wattage": "65 watts",
    "Battery Cells": "3-cell",
    "Front-Facing Camera": "Yes",
    "Front Facing Camera Megapixels": "0.92 megapixels",
    "Front Facing Camera Video Resolution": "720p",
    "Built-In Microphone": "Yes",
    "Customizable Keyboard Lighting": "No",
    "Foldable Screen": "No",
    "GPS Enabled": "No",
    "Touchpad Type": "Multi-touch",
    "Media Card Reader": "Yes",
    "Media Card Slot": "Secure Digital",
    "Customizable Case Lighting": "No",
    "Audio Technology": "MaxxAudio Pro (Windows)",
    "Speaker Type": "Stereo Speakers (Windows)",
    "Windows AI": "Copilot",
    "Cable Lock Slot": "None",
    "Stylus Dock": "None",
    "Product Height": "0.75 inches",
    "Product Width": "14.11 inches",
    "Product Depth": "9.24 inches",
    "Product Weight": "4.19 pounds",
    "ENERGY STAR Certified": "Yes",
    "EPEAT Qualified": "Yes",
    "EPEAT Level": "Silver",
    "Included Software": "DAO/BCC/APJ No Security SoftwareMS Office 30-Day Trial",
    "Optical Drive Type": "None",
    "Numeric Keypad": "Yes",
    "Stylus Included": "No",
    "Warranty - Parts": "1 Year Mail In Service",
    "Warranty - Labor": "1 Year Mail In Service",
    "UPC": "884116430735"
  },
  "all_reviews": [
    {
      "title": "ALL IN ONE",
      "body": "It is an economically accessible computer, with excellent storage capacity, the performance has left me surprised and the multitasking it achieves is not to mention.",
      "rating": "5"
    },
    {
      "title": "Happy With This Laptop So Far",
      "body": "So far, so good. Very fast boot up, not a lot of blue wear, and run smooth. Decent sound for a laptop, and plenty of RAM for my needs.",
      "rating": "5"
    },
    {
      "title": "Hp",
      "body": "I am very happy with my purchase. Performance is exactly as described..",
      "rating": "5"
    },
    {
      "title": "Woot woot",
      "body": "Love it, didn’t realize my old one was so outdated and dlow",
      "rating": "5"
    },
    {
      "title": "DELL INSPIRON 15",
      "body": "BUENA,RAPIDA CON 1 TERA DE ALAMACENAMIENTO Y PANTALLA TOUCH. EXCELENTE",
      "rating": "5"
    },
    {
      "title": "Great Computer",
      "body": "I really enjoy this computer. I appreciate the amount of memory and the full keyboard. The computer is so quick I can barely keep up which is a good thing. I use it a ton for work I bring home and for the planning I am doing for my family. My only qualm, which of course is personal and I know some don’t care, is the color. It is hard to not find a generic black, gray, or silver. But I am looking into a cover. Without me being so picky about the color I love the computer. The battery is great and I am pleased, the touch screen is a plus and I find myself enjoying that more than I thought.",
      "rating": "4"
    },
    {
      "title": "New laptop",
      "body": "I really love this computer. I am learning more about each day. I had a little trouble hooking up the printer but the Geek Squad was able to do it in minutes. I will never be without the Geek Squad. I love the touch screen and the weight , much lighter than my last one. I have much more memory. It was a great choice for me.",
      "rating": "5"
    },
    {
      "title": "Great Laptop at good price",
      "body": "Very Happy with my purchase. It has great performance, high speed, touch screen is convenient and plenty of storage. Price was also lowest the I shopped. Best Buy is also the place to get good quality products at a competitive price.",
      "rating": "5"
    },
    {
      "title": "Perfect price",
      "body": "Best purchase that ive done in awhile, the speed is faster than i thought, graphics looks amazing, the battery life is longer than expected, and to top it off ots touchscreen.",
      "rating": "5"
    },
    {
      "title": "Nice for the price",
      "body": "This laptop is a great size and very fast. I use it for a very limited gaming and working from home. A lot of the other laptops that I looked at were more expensive and didn't have the same features.",
      "rating": "5"
    },
    {
      "title": "Love this machine!",
      "body": "I am super pleased with this purchase.  This is my first time to use a touch screen laptop, and it does not disappoint!  It has great features, like the numbers pad. The speed is great, too!",
      "rating": "5"
    },
    {
      "title": "Mr",
      "body": "A very fast and efficient laptop. That response to command well and is very easy to setup. And easy to navigate. However, I wish it would come with chrome installed.",
      "rating": "5"
    },
    {
      "title": "Would Buy again!",
      "body": "I love this laptop! The touchscreen works perfectly and the computer runs fast, opens quickly and is easy to navigate! I would buy it again!!!",
      "rating": "5"
    },
    {
      "title": "Dell Inspiron 15.6” laptop",
      "body": "Needed new work computer and normally by HP and got this one on sale. Speed is great and screen size is perfect.",
      "rating": "5"
    },
    {
      "title": "Great Laptop",
      "body": "I absolutely love this laptop. Great battery life, easy to set up , perfect for browsing and creativity",
      "rating": "5"
    },
    {
      "title": "Dell laptop",
      "body": "A gift for my daughter. She raves about the performance and speed. Perfect for college student.",
      "rating": "5"
    },
    {
      "title": "Sharp display and fast",
      "body": "This laptop offers everything I need. Speed is much faster than my old laptop. Display is sharp and clear.",
      "rating": "5"
    },
    {
      "title": "Dell Computer",
      "body": "I have had the computer only for 1 month, so far no problems.  It is a nice computer, fast and lightweight.",
      "rating": "5"
    },
    {
      "title": "Great Laptop Lets You Know It’s There",
      "body": "Enjoying the laptop.  Was upgrade from a Sony Vaio I got in maybe 2010?  Loud fan, I had AC Infinity air management on my desktop, so laptop fan does not cycle as much as it does when “docked” -vs- being a laptop.  Loud fan.  Loud.\n\n\nLove 100% of everything else.  What I needed it to be.  My “PC” alongside my “MAC.”  Both on home network, both access same files, and borh operate separate A/V Home Theater/Computer Systems.  \n\nFantastic Laptop.  I love it.",
      "rating": "5"
    },
    {
      "title": "Dell Computer",
      "body": "I trust my Dell computer.  It is the perfect size and is easy to use.",
      "rating": "5"
    },
    {
      "title": "Very Pleased",
      "body": "Very light weight and fast. Dell is the only computer I will ever buy.",
      "rating": "5"
    },
    {
      "title": "Great laptop",
      "body": "Works great, light weight, and easy to use. I would recommend",
      "rating": "5"
    },
    {
      "title": "Excellent specs for the price!",
      "body": "Excellent specs for the price. The screen is large and bright and touchscreen is a plus. 16 GB of Ram, a 1TB SSD and an AMD Ryzen 7 for this price is great.",
      "rating": "4"
    },
    {
      "title": "Great Quality",
      "body": "So far so good. Its fast, light weight and im still learning about it",
      "rating": "4"
    },
    {
      "title": "New Computer",
      "body": "New computer. I love this computer. Never had a touch screen before, its amazing.  Easy to set up right out of the box. Also a great price. A lot of bang for your buck.  I would definitely recommend this computer.",
      "rating": "5"
    },
    {
      "title": "State of the Art Windows Computer",
      "body": "Great computer with smooth processor, at a great value price, needed it for my coding learning and it is perfect!",
      "rating": "5"
    },
    {
      "title": "Perfext for a teen",
      "body": "Perfect laptop for our teen daughter who is pursuing animation, art and design. We got her a drawpad that connects and the laptop has handeled everything smoothly. The touch screen is a bonus, and the battery life is average, but the storage and speed are great.",
      "rating": "5"
    },
    {
      "title": "Best Laptop I have bought",
      "body": "very easy to set up, computer did it all!\nhandled over fifty different screen with no problem\nbought at Best buy a week before Mem. Day sale  in May cheaper than the sale price. 550.00\nGreat screen without glare.\npicked up at store with no scratches, dents or marks. Very happy with laptop and with Best Buy's service and people.\n\nonly complaints, not enough plug-ins, but does have to very lastest ones, just not enough though.",
      "rating": "5"
    },
    {
      "title": "Fingerprint login is great!",
      "body": "Very good vakue for the proce it is fast and responsive. Easy to transfer previous laptop documents. Not bright enough for me but it is eaay to start up with just a fingerprint. My husband bought one then i bought one as well. Im on the laptop all day battery life is important to me and gave noticed it does drain rather quickly just from emails and reports.",
      "rating": "4"
    },
    {
      "title": "Good all around laptop",
      "body": "Has done every3iv asked ofnit for work related stuff but can also stream with clear picture and play most games i play",
      "rating": "5"
    },
    {
      "title": "Dell - Inspiron 15.6\" Touch Screen Laptop",
      "body": "I recently upgraded to the Dell Inspiron 15.6″ Touch Screen Laptop, and it has truly exceeded my expectations. From the moment I powered it on, the sleek design and solid build quality made a great first impression. The laptop’s vibrant touch display is not only responsive but also delivers brilliant colors and sharp details, which makes everything, from streaming movies to creative projects, a joy to work with.",
      "rating": "5"
    },
    {
      "title": "Dell laptop",
      "body": "Very good computer, I used as a personal computer and it works really great, good buy I recommend",
      "rating": "5"
    },
    {
      "title": "Couldn’t pass up a great brand and a great deal!",
      "body": "Easy to use. Many features compared to my last computer. Love all the shortcuts. Well known brand. Best Buy had the best deal!  I couldn’t pass it up!  Thanks Best Buy!  Your sales are amazing!",
      "rating": "5"
    },
    {
      "title": "Good Buy",
      "body": "Worked great out of the box. Did everything I expected of it.",
      "rating": "5"
    },
    {
      "title": "Laptop",
      "body": "Its speed is quite good and for the price paid it performs very well",
      "rating": "5"
    },
    {
      "title": "MaryJ",
      "body": "This is my first lap top so i do not have anything to compare it with but is seems good and easy to use.. I like the size of the screen and the weight of the lap top. I have not used it much but i think i will really like using it.",
      "rating": "5"
    },
    {
      "title": "Laptop",
      "body": "Enjoying it very much. Good speed, long battery life.",
      "rating": "5"
    },
    {
      "title": "Works well",
      "body": "The computer has worked well. I don't like that when you sleep it, the USB's stay powered up, but I think there may be a way to fix that.",
      "rating": "4"
    },
    {
      "title": "Right size",
      "body": "Does what it's supposed to & just the right size .",
      "rating": "5"
    },
    {
      "title": "Inspiron 15.6\" Laptop",
      "body": "Working fine.  Easy file transfers and fast.  Fast startup.",
      "rating": "5"
    },
    {
      "title": "Great laptop",
      "body": "Works like a champ. Definitely recommend at least 16gb",
      "rating": "5"
    },
    {
      "title": "Great Buy",
      "body": "Great buy for the money. This laptop is easy to use and carry around while the battery is long lasting. The keyboard is simple to use and I like having the a number keyboard. The sale person explained the advantages of this laptop very well. Prefect laptop for me.",
      "rating": "5"
    },
    {
      "title": "Laptop",
      "body": "Very good, works efficiently for all of my needs. Price was reasonable.",
      "rating": "5"
    },
    {
      "title": "Great Laptop!!!",
      "body": "great laptop… if you’re looking for a budget laptop similar to a gaming laptop this is it. Definitely not a gaming laptop, but it works to play games very well specially on the Xbox game pass 10 out of 10 would recommend.",
      "rating": "5"
    },
    {
      "title": "Berko1912",
      "body": "Cosmetic very nice. Its speed. My friend offer me. Thank my friend",
      "rating": "5"
    },
    {
      "title": "Good computer for a good price",
      "body": "So far fairly happy with the new computer.  Need more time using it to be truly sure. It is fast and lite.  Getting used to the new position of the touch pad to keyboard ratio. I didn't want a touch screen but that's all they had in this make. It is convenient and a bit annoying when you inadvertently touch it. It was easy to set up, and I'm not unhappy with the purchase.",
      "rating": "4"
    },
    {
      "title": "Selected the Dell, over HP",
      "body": "My original plan was to purchase another HP laptop that didn't allow me to upgrade to Windows 11. \n After talking with BB sales rep., settled on the Dell with more storage and same Labor Day sales price.",
      "rating": "5"
    },
    {
      "title": "Purchased cause old PC not upradable to Windows 11",
      "body": "Since the hardware on my old PC is not compatible with Windows 11, I purchased this to replace it.  Features missing that are on my other PC\n\nThe camera is not capable of Windows Hello Facial recognition.\nNo fingerprint reader.\nNo lighted keyboard, Helpful if the PC is used in the bedroom.\nThe one-year Dell Service does not include in-home service.",
      "rating": "4"
    },
    {
      "title": "Dell purchase.",
      "body": "This is my 2nd time purchasing a Dell. In my own words. The specs on the Dell are great. It is a durable laptop and just enoigh for what I do. I explained what I need and looking for. The gentleman who helped me at Best Buy SFO, was helpful and informative.",
      "rating": "5"
    },
    {
      "title": "Dell Inspiron",
      "body": "I needed an affordable laptop to replace an aging laptop that was beyond its years. You really can't go wrong with this laptop for the price. It performs really well, much better than I actually anticipated. I cannot comment on battery life since this stays plugged in, but so far I really like this laptop.",
      "rating": "4"
    },
    {
      "title": "My wife's first laptop.",
      "body": "This laptop was a big move forward for my wife who has been using an old desktop PC for a decade or so. It works well on our wireless wifi network, We are happy with our purchase as of now.",
      "rating": "5"
    },
    {
      "title": "Great Product",
      "body": "The laptop has been great. Both my wife and I use it for work from home things. It has performed beautifully./",
      "rating": "5"
    },
    {
      "title": "Great Purchase",
      "body": "We bought this to replace a really old laptop and we're so pleased. It's fast, lightweight and has plenty of storage. Price was good and the woman who helped me in store made the transaction quick and easy.",
      "rating": "5"
    },
    {
      "title": "Great Price, Good Laptop",
      "body": "I am mainly using this laptop for school but everything looks great to me. I got it at a discount and it helped since my budget is tight. If you are looking for a good laptop for college, then this one can be a good choice!",
      "rating": "5"
    },
    {
      "title": "Great Laptop",
      "body": "My daughter loves all the new features of the Dell laptop. She previously own a Dell laptop and decided to replace it with this new model. The Touchscreen, more memory and SSD Drive are great improvements.",
      "rating": "5"
    },
    {
      "title": "Great computer for Freshman year at college",
      "body": "Great computer to take to college. It is relatively light and has good battery capacity.",
      "rating": "5"
    },
    {
      "title": "Dell #2",
      "body": "After a “problem” with my computer I bought this new one which is very similar in most ways to the previous one.\nI’m getting accustomed to the new one but, so far, I am very pleased.",
      "rating": "5"
    },
    {
      "title": "Good for college",
      "body": "Gift for my cousin , he loved it - it meets all his college requirement.",
      "rating": "5"
    },
    {
      "title": "Hard to clean install windows",
      "body": "Nice computer for the price, but I wish the keyboard was backlit.  Also don't like that the computer is running bitlocker, which makes it difficult to reformat hard drive for a clean install.  I do like that there is minimal bloatware pre-installed",
      "rating": "4"
    },
    {
      "title": "Laptop deal",
      "body": "It is perfect for my needs.  It accepted all my cloud stuff.  I didn't have to remember all my passwords.  I just can't seem to install the 360 software I purchased. It keeps saying I already have it.",
      "rating": "5"
    },
    {
      "title": "SUPER",
      "body": "So far so Great!  Kick butt laptop for the price, and I mean it!",
      "rating": "5"
    },
    {
      "title": "My Dellis Great",
      "body": "Great replacement for 4yr old computer. It is better in all areas. According to my daughter, an Apple user, not so good in some. I am a  loyal Dell user, so who knows.",
      "rating": "5"
    },
    {
      "title": "New LapTop - Great Experience",
      "body": "Super fast service and very knowledgeable.\nWe were in and out.",
      "rating": "5"
    },
    {
      "title": "New Dell",
      "body": "The computer works great. I am a little disappointed in the keyboard, not being typical due to the numbers pad. I keep hitting the wrong keys.",
      "rating": "5"
    },
    {
      "title": "Dyslexic Inspiron user.",
      "body": "I love my new Inspiron 15.6. It’s easy to use. The touch screen makes it very easy for someone who is dyslexic like I am.",
      "rating": "5"
    },
    {
      "title": "The Dell Inspiron 15.6 Touch Screen Laptop",
      "body": "The Dell Inspiron 15.6 Touch Screen Laptop was designed for users who require easily-accessed and updated apps and programs. It is completely “user friendly”.",
      "rating": "5"
    },
    {
      "title": "New laptop",
      "body": "It’s a great laptop. However; it seems like the cursor disappears, and it’s harder to find it and control it, and I thought the speed would be more than what it is.",
      "rating": "4"
    },
    {
      "title": "Dell Purchase",
      "body": "Currently, satisfied with this laptop. Customer service experience at time of in store purchase was great.",
      "rating": "5"
    },
    {
      "title": "Dell",
      "body": "So far so good, still learning ••••••••••••••••••••••",
      "rating": "5"
    },
    {
      "title": "Purchased for my daughter.",
      "body": "Purchased for my daughter. She is happy with the purchase. Beyond that, there’s nothing else that I could add to this review.",
      "rating": "5"
    },
    {
      "title": "Disappointed",
      "body": "Have not used yet, Not happy with Windows Home S Mode",
      "rating": "4"
    },
    {
      "title": "Works well",
      "body": "Super fast and suitable for all my computing needs.",
      "rating": "5"
    },
    {
      "title": "Works well for an office laptop",
      "body": "No issues setting it up. Took it off of S mode due to some software that's not in the windows store, but overall working as expected. No issues",
      "rating": "5"
    },
    {
      "title": "Excellent",
      "body": "Great computer. Ive been looking for a good laptop and thus is exactly what I needed.",
      "rating": "5"
    },
    {
      "title": "Great computer",
      "body": "I'm really enjoying this laptop great speed and plenty of storage. At a great price.",
      "rating": "5"
    },
    {
      "title": "Dell Laptop",
      "body": "We had one of the best experiences purchasing this computer. My wife is using it for teaching and loves it!",
      "rating": "5"
    },
    {
      "title": "Good computer",
      "body": "This is a very nice computer. I’m certain I am not using it to its fullest capabilities. However, one thing I have noticed that is a nuisance is the pad is ultra sensitive. Perhaps there’s a setting for this?",
      "rating": "4"
    },
    {
      "title": "My new laptop",
      "body": "Perfect size includes Windows and a decent warranty I like the feel of the keys and setup was very easy and the price was great",
      "rating": "5"
    },
    {
      "title": "Excellent",
      "body": "The customer service was excellent! And the laptop is perfect! Thanks!",
      "rating": "5"
    },
    {
      "title": "Inspiron 15",
      "body": "Very light, yet very powerful.  Great value for an excellent computer",
      "rating": "5"
    },
    {
      "title": "Good but not for gaming",
      "body": "Keyboard feels cheap, and the dedicated VRAM is awful, but if all you need is a functional laptop for standard use, it works great.",
      "rating": "4"
    },
    {
      "title": "Mngt",
      "body": "Great product easy to use works very well great help on selection",
      "rating": "5"
    },
    {
      "title": "Good laptop/good price",
      "body": "So far working well.  Fan comes on at times but Geek Squad checked and it's fine.  A good inexpensive laptop.  Very comfortable to use.",
      "rating": "5"
    },
    {
      "title": "Moving on up",
      "body": "Easy to set up, love all the special features, and fits in the case that I purchased for it very comfortably",
      "rating": "5"
    },
    {
      "title": "Dell laptop",
      "body": "I have been working with Dell laptops for over 14 years. I never had any issues with any of the systems I've used. It has everything I need.",
      "rating": "5"
    },
    {
      "title": "Solid Ryzen 7 machine",
      "body": "This is a very nice laptop for less than $1000.  Fast, plenty of storage space, and good battery life.",
      "rating": "5"
    },
    {
      "title": "Excellent laptop",
      "body": "This is a great laptop and the price was very reasonable. The salesman was very knowledgeable.",
      "rating": "5"
    },
    {
      "title": "Ready and Rite",
      "body": "The size I was looking for with lots of memory. Responds rapidly to commands with a bright screen",
      "rating": "5"
    },
    {
      "title": "Great Price",
      "body": "So far great performance, and at a great price point!",
      "rating": "5"
    },
    {
      "title": "Great For Home Use",
      "body": "This Dell is fast with a finger friendly keyboard. I'll never come close to filling the 1TB SSD.",
      "rating": "5"
    },
    {
      "title": "My Best Buy in NYC",
      "body": "Very good notebook was a great Buy opportunity in my visit New York city",
      "rating": "5"
    },
    {
      "title": "Dell Inspiron Hits the spot!!!",
      "body": "This laptop will be of service to me for many years. Excellent performance, large capacity and ease of use.",
      "rating": "5"
    },
    {
      "title": "New Laptop",
      "body": "Ease of setup and use.  Stays charged for long time",
      "rating": "5"
    },
    {
      "title": "Very happy",
      "body": "Very easy to set up. Quick. Smooth keys. Perfect screen size. I like having on/off on keyboard",
      "rating": "5"
    },
    {
      "title": "It's good",
      "body": "It's a great computer, hopefully great for school, I'm starting this fall and I hope it works well",
      "rating": "5"
    },
    {
      "title": "Awesome team!!!",
      "body": "My experience was wonderful! From purchase to the geek squad setting up my pc. BEST BUY is always the best choice!",
      "rating": "5"
    },
    {
      "title": "Dell-inspiration 15.6 \" Touch Screen Laptop",
      "body": "I highly recommend this computer; it is very easy to work with and reasonably priced.",
      "rating": "5"
    },
    {
      "title": "This was a boo boo",
      "body": "LOL, it was sitting where the HP was supposed to be and was grabbed by mistake so it was returned and exchanged the same day",
      "rating": "4"
    },
    {
      "title": "DELL Laptop PC New Purchase",
      "body": "DELL Laptop PC has been Excellent.\nBest Buy Representatives were Very Good.",
      "rating": "5"
    },
    {
      "title": "Dell laptop",
      "body": "Love the light weight.  Touch screen is convenient.  Great value.",
      "rating": "5"
    },
    {
      "title": "The best",
      "body": "Beautiful computer, super easy to use and came on time, very good price",
      "rating": "5"
    },
    {
      "title": "Levono",
      "body": "Fast, light, exactly what I needed for work and starting my online business",
      "rating": "5"
    },
    {
      "title": "Laptop review",
      "body": "Everything works great. The keys and mouse pad work with no issues. Have had no problems so far",
      "rating": "4"
    },
    {
      "title": "M. Nebbia",
      "body": "I am verry satified with this computer, I would recommend this unit to others",
      "rating": "5"
    },
    {
      "title": "I Love the tecnical part",
      "body": "I like it, but I feel that the exterior could be more eye- catching, showing what’s inside",
      "rating": "4"
    },
    {
      "title": "Dell is the best",
      "body": "Very good battery life\nSpeed is very good too\nOverall performance is great",
      "rating": "5"
    },
    {
      "title": "My Dell",
      "body": "Good service so far.  Will buy at Best Buy again.  Nice store",
      "rating": "5"
    },
    {
      "title": "Good laptop",
      "body": "nice laptop easy to get started, nice features good graphics",
      "rating": "5"
    },
    {
      "title": "Computes",
      "body": "Great Products !!!!! I would choose BEST BUY for all my computer needs.",
      "rating": "5"
    },
    {
      "title": "Great so far.",
      "body": "Great so far. I take it back and forth to work, and it is easy to use.",
      "rating": "5"
    },
    {
      "title": "Great machine",
      "body": "Great deal,  great value... use it for work and personal use,  even did a little light gaming with it",
      "rating": "5"
    },
    {
      "title": "Grest laptop",
      "body": "Awesome laptop. Does everything I need it to. Battery lasts  long time",
      "rating": "5"
    },
    {
      "title": "Great Laptop",
      "body": "Great Laptop, good for online shopping, editing, and much more.",
      "rating": "5"
    },
    {
      "title": "Dell laptop",
      "body": "So far it's working well and as it should. No issues with setting it up or anything",
      "rating": "5"
    },
    {
      "title": "Pc",
      "body": "Great that’s amazing work properly and fast i love",
      "rating": "5"
    },
    {
      "title": "Very good.",
      "body": "It was excellent. It is very convenient. It is perfect size.",
      "rating": "5"
    },
    {
      "title": "Good purchase",
      "body": "Love this laptop. Easy to setup. Super fast and has a great picture.",
      "rating": "5"
    },
    {
      "title": "my dell",
      "body": "very pleased with ease of performance, speed and clarity.",
      "rating": "5"
    },
    {
      "title": "Dell Laptop",
      "body": "Great price, quick shipping.  What more could you ask for?",
      "rating": "5"
    },
    {
      "title": "Purchase",
      "body": "Great buy, meets our need. Delivered in very nice package.",
      "rating": "5"
    },
    {
      "title": "Review",
      "body": "The Dell Laptop is good and I do recommend other people to get it.",
      "rating": "5"
    },
    {
      "title": "Review",
      "body": "It is a very reliable computer, my only dislike of it is that the curser drags sometimes.",
      "rating": "4"
    },
    {
      "title": "My Dell",
      "body": "So far so good.  It scans and prints clearly and easily.  It does use up ink quickly.",
      "rating": "4"
    },
    {
      "title": "Laptop",
      "body": "very good, excellent quality, highly recommended...",
      "rating": "5"
    },
    {
      "title": "good",
      "body": "its good 4 what i use it 4 thats all i got too say",
      "rating": "5"
    },
    {
      "title": "TerranceB",
      "body": "Good computer for a great price.  I love the quality of display.",
      "rating": "4"
    },
    {
      "title": "Great laptop",
      "body": "Love this laptop.  Bought it for online college classes. Have had no issues and was able to set it up the way I needed to.",
      "rating": "4"
    },
    {
      "title": "Good buy for the money",
      "body": "I is a great computer for the money! The ssd drive size sold me!",
      "rating": "5"
    },
    {
      "title": "Awesome Laptop",
      "body": "Very easy and speedy.  I love it and will highly recommend it to friends and family.",
      "rating": "5"
    },
    {
      "title": "The perfect computer for the given price.",
      "body": "It is a good computer for that price. The battery life remains to be seen.",
      "rating": "5"
    },
    {
      "title": "Awesome purchase",
      "body": "Has been an amazing purchase it does everything I need it to do and more",
      "rating": "5"
    },
    {
      "title": "Computer",
      "body": "My wife is enjoying her new Dell computer. I am too.",
      "rating": "5"
    },
    {
      "title": "Laptop",
      "body": "I love the upgrade from my old laptop! I'll be back!",
      "rating": "5"
    },
    {
      "title": "Laptop",
      "body": "Great laptop for the price, great also for high school and college students",
      "rating": "4"
    },
    {
      "title": "Dell",
      "body": "Nice Laptop. I like it,, I prefer Dell over Apple.",
      "rating": "5"
    },
    {
      "title": "Great Price.",
      "body": "I love my new laptop, small enough to take with me in saddlebag of motorcyle,",
      "rating": "5"
    },
    {
      "title": "I'm superviser",
      "body": "Good service my items arrive at the time always is a good service  and good deals",
      "rating": "5"
    },
    {
      "title": "Great laptop",
      "body": "Great laptop at a good sale price to replace an old computer",
      "rating": "5"
    },
    {
      "title": "Decent for the price",
      "body": "Works well. A bit slow and mouse is glitchy. Decent for the price.",
      "rating": "4"
    },
    {
      "title": "Good Purchase",
      "body": "Nice computer for multitasking. I've had 20 windows open at the same time with no problems.",
      "rating": "5"
    },
    {
      "title": "Good price for open box",
      "body": "Good price i bought the open box item. Was in good condition and works well",
      "rating": "5"
    },
    {
      "title": "Laptop",
      "body": "Laptop was on clearance and does just what we need for computing power.",
      "rating": "5"
    },
    {
      "title": "I Sure Miss My HP",
      "body": "I don't love this computer. The keyboard feels cheap. It keeps switching between tabs. I can perform all of my usual tasks, but it just isn't like my HP. I thought I'd give Dell a try. I'll return to HP in five years.",
      "rating": "3"
    },
    {
      "title": "School laptop for the fall.",
      "body": "Met all school requirements and within budget.  Great screen diaplay.",
      "rating": "4"
    },
    {
      "title": "Dell Computer",
      "body": "Computer performs to my satisfaction and easy to use.  Dell is a good computer.",
      "rating": "4"
    },
    {
      "title": "Review",
      "body": "Good price. Worth for paid value. \nBest Buy response is good. We received product on same day.",
      "rating": "4"
    },
    {
      "title": "Great Sale Price",
      "body": "Needed a second computer for the home. This filled the gap - small, inexpensive (with sale ).",
      "rating": "4"
    },
    {
      "title": "Amazing value",
      "body": "Great laptop and amazing specs and for the price you cant go wrong",
      "rating": "4"
    },
    {
      "title": "Just OK.",
      "body": "This laptop is on fair. Battery life is very short I admit I was told about this short coming at time of purchase, but was still surprised. I’d say it’s ok, but would probably not purchase it again. That said I was used to Business computer so perhaps I’m being over critical.",
      "rating": "3"
    },
    {
      "title": "Inspiron laptop",
      "body": "Very happy with this purchase. Salesperson was helpful",
      "rating": "5"
    },
    {
      "title": "Pretty good.",
      "body": "Good for the price. Could have other colors. Will provide another review after a couple months of use.",
      "rating": "4"
    },
    {
      "title": "PC LAPTOP",
      "body": "Overall, this PC Laptop works well for my daily needs.",
      "rating": "4"
    },
    {
      "title": "Disappointed in the process",
      "body": "The computer was purchased on the 1st of May on the 4 th I used it and it was not working correctly, the Keys were not registering. I returned it to the store I purchased it from for an exchange (NO CASH  REFUND WAS ISSUED) at the Chesapeake square location they reserved one at the Greenbrier location for pickup as it was an exchange. The Greenbrier location stated that I would have to pay full price once again and then request a return for the initial payment and refused to give me the computer that was held and already paid for. In called customer service  and was advised to cancel that and go back to the Chesapeake Sq store and request they order the computer. It is now the 13th of May I am waiting on the computer and no money was returned no computer has been received. This has been a frustrating and disappointing purchase.",
      "rating": "1"
    },
    {
      "title": "Dell",
      "body": "Battery wasn't too good but I was able to exchange with something else",
      "rating": "3"
    },
    {
      "title": "Poor customer service",
      "body": "Screen went black computer was on but no screen. Was told to reach out to the manufacturer when i contacted Best Buy. Only had for about three weeks nothing happend to it wasn’t dropped so I spend almost a thousand dollars and get no help when it breaks less than a month in",
      "rating": "1"
    },
    {
      "title": "Products fine, cust service SUCKS",
      "body": "Cust service sucks, some person in South Americas.  Can't even call the store.  Never buy from you again.",
      "rating": "1"
    },
    {
      "title": "lasted 3 days",
      "body": "third day and it did a crash reset and would not let me reconnect to the internet. but it was perfect for three days. compliments to the next day delivery roadie.",
      "rating": "1"
    },
    {
      "title": "GET IT WHILE YOU CAN",
      "body": "The laptop is incredible for the deal, when I got it, it was $250 off. This is better than those other useless, garbage, and trashy Intel units. AMD is a million times more superior. AMD Radeon generally outperforms its competition for Windows 11: Intel Iris Xe Graphics. 60Hz refresh rate is good enough to handle many demanding or high-fps games. With 16GB of RAM, you can safely multitask with peace of mind, as updates will likely not affect it. And 1TB of storage is TOO GOOD for a laptop, you can safely carry large documents, assets, and archives with no problems whatsoever.\n\nTips for geeks: Dual-boot Windows 11 IoT LTSC Enterprise Subscription with Rufus (url: rufus.ie) and a copy of the ISO (url: massgraves.dev). Contains the latest perks and features, without the bloatware. This ensures your PC will run as expected.",
      "rating": "5"
    }
  ]
}