{
  "name": "HP 15-fa2013dx",
  "price": "779.99",
  "rating": "4.4",
  "reviews": "40",
  "specs": " Victus 15.6\" 144Hz Full HD Gaming Laptop  -  Intel Core i5  -  8GB Memory  -  NVIDIA GeForce RTX 3050  -  512GB SSD  -  Mica Silver",
  "product_url": "https://www.bestbuy.com/site/hp-victus-15-6-144hz-full-hd-gaming-laptop-intel-core-i5-8gb-memory-nvidia-geforce-rtx-3050-512gb-ssd-mica-silver/6618924.p?skuId=6618924",
  "full_specs": "N/A",
  "all_reviews": [
    {
      "title": "Not too shabby!",
      "body": "I got this laptop during a Deal of the Day about 2 weeks ago. It was at $599 but I got an open box at $508. First thing I did was buy 32gb of Ram and a 2tb NVME drive. Installing the drive and ram was pretty straight forward. I was surprised that the laptop had 2 NVME slots. \n\nI was debating between a handheld gaming pc or a  gaming laptop. I do light gaming and also use slicing software for my 3D printer. I have to say, I am not disappointed at all with the Victus laptop.\n\nI have been playing the Gears of War beta and it looks great. I am getting over 100 fps. One thing I noticed when I have the system metrics going is that GoW Beta makes the CPU run at 100%, same with CoD and any graphic intensive game. I think the i5 processor is likely the culprit but the thermals stay in a good range. Don't get me wrong, you can hear the fans when they go on high but I can also hear my wall AC so it's not a big problem. \n\nI seriously wanted to splurge on the Asus G14 or G16 but did not want to spend all that money, especially since I didn't need all that power. The screen isn't something to brag about but it gets bright enough and I honestly keep my laptop connected to an external 2k monitor so its a none-issue for me. \n\nThe HP Omen software is pretty good in that it lets you tweak your games using their AI to switch the game to the beset display settings but outside of enabling the metrics, I rarely use it \n\nI think if you can find this laptop at $500 or below, it is a great buy, just get more ram.",
      "rating": "5"
    },
    {
      "title": "it truly is gaming on a budget!",
      "body": "this is a pretty solid choice if you’re looking for a budget gaming laptop. it can handle a lot of games at high settings when plugged in, and the high refresh rate makes the desktop super smooth. the battery life is also pretty decent esp when you’re just browsing or doing light stuff. a downside, however is the build quality. it’s made out of plastic so its kinda flimsy and the hinge is a bit wobbly as well :/ it also runs hot and loud when u do heavy gaming. the screen is fast and i also like the colors which I think would be great for creative work but thats just me :)) overall its a pretty good pick (taking into account ur budget) if u want strong performance for the price and dont pay much mind to the cons",
      "rating": "4"
    },
    {
      "title": "Ok for the price",
      "body": "Overall I would say this laptop is ok for the price. I'll admit my attitude going into it wasn't the best because I feel I was forced into purchasing a new laptop just to get Windows 11 before October, but it had to be done and so far this laptop has met my requirements at least. I've had an ASUS gaming laptop for almost 15 years that I've really enjoyed so it's been really difficult for me to have to replace it. I've actually tried a few replacements over the years but ended up returning them for various reasons and just ended up taking the ASUS in for repairs because it was somehow outperforming the newer, more expensive models I was trying to replace it with. I think I still prefer my old ASUS to this HP, but keeping the old one is no longer an option so I've decided this one is sufficient for at least the next few years.\n\nThe main issue I have with it so far is the touchpad. Since I've not been in the market for a new laptop for quite some time I had no idea it wouldn't have actual buttons to left and right click. I'm getting used to it, but I don't see myself ever preferring this to tactile buttons. Also no matter how I change the sensitivity settings I'm still having issues with it. Even at the lowest settings I'm still getting a lot of accidental clicks and dragging issues while being unable to control finer movements to click on smaller buttons. I tried adjusting back to medium sensitivity and the finer movements still aren't improved.\n\nThe worst issue I've experienced with the touchpad though is if you place it directly on your lap it goes absolutely berserk. I did some research and finally saw a reddit post where some users had narrowed it down to an issue with the plastic casing. Somehow the touchpad will sense anything around it or even under it. Just resting it on your legs can trigger unintended 3 or 4 finger gestures. The 2nd time I used the laptop on my lap I placed it on a cooling pad and it eliminated the issue, but I still would have liked to have known about it before purchasing. The first time it happened I spent a good 4 hours fighting with it, thinking I'd gone insane and was somehow failing to be able to use a simple touchpad before finally finding this information. I had scoured the reviews to a similar model this one was based on (this one only had 1 review at the time I purchased it) and not a single person mentioned this issue. I find that so strange since apparently it's a known issue that many reddit users have complained about.\n\nPersonally, I find it very concerning that the laptop casing is so thin and cheap that the touchpad can sense through it. While it does look nice, you can tell right away that it feels kind of flimsy. Thankfully it seems I got a good one at least because during my research I did see photos that others had posted where their touchpad was sunken in along one side and having worse issues. Mine is at least level and functioning but I know for future reference to be extremely careful with it.\n\nI haven't had an HP in a long time but I do like how quickly it starts up. I could do without some of the ads though. For the first week it feels like it gave me weird startup notifications almost every time I started it. Some of them seemed quite urgent like \"low memory\" and \"registry issues detected\", which at first glance is really concerning when using a brand new laptop but I found that if you click to resolve the issue it basically just takes you to an advertisement for HP iolo. I'm fine if a company wants to advertise, but the false system notifications are really uncalled for.\n\nDespite my annoyance and concerns with how well the plastic casing and touchpad will hold up, I have decided to keep it. Keep in mind I've only used it for less than 2 weeks but it does at least perform well. Hopefully it will continue to hold up long-term.",
      "rating": "3"
    },
    {
      "title": "A Solid Entry-Level Gaming Laptop",
      "body": "offers good performance for its price, with an Intel Core i5 and NVIDIA GeForce RTX 3050 that handle everyday tasks smoothly and run most games well. The 144Hz Full HD screen delivers smooth visuals, though the brightness could be better. Cooling works effectively, but the fans can get loud during heavy use. Battery life is average, lasting a few hours for browsing and less during gaming. The build quality is decent but doesn’t feel premium, especially around the hinge and ports. Overall, it’s a capable and affordable gaming laptop for casual gaming and daily use, but not a replacement for higher-end rigs",
      "rating": "4"
    },
    {
      "title": "Good Mobile Beginner Laptop",
      "body": "Bought for wife for her first foray into PC gaming. She does not push systems as a hardcore gamer would, as we have not had the freedom of gaming since pre pandemic, while also utilizing it for craft projects like a Cricut\n\nMeets the needs of an intro build. Minimal heat problems. Only reason I took 1 star off is I felt it was lacking in the USB department. 1 more port and I would say it would have been perfect.",
      "rating": "4"
    },
    {
      "title": "Great",
      "body": "It’s a good laptop only problem is the 8gbs of ram. The 8gbs of ram hinders the performance a lot and would highly suggest upgrading it. On the contrary the 144hz screen is good and the 3050 6gb is really good for the price i got it for (470$). Overall the laptop is an amazing if u get it for less than 650$.",
      "rating": "4"
    },
    {
      "title": "Great performance for gaming, especially The Sims!",
      "body": "Absolutely love this laptop. The performance is smooth, fast, and perfect for playing The Sims (and other games too). Load times are quick, and the graphics look amazing with the RTX 3050. The 144Hz display is a major upgrade—it makes everything feel more responsive. The only minor downside is the fan can get a bit loud after a few hours of play, but honestly, I barely notice it when I’m deep in gameplay. Great value for the price and perfect for casual to moderate gamers.",
      "rating": "5"
    },
    {
      "title": "A perfect budget gaming laptop",
      "body": "Bought this for my fiancé as a gift for finishing up college. Its a great laptop, boots up in seconds, multi tasks perfectly, and she downloaded Final Fantasy 14 to play on the go and it can run at max settings at around 70-80 fps (While plugged in, if on battery mode, we would probably need to run it lower to save energy). Normal use on energy saver mode saw around a 4-5 hour battery life.",
      "rating": "5"
    },
    {
      "title": "Good laptop for under $600",
      "body": "For a good budget gaming, PC or laptop this is really good. It even has some things in here that are better than my buddies laptops or PCs and I paid a fraction of what they had paid. I would highly recommend this laptop if you are in need of a gaming laptop for a budget.",
      "rating": "5"
    },
    {
      "title": "Not bad..",
      "body": "Got this unit on sale for around $500. It's a solid upgrade for me from my aging computer. Mostly need it for daily use and art stuff but it's nice that it can game a bit too. I dig it. Gonna upgrade the ram to 32gb soon and then it'll be even better.",
      "rating": "5"
    },
    {
      "title": "This laptop slams good",
      "body": "This laptop has had me happy it's nice has a long battery life and can play pretty much anything i throw at it my only cavaet is that the laptop needs more ram",
      "rating": "5"
    },
    {
      "title": "Solid, needs more RAM",
      "body": "Happy with this purchase. It’s about exactly what my wife wanted. She’s games casual, likes games like The Sims and it’s be great for that. Couldn’t definitely benefit from some more RAM though.",
      "rating": "4"
    },
    {
      "title": "Solid Budget friendly webcasting laptop.",
      "body": "For the price, these are hard to beat. We use these for webcasting for local churches. We add some memory and they are good to go for live broadcasting and for video editing afterwards.",
      "rating": "5"
    },
    {
      "title": "Excellent",
      "body": "The lapto complain with all my expectations in relation to the specifications, when I arrived at the store I was very well attended by the Seller who showed me the equipment and I could quickly make a decision. Greetings Gilbert, Arizona",
      "rating": "5"
    },
    {
      "title": "Love it",
      "body": "I really love this Labtop for the price. Great graphics and runs super smooth. My only issue is it’s having memory issues already and I only have one small game downloaded",
      "rating": "4"
    },
    {
      "title": "Excellent laptop",
      "body": "Works great.  Add some memory and it really flies.  Keyboard is comfortable.   I like the power and opportunity to play some games.  Great basic gaming laptop",
      "rating": "5"
    },
    {
      "title": "Solid Gaming laptop",
      "body": "This is a really good laptop. All you need to do is add 32gb of ram and it plays flawless! For 599 on sale you can't beat that.",
      "rating": "5"
    },
    {
      "title": "Perfect for what I needed!",
      "body": "Works good to play sims with some mods and custom content!",
      "rating": "5"
    },
    {
      "title": "Great Entry Level Gaming Laptop",
      "body": "Highly recommend for beginner to medium experienced content creators. I needed a laptop that could handle video editing, music producing and gaming. This laptop did great for all three.",
      "rating": "5"
    },
    {
      "title": "Great laptop",
      "body": "Great product for the price. Great specs and the discount makes it an even better buy.",
      "rating": "4"
    },
    {
      "title": "Great laptop for beginner budget",
      "body": "Resolution is great except, the laptop runs great I love it so far but the wifi cuts off randomly for some reason I'm not sure why",
      "rating": "4"
    },
    {
      "title": "Great Gaming Laptop!",
      "body": "Great Gaming Laptop.  Was a bday present for my daughter and she loves it .",
      "rating": "5"
    },
    {
      "title": "Laptop review",
      "body": "So far so good. No issues or anything qorks decent for what i use it for.",
      "rating": "5"
    },
    {
      "title": "More than readonable",
      "body": "Got to use as a tuning laptop has ended up being my go to for everything",
      "rating": "5"
    },
    {
      "title": "Good Gaming Laptop",
      "body": "I think is a good gaming laptop, i can play fortnite and minecraft.",
      "rating": "4"
    },
    {
      "title": "Review of HP Victus 15.6 in laptop",
      "body": "HP Victus 15.6 in is a money's worth. It is truly an excellent laptop.",
      "rating": "5"
    },
    {
      "title": "Great deal.",
      "body": "Great laptop. Excellent prices and friendly and helpful salesperson.",
      "rating": "5"
    },
    {
      "title": "Amazing.",
      "body": "Amazing item worth every penny.\nHighly recommend for everyone.",
      "rating": "5"
    },
    {
      "title": "Excellent product great cost benefit",
      "body": "Excellent product. Give the boys a chance to play with each other while supporting educational needs.",
      "rating": "5"
    },
    {
      "title": "Great laptop",
      "body": "Very nice laptop, runs pretty well with current games.",
      "rating": "5"
    },
    {
      "title": ".",
      "body": "This is a really good laptop i love this laptop it’s good if u in a budget",
      "rating": "5"
    },
    {
      "title": "Great gaming laptop",
      "body": "Great speed and storage. Perfect for Minecraft and fortnite",
      "rating": "5"
    },
    {
      "title": "Runs great!",
      "body": "Works great! Runs everything it needs to and performs super good!",
      "rating": "5"
    },
    {
      "title": "Great starter gaming laptop",
      "body": "Fantastic starter gaming laptop for my nephew's birthday.",
      "rating": "5"
    },
    {
      "title": "good",
      "body": "good but not for me aat the moment, need better hardware",
      "rating": "5"
    },
    {
      "title": "didn't last long",
      "body": "We had two of them and they didn't last too long, just average",
      "rating": "3"
    },
    {
      "title": "Faulty keyboard",
      "body": "Was working well, but there is short circuit in keyboard. Typing Q is shutting down the laptopn",
      "rating": "2"
    },
    {
      "title": "GREAT GAMING LAPTOP",
      "body": "This laptop has been working fine for me i play warzone forza sparking zero and more. You will need more ram for this laptop though so why you are in store grab a 16gb of ram and this laptop will run perfect for almost any game! Battery life isnt the best but it will get you through around 2 to 3 hours of gaming depending on what game it is.",
      "rating": "4"
    },
    {
      "title": "Battery",
      "body": "Less than 2 yrs old and my battery is gone. I thought it was the cord initially, but the battery no longer holds a charge. Once I unplug it, it goes dark.",
      "rating": "2"
    },
    {
      "title": "Hp victus worst laptop 5mos dead",
      "body": "Bought this ho victus feb 25 its now june 12 it dies hard start ups black screen no help from best buy or hp",
      "rating": "1"
    }
  ]
}