{
  "name": "HP 14-es1013dx/9R8R2UA#ABA",
  "price": "799.99",
  "rating": "4.7",
  "reviews": "509",
  "specs": " Envy 2 - in - 1 14\" Full HD Touch - Screen Laptop  -  Intel Core 5  -  8GB Memory  -  512GB SSD  -  Natural Silver",
  "product_url": "https://www.bestbuy.com/site/hp-envy-2-in-1-14-full-hd-touch-screen-laptop-intel-core-5-8gb-memory-512gb-ssd-natural-silver/6571086.p?skuId=6571086",
  "full_specs": {
    "Screen Type": "IPS",
    "Screen Size": "14 inches",
    "Screen Resolution": "1920 x 1080 (Full HD)",
    "Touch Screen": "Yes",
    "Brightness": "300 nits",
    "Processor Model": "Intel Core 5 Series 1",
    "Storage Type": "SSD",
    "Total Storage Capacity": "512 gigabytes",
    "System Memory (RAM)": "8 gigabytes",
    "Graphics": "Intel Graphics",
    "Display Connector(s)": "1 x HDMI 2.1",
    "Battery Life (up to)": "12.5 hours",
    "Battery Chemistry": "Lithium-ion polymer",
    "2-in-1 Design": "Yes",
    "Backlit Keyboard": "Yes",
    "Brand": "HP",
    "Model Number": "14-es1013dx/9R8R2UA#ABA",
    "Product Name": "Envy 2-in-1 14\" Full HD Touch-Screen Laptop - Intel Core 5 - 8GB Memory - 512GB SSD",
    "Color": "Natural Silver",
    "Year of Release": "2023",
    "Display Type": "LED",
    "Processor Brand": "Intel",
    "Processor Model Number": "120U",
    "CPU Boost Clock Frequency": "5 gigahertz",
    "Number of CPU Cores": "10-core",
    "CPU Cache Memory Level": "L3",
    "L3 Cache": "12 megabytes",
    "Neural Processing Unit (NPU)": "No",
    "Solid State Drive Capacity": "512 gigabytes",
    "Type of Memory (RAM)": "DDR4",
    "System Memory RAM Speed": "3200 megahertz",
    "Graphics Type": "Integrated",
    "GPU Brand": "Intel",
    "Operating System": "Windows 11 Home",
    "Number of HDMI Outputs (Total)": "1",
    "Number of DisplayPort Outputs (Total)": "0",
    "Number of Thunderbolt Ports (Total)": "0",
    "Number of VGA Ports": "0",
    "USB Ports": "1 x USB-C 3.1, 2 x USB-A 3.0",
    "Number of USB Ports (Total)": "3",
    "Headphone Jack": "Yes",
    "Microphone Input": "Yes",
    "Wireless Connectivity": "Bluetooth, Wi-Fi",
    "Wireless Networking Standard": "Wi-Fi 6E",
    "Network Connectivity": "None",
    "Power Supply Maximum Wattage": "65 watts",
    "Battery Cells": "3-cell",
    "Front-Facing Camera": "Yes",
    "Front Facing Camera Megapixels": "5 megapixels",
    "Built-In Microphone": "Yes",
    "GPS Enabled": "No",
    "Media Card Reader": "Yes",
    "Media Card Slot": "microSD",
    "Speaker Type": "Poly Studio with dual speakers",
    "Windows AI": "Copilot",
    "Security Features": "Fingerprint reader, Privacy camera",
    "Casing Material": "Aluminum",
    "Product Height": "0.77 inches",
    "Product Width": "12.68 inches",
    "Product Depth": "8.3 inches",
    "Product Weight": "3.35 pounds",
    "ENERGY STAR Certified": "Yes",
    "EPEAT Qualified": "Yes",
    "EPEAT Level": "Gold",
    "Optical Drive Type": "None",
    "Numeric Keypad": "No",
    "Warranty - Parts": "1 year",
    "Warranty - Labor": "1 year",
    "UPC": "198122013654"
  },
  "all_reviews": [
    {
      "title": "HP Envy 14 review",
      "body": "Best in segment for the price range:Value for money or best deals only in best buy!\n\n\n\"I recently purchased the Hp Envy14  and I'm thoroughly impressed! The laptop's performance has exceeded my expectations, with fast loading times and seamless multitasking. The display is crisp and vibrant, making it perfect for streaming and video editing.\n\nThe battery life is also impressive, lasting me around 8 hours on a single charge. The keyboard is comfortable to type with backlight on, and the touchpad is responsive. The laptop's design is sleek and lightweight, making it easy to take on the go.\n\nMy only minor complaint is that the speakers could be louder, but overall, I'm extremely satisfied with my purchase. I would highly recommend HP Envy 14 to anyone in the market for a new laptop.\"\n\n*Rating:* 4.5/5 stars",
      "rating": "4"
    },
    {
      "title": "HP Envy 2 in 1 laptop",
      "body": "I recently purchased an HP laptop, and it has exceeded my expectations in several ways. The build quality is impressive, offering a sleek and durable design that’s both lightweight and sturdy. The display is vibrant with excellent color accuracy, making it perfect for both work and entertainment.\n\nPerformance-wise, the laptop handles multitasking with ease, thanks to its powerful processor and ample RAM. Whether I’m running demanding applications or switching between numerous tabs, it remains responsive and fast. The keyboard is comfortable and quiet, which makes typing for long periods a breeze.\n\nBattery life is another standout feature. I can easily get through a full workday on a single charge, which is incredibly convenient for on-the-go use. Additionally, the laptop’s cooling system is efficient, keeping the device cool even during intense usage.\n\nOverall, this HP laptop combines performance, design, and reliability at a competitive price point. It’s a solid choice for anyone in need of a versatile and high-quality machine.",
      "rating": "5"
    },
    {
      "title": "Review HP",
      "body": "I would absolutely recommend this laptop. Has a very nice sleek design easily fits into a backpack, battery life is long. Recharging is very fast. Keyboard is just the right size. Display is super clear.  Touchscreen works perfectly.",
      "rating": "5"
    },
    {
      "title": "College/Gaming/Editing",
      "body": "10/10! I love this laptop so much! As a college student, this is the perfect laptop, especially if you’re taking notes, the touchscreen and it being able to fold completely, is a huge plus! As a gamer as well, it’s able to handle small games well. It’s also good for editing!☺️",
      "rating": "5"
    },
    {
      "title": "New work laptop",
      "body": "Needed a small laptop for a new job. Touch screen, able to rotate screen away from keyboard is a life saver and ease of use for a senior all give the laptop a five star rating.",
      "rating": "5"
    },
    {
      "title": "Best laptop I ever had",
      "body": "I use it for a lot of purposes, school, editing, coding, small AI models running and some gaming, it has an amazing Performance for the components it has, very versatile",
      "rating": "5"
    },
    {
      "title": "HP ENVY LAPTOP 2-1 TOUCHSCREEN 14 INCHES.",
      "body": "This basic computer offered the perfect solution for my search engine and small project needs. Its long battery life was a valuable asset, enabling me to work for as long as I needed without worrying about running out of power. The computer's capabilities were also impressive, handling my workload with ease and efficiency. I am extremely satisfied with my purchase and would definitely recommend it to others.",
      "rating": "5"
    },
    {
      "title": "Beautiful laptop",
      "body": "Great for working remotely. Lightweight, long-lasting batteries, and upgraded features.",
      "rating": "5"
    },
    {
      "title": "loving",
      "body": "so far loving my new Envy x 360 laptop\neasy to setup easy to use\nquick and seems reliable so far",
      "rating": "5"
    },
    {
      "title": "Best computer ever",
      "body": "It’s a good computer, it’s fast and reliable, the shipping was amazing and came in the time frame they told me it was going to come.",
      "rating": "5"
    },
    {
      "title": "Laptop",
      "body": "The laptop is good for a daily driver for most people, though I highly suggest buying a laptop more than 16gb ram as 8gb isnt enough but it is a very good laptop.",
      "rating": "4"
    },
    {
      "title": "10/10",
      "body": "Great Computer! Got it for College and proctored testing. Worth the buy.",
      "rating": "5"
    },
    {
      "title": "Small and convenient",
      "body": "Small and nice!! I love a touchscreen computer. I use it for school.",
      "rating": "5"
    },
    {
      "title": "great",
      "body": "does exactly what’s needed, live the way it flips back and the touch screen is very receptive",
      "rating": "4"
    },
    {
      "title": "Love it!",
      "body": "Easy to set up and Iblove the 2 in 1 feature.  Super fast.",
      "rating": "5"
    },
    {
      "title": "Sometimes you get lucky",
      "body": "So far so good so far so good. So far so good. So far so good.",
      "rating": "5"
    },
    {
      "title": "Good laptop",
      "body": "Great laptop for studying and general use and it’s touchscreen",
      "rating": "5"
    },
    {
      "title": "Superb Global Experience",
      "body": "Fantastic laptop and great purchase experience \nThe Sales person helped me well close the deal and shared details quite well and openly.\nThis has resulted in building confidence in what I am doing since I travelled to Dallas as visitor from another country",
      "rating": "5"
    },
    {
      "title": "My HP Envy, the best of all time",
      "body": "It’s works perfectly for me and it’s a good laptop.\nI will choose it over and over again.",
      "rating": "5"
    },
    {
      "title": "YEAH BABY!",
      "body": "An AWESOME AWESOME laptop.\nTouch screen has changed my life.",
      "rating": "5"
    },
    {
      "title": "Sleek and",
      "body": "Very sleek and pretty, up to date with different ways to customize to your liking. Only thing is that the battery dies fast",
      "rating": "5"
    },
    {
      "title": "Great purchase",
      "body": "Light, handy and it works perfect. It’s really a good value for money.",
      "rating": "5"
    },
    {
      "title": "Great machine",
      "body": "Great windows 11 machine. Xbox cloud gaming is fantastic.",
      "rating": "5"
    },
    {
      "title": "Good experience , when I thought I wouldn’t have o",
      "body": "To very young, very nice gentleman helped me with the sale they weren’t overly pushy. They were knowledgeable and respectful.",
      "rating": "5"
    },
    {
      "title": "Great 2-in-1 Laptop for Everyday Use!",
      "body": "I recently purchased the HP Envy 2-in-1 14\" Full HD Touch-Screen Laptop from Best Buy, and I couldn’t be happier with my choice.\n\nPerformance: The Intel Core i5 processor and 8GB of memory handle multitasking effortlessly. Whether I’m streaming, working on documents, or running multiple tabs, everything runs smoothly.\n\nStorage: The 512GB SSD provides plenty of storage space and makes booting up and accessing files super quick.\n\nDesign: The 14-inch Full HD touch screen is vibrant, responsive, and perfect for streaming videos or editing photos. The 2-in-1 functionality is a game-changer—I can easily switch between laptop and tablet mode depending on my needs.\n\nBuild Quality: The Natural Silver finish gives the laptop a sleek and professional look. It’s lightweight yet feels durable, making it great for on-the-go use.\n\nOverall, this laptop is a fantastic combination of performance, portability, and style. Best Buy made the buying experience seamless, and I highly recommend this product to anyone looking for a versatile and reliable laptop!",
      "rating": "5"
    },
    {
      "title": "HP ENVY x360 Laptop",
      "body": "I really like the device. It's the right size for me, and it's quick and easy to use for what I need. It's easy to access, the projection is very good, and it's also lightweight. I'm delighted with my purchase.",
      "rating": "5"
    },
    {
      "title": "My Simplified Computer Life.",
      "body": "This is the simplest Laptop computer I have ever used. I absolutely love the convenience of the touch screen. For  vision purposes, the screen is bright, the lettering clear, and really easy on my eyes. I love that it is medium size and light weight. Easy to carry in or out of a case or computer bag. My HP Envy 2-in-1 Laptop is the Amazing! It fits all my personal and business needs. It's the BEST!!",
      "rating": "5"
    },
    {
      "title": "Laptop",
      "body": "Excellent Laptop - Highly Recommended!\n\nI recently got the laptop and it’s fantastic! The performance is top-notch with its fast processor and ample RAM, perfect for multitasking and demanding tasks. The display is bright and crisp, great for work and entertainment. Battery life is impressive, lasting all day on a single charge.\n\nThe lightweight design makes it super portable, and the keyboard is comfortable for long typing sessions. It also comes with great features like [specific features]. Overall, a powerful and reliable laptop that’s worth every penny!",
      "rating": "5"
    },
    {
      "title": "Great 2 in 1 laptop",
      "body": "This laptop is exactly what I was looking for.  The touchscreen is beautifully bright.  The illuminated keyboard, fingerprint reader and camera work well.  Processor speed is good and storage is fine for my home use.  A nice slim lightweight 2 in 1 that I would recommend.",
      "rating": "5"
    },
    {
      "title": "Laptop review",
      "body": "Computer is fast, slim and good quality. Easy to use.",
      "rating": "5"
    },
    {
      "title": "Great light weight laptop for college kid.",
      "body": "This was a gift for my daughter who is a senior in HS and about to head off for college. She wanted a laptop that was on the smaller/lighter side to take to school and so far has been very happy with this one. The battery has been holding up very well, her previous laptop would die halfway through school and this one makes it home with 50% charge without having to be being plugged in at school. The processor and RAM are enough for what she does with it, able to handle all the programs she uses at school and good enough for light gaming (World of Warcraft, Minecraft, etc.) but not sure if it would be able to handle anything more demanding like a AAA title since it doesn't have a separate GPU. It's perfect for the jobs she needs it for though.",
      "rating": "5"
    },
    {
      "title": "Great deal",
      "body": "Easy to setup. Light weight and fast. Uncomplicated and great picture screen.  It does everything i need it to do.",
      "rating": "5"
    },
    {
      "title": "The product is really awesome.",
      "body": "I like the looks, and especially it is light weight (1.45 kg), fast, 360 rotation, can be used as tab, and the touch screen features makes it really good.",
      "rating": "5"
    },
    {
      "title": "HP Laptop Easy Peasy",
      "body": "Laptop is easy to use, love the flexibility and battery life that it has. The size is perfect for traveling if needed. The security features are relevant such as fingerprint, pin lock etc. Great! Compatible with connections usb and usbc along with a classic headphone jack. Love this device! would recommend!",
      "rating": "5"
    },
    {
      "title": "Great machine for what it is.",
      "body": "For the price, it's a great machine.  I originally purchased 2 of them 4 months ago.  I purchased my 3rd one a couple weeks ago.  It does everything I keed  has the features I need.  It runs smooth and with plenty of speed.  I did upgrade the hard drives to 2 TB's.  I wish the ram could be upgraded, but it cannot.",
      "rating": "5"
    },
    {
      "title": "Recommended for a decent touch screen laptop",
      "body": "Upon startup the fan was very loud but after that first time the laptop is not too loud. As the model is older, the laptop is on the heavy side and the battery is quite large. It requires 2 hands to open the laptop. The processing speed is pretty fast. I also like the keyboard and the placement of the audio jack.",
      "rating": "4"
    },
    {
      "title": "Excellent laptop",
      "body": "he HP Envy 2-in-1 14\" laptop is an excellent mid-range device for students, professionals, and casual users seeking a reliable and flexible laptop. Its combination of a high-quality touch screen, solid performance, and versatile form factor make it a standout choice in its price range. While it may not suit heavy multitaskers or gamers, it excels as a daily driver for productivity, creativity, and entertainment.",
      "rating": "5"
    },
    {
      "title": "HP Laptop",
      "body": "above average performance at a reasonable price. Sleek unit with user friendly layout.",
      "rating": "4"
    },
    {
      "title": "Good price, great performance!",
      "body": "Have an older HP Beats that cannot update to windows 11. Since updates will discontinue for windows 10 in October, thought now would be a good time to get a new laptop before those wretched tariffs hit. Am retired, so dont need anthing fancy. Found this to be perfect for my needs. Everything from the old loaded onto the new one along with my McAfee virus protdction, so didn't need geek squad to do it for me for the $99 charge. Doesn't have a disc capabilty, but that's okay. Due to my age, needed the keyboard backlight like my old Beats. Loads quickly, good size screen & audio is fine for my needs. Great price too. Glad I took the step.",
      "rating": "5"
    },
    {
      "title": "Great computer for clinic setting.",
      "body": "This compact 2-in-1 laptop is great as a tablet touchscreen when I'm on the move in the office, and then as a laptop when I get to work at my desk.  I have had very good longevity with HP products in the past for this type of use, and they hold up well with heavy handling.  My other HP 2-in-1's are a Pavillion and another Envy.   I use the computers in a healthcare setting for my virtual assistant to be on Zoom and scribe for me during exams.  Audio is great, and battery life is adequate if I plug it in for a few minutes throughout the day.",
      "rating": "5"
    },
    {
      "title": "Best HP in store",
      "body": "This HP is by for one of the best purchases I have ever made. I love the back lit keys. It’s super fast, lightweight, easy to store and has long battery life. Thinking about purchasing my son one. Please don’t let this one pass you by.",
      "rating": "5"
    },
    {
      "title": "Top class",
      "body": "Excellent speed with touch screen. Very light weight.",
      "rating": "5"
    },
    {
      "title": "HP Envy is a versatile laptop is made for travel.",
      "body": "Very nice new laptop. The touch screen is a bonus that I use frequently.\nIt worked flawlessly on my latest trip. Lightweight easy to set up.",
      "rating": "5"
    },
    {
      "title": "Fantastic Budget Laptop with plenty of useful Feat",
      "body": "Overall a superb laptop for anyone looking to use this for work or school. The software is quick and effecient and i appreciate the added fingerprint reader to unlock the device making that handy during any urgent situation. The screen is bright and sharp without any lag including the feature to turn the panel in a 360° fashion which can be useful. I would recommend this laptop to anyone looking for a budget friendly device that offers plenty of excellent features to put to use.",
      "rating": "5"
    },
    {
      "title": "HP envy",
      "body": "I really like the weight, the ease of use when typing. Plus the touch screen is an added bonus.  I glad I made this purchase.",
      "rating": "5"
    },
    {
      "title": "HP Envy",
      "body": "This Laptop has been very convenient for me, Its the Perfect Size. Its lightweight",
      "rating": "5"
    },
    {
      "title": "The best laptop",
      "body": "I am using it for almost a year and it is working very good. The battery life, touch and the workload it can handle is great. It can be used fir work purposes too.",
      "rating": "5"
    },
    {
      "title": "MzCleo",
      "body": "Love the size & weight, that it can be used as a touch screen and an iPad.",
      "rating": "5"
    },
    {
      "title": "Perfect Everyday Laptop – HP Envy 14” 2-in-1 Excee",
      "body": "I recently purchased the HP Envy 14” 2-in-1 from Best Buy, and I couldn’t be more satisfied. The build quality is premium, and the 360-degree hinge makes it incredibly versatile for both work and entertainment. The touchscreen is sharp and responsive, and the display quality is stunning — perfect for streaming and creative tasks.\n\nPerformance-wise, it’s a powerhouse. With a fast processor and plenty of RAM, it handles multitasking effortlessly, and I haven’t experienced any lag. Battery life is solid, lasting me through a full workday. I also appreciate how lightweight and compact it is — great for traveling or working on the go.\n\nOverall, this is one of the best laptops I’ve used in this price range. Kudos to Best Buy for the smooth buying experience and timely delivery. Highly recommend!",
      "rating": "5"
    },
    {
      "title": "Laptop",
      "body": "I'm not really a computer person, this lap top is of great quality, lightweight, and really quick. \nPicture on touch screen is very nice, colors are brilliant and crisp. I would recommend for students, and those who just want a simple use laptop.",
      "rating": "4"
    },
    {
      "title": "Great laptop",
      "body": "Needed to replace an outdated laptop. Speed is great, screen quality is good, and love that it's a touch screen. Memory is exactly what we were looking for. Price was great in comparison with similar laptops.",
      "rating": "5"
    },
    {
      "title": "Great Laptop for the price",
      "body": "Was insanely quick and also the employee suggested this laptop with the same price at a better speed processor and screen size. I love this laptop as a computer engineering student.",
      "rating": "5"
    },
    {
      "title": "THE BEST YET!",
      "body": "Love this laptop and the functionality it brings with it. It is super fast, thin and light, and up to date on every aspect! I would recommend it for any person needing something for school, or like me- work from home! I have used MAC before and did not know if I would like the change, but I am honestly amazed!",
      "rating": "5"
    },
    {
      "title": "Hopeful for a good, long relationship!!",
      "body": "We were looking for a laptop with as little AI as possible, and this one seemed to fit the bill.  The boot time is pretty good, and there seems to be adequate resources to accomplish our relatively non-demanding usage.  This is our first touch-screen laptop, though we have a tablet and smart phones, and there are times this feature is really welcome.  The price and credit care incentive made for an affordable purchase.  We're hopeful we'll have this laptop for a long, long time.  It's predecessor, a November 2011 HP purchase, is still functioning!!",
      "rating": "5"
    },
    {
      "title": "Laptop",
      "body": "Love this computer.  Very easy to use.  Had everything I need to use\n Fast",
      "rating": "5"
    },
    {
      "title": "HP",
      "body": "Great computer.  Love touch screen. Speed is good.  Screen clear.",
      "rating": "5"
    },
    {
      "title": "Excellent. Laptop and tablet",
      "body": "So far, excellent.  I was using a tablet (surface) for a long time, but it was time to upgrade, but this time I needed a laptop, and at the same time that I could use it as tablet (when I lay down in bed before I go to sleep), so this one you cannot detach it, but \"you can fold it\" and it's like a tablet.  Happy with it.",
      "rating": "5"
    },
    {
      "title": "great little laptop",
      "body": "I actually purchased this as a gift for my stepdaughter, her's  had bit the dust! She needed a replacement asap to complete her college studies and this is perfect...touchscreen and backlit keyboard and the price was very affordable, almost wish I had someone else to buy one to gift",
      "rating": "5"
    },
    {
      "title": "Just what I was looking for",
      "body": "This touchscreen laptop has met every need that I was looking for. The navigation of it is very easy to use and understand. The setup was quick. Reccomend this for all your needs.",
      "rating": "5"
    },
    {
      "title": "Awesome computer",
      "body": "It’s an amazing computer. Its touch screen which is very convenient and battery lasts all day. If you’re looking for a computer for school or work this is a great computer for you !",
      "rating": "5"
    },
    {
      "title": "Great for college!",
      "body": "I got this laptop for college. It's been great. It works as expected, has a long battery life, and I like the password touch feature.",
      "rating": "5"
    },
    {
      "title": "Great Laptop…. But Not the Best Value For Money",
      "body": "It is a great laptop! It runs smoothly and everything works well! It is not capable of running anything too intensive, but that’s normal because of the amount of memory it’s configured with. However, it’s not the best bang for your buck, so unless you need a computer right now, you should wait and see if you can find better deals.",
      "rating": "4"
    },
    {
      "title": "Hp Computer",
      "body": "I bought his computer for my business. It has been very easy to use and a great size to take with me.",
      "rating": "5"
    },
    {
      "title": "Best Laptop",
      "body": "OMG, the best purchase in electronics that I've made. I literally have a personal assistant on my computer. It makes research a breeze, not to mention the touch screen and ability to convert into a tablet. I highly recommend.",
      "rating": "5"
    },
    {
      "title": "HP envy 14inches",
      "body": "Looking sexy, light weight, great performance, overall great laptop.",
      "rating": "5"
    },
    {
      "title": "Awesome HP Envy Laptop",
      "body": "My HP Envy is amazing and the set up was very easy via self install.  This laptop is lightweight and can double as a tablet if needed. The laptop adapts easily to my peripheral HP monitors and speakers.",
      "rating": "5"
    },
    {
      "title": "My HP envy laptop",
      "body": "Very easy to use, plenty of memory available, excellent speed.",
      "rating": "5"
    },
    {
      "title": "Packs a punch",
      "body": "I like it,  its thin, sleek and fast enough for my use",
      "rating": "5"
    },
    {
      "title": "\"Best Product Buy\"",
      "body": "Fantastic buy! The laptop was delivered on timeand in perfect condition. It is precisely as described, fast and lightweight. Outstanding for work and entertainment. Very satisfied.",
      "rating": "5"
    },
    {
      "title": "Excellent laptop",
      "body": "I have been very satisfied with my experience using this laptop. Small and thin and perfect for travel. Great RAM and processor for everyday tasks. Not the best battery but the screen and the speakers are awesome.",
      "rating": "5"
    },
    {
      "title": "Reliable and long battery life",
      "body": "This laptop serves all my personal and professional needs. For whatever reason, I did not realize it was also touch screen until accidentally touching it. Now, I even find myself touching my non-touch screen work laptop because touch screen can actually be pretty convenient at times.\n\nBattery life is really reliable, I am not always in an area where I can access outlets, so being able to work from these spaces is useful.",
      "rating": "5"
    },
    {
      "title": "Great laptop",
      "body": "I love my new laptop. The touchscreen is great. And I am able to fold the laptop like an ipad. Thanks to the awesome worker at Best Buy. Who helped me select the right laptop for me. With so many to choose. They helped narrow down my selection . Good job Best Buy",
      "rating": "5"
    },
    {
      "title": "Great Product!",
      "body": "This product was purchased for my son to complete online assignments. It operates as described. The battery life is sufficient. A great prodecut for the asking price.",
      "rating": "5"
    },
    {
      "title": "Like the display but fans are too noisy",
      "body": "So I bought this for my son to do his homework from school and also browse the internet. Are the fans supposed to be this loud in windows 11? Just browsing the internet on chrome and boy this 2024 2 in 1 laptop has NOISY FANS! I can't work with such noise at work, even my son said it felt like after 30 minutes the bottom got very HOT on his lap. I am going to have to return this fan, maybe they did not use good thermal paste, but it is so thin the fans are all on the bottom and side too noisy, unless I got a new lemon?",
      "rating": "3"
    },
    {
      "title": "Must Buy",
      "body": "Overall the laptop looks and feels premium.\nExcept for the Processing speed everything works great.\nThe battery life is exceptional too.  Getting around 8-10 hours on mild usage",
      "rating": "5"
    },
    {
      "title": "Good Computer for the Money spent",
      "body": "Lighter than the old one.  Combination mouse and touch screen, starts quickly and works well.",
      "rating": "4"
    },
    {
      "title": "Great laptop",
      "body": "Easy to set up and easy to use.  Just the right size for what my needs are and have been very pleased with my HP Envy.  It was recommended to me by a person who owns several and uses them for their business.",
      "rating": "5"
    },
    {
      "title": "Nice Laptop",
      "body": "All the features I need in a nice compact yet powerful laptop",
      "rating": "5"
    },
    {
      "title": "Good size & light weight.",
      "body": "Nice . Good speed for my day to day work. Can be use like a tab as well but bigger size.",
      "rating": "5"
    },
    {
      "title": "Perfect size and functions!",
      "body": "I love this laptop,  is fast and well designed! I recommend this computer.",
      "rating": "5"
    },
    {
      "title": "Great for the aging user.",
      "body": "I needed a smaller, lighter weight laptop.  As I age my sight is getting more challenging and the ability to adjust size and boldness is more important than ever.  This computer addresses each of those problems perfectly.",
      "rating": "5"
    },
    {
      "title": "HP - Envy - Works for me.",
      "body": "Easy to use and comes with Windows 11.  Light weight.",
      "rating": "5"
    },
    {
      "title": "excellent",
      "body": "This laptop is ideal for professionals and students looking for a balance of performance and portability. It excels in everyday multitasking and media work, but power users might need to carry a charger for long sessions.",
      "rating": "4"
    },
    {
      "title": "Great laptop for the price.",
      "body": "Excellent laptop for the price. I purchased on sale, and honestly it’s more than I need, but for the price, I love it. Great picture quality and love that it has a touch screen. It’s a bit heavier than I would like, which is the only reason I didn’t give it 5 stars. Great for at home personal use.",
      "rating": "4"
    },
    {
      "title": "Just as good as new!",
      "body": "Bought this laptop as open box and the condition was excellent!!\n\nEverything worked as described.   \n\nMust faster than my old Toshiba laptop!",
      "rating": "5"
    },
    {
      "title": "HP Laptop",
      "body": "Absolutely the best laptop I have owned. I love that it is up to date, folds back to use as a tablet, and has touch screen capabilities.\nI have access to everything I need at incredible speed!",
      "rating": "5"
    },
    {
      "title": "Love the small but powerful lap top",
      "body": "I’ve been very happy.  Small but powerful enough for everything you need to do. I love the fold back feature to work as an iPad and the touchscreen!",
      "rating": "5"
    },
    {
      "title": "Great laptop",
      "body": "Ez to use.  Perfect for college needs.  Meets and exceeds expectations.",
      "rating": "5"
    },
    {
      "title": "Total Satisfaction",
      "body": "Great mid-level computer for those kids in college and high school.  Touch Screen makes it very simple to operate as well.",
      "rating": "5"
    },
    {
      "title": "My new HP Laptop",
      "body": "I’m definitely enjoying this laptop. It connects fast and is light to the touch. I love the way the keys light up and the touch screen. I’v come a log way from my 10 year old laptop.",
      "rating": "5"
    },
    {
      "title": "Nice laptop!!!!",
      "body": "This laptop look very nice and the screen looks better than my Chromebook I use to have.",
      "rating": "5"
    },
    {
      "title": "Hp Envy 2-in 1 14\" laptop",
      "body": "This Hp Envy 2-in 1 14\" laptop is a strong contender for anyone looking for a versatile and well-rounded laptop that can handle everyday tasks and more. It offers a great combination of performance, battery life, and portability, making it a top choice for both students and professionals. I highly recommend to anyone to get . Than you.",
      "rating": "5"
    },
    {
      "title": "Good Product",
      "body": "Runs fast, using for a diagnostic computer and the touch screen is a nice feature.",
      "rating": "5"
    },
    {
      "title": "Should buy for daily tasks",
      "body": "This is a amazing laptop from hp works good for day to day life and battery backup is so good",
      "rating": "5"
    },
    {
      "title": "Nice laptop",
      "body": "I'm pretty much a basic user email social media and a little bitof web surfing and some shopping. I was able to load my accounts in without any problems. It's quick responds immediately plus the lighted keyboard is very nice. I like it and I believe you will too",
      "rating": "5"
    },
    {
      "title": "Great to school use.",
      "body": "I give this HP Envy laptop a 4 star. I love this product, this is light weight with a sharp screen.  I bought this for my daughter to have to use for school assignments. This HP Envy laptop offers just the right amount of specification needed for just that use.",
      "rating": "4"
    },
    {
      "title": "Perfect for Modern Office",
      "body": "I've bought these for my entire staff - they have all the power/capabilities we could ever need with the added benefit of mobility between offices and conference rooms (or travel outside of the office).  The screen is a great size, especially when combined with a second monitor in the office, and the touchscreen is very handy for drawing diagrams/handwriting notes/highlighting documents.",
      "rating": "5"
    },
    {
      "title": "Great product",
      "body": "I have never had a laptop. The gentleman at store recommended this one. Well i really like it.",
      "rating": "5"
    },
    {
      "title": "Nice to travel with.",
      "body": "for some reason this computer would not let me install my 2013 Office.  So I am using Open Office. I refuse to pay for Office. This computer is easy to carry.",
      "rating": "4"
    },
    {
      "title": "Great computer",
      "body": "Excellent laptop, loaded with Microsoft 365 so I have everything I need",
      "rating": "5"
    },
    {
      "title": "Computer",
      "body": "Nice computer , just exactly what I need and easy for beginners for touch screen",
      "rating": "5"
    },
    {
      "title": "It’s fine but more annoying than I expected",
      "body": "I thought applications would open quicker. It’s annoying to type because the cursor moves around the document. The silver metal gets fingerprints easily. The computer makes weird noises. The computer exits the window when I scroll using the touch pad.",
      "rating": "3"
    },
    {
      "title": "Laptop",
      "body": "Great laptop. Works fast havent has no problems woth it",
      "rating": "5"
    },
    {
      "title": "Amazing quality and speed",
      "body": "I liked everything about this model, but my favorite is the touch screen feature.",
      "rating": "5"
    },
    {
      "title": "Happy Fingers",
      "body": "Love the new HP Envy, great purchase.  User friendly!",
      "rating": "5"
    },
    {
      "title": "Worth it!",
      "body": "Convenient size...easy set up.  Happy with my purchase.",
      "rating": "5"
    },
    {
      "title": "Easy to use",
      "body": "This computer is easy to use , lightweight it’s a touchscreen so I can fold it in half and just use the touchscreen and put the keyboard behind it",
      "rating": "5"
    },
    {
      "title": "Laptop",
      "body": "Great product. Dependable and easy to use. \nWould def recommend.",
      "rating": "5"
    },
    {
      "title": "Laptop",
      "body": "Easy to use and good quality. Nice to have to do my schoolwork",
      "rating": "5"
    },
    {
      "title": "The Stellar Performer",
      "body": "From the moment I unboxed the HP-Envy 2, I knew I was in for a treat. This isn't just another laptop; it's a thoughtfully designed powerhouse that blends performance, aesthetics, and user experience. After several weeks of rigorous testing, I can confidently say the HP-Envy 2 has become my go-to device for both work and play.",
      "rating": "5"
    },
    {
      "title": "Nice laptop",
      "body": "Great laptop, easy to use, nice size screen and touch screen as an added benefit.",
      "rating": "5"
    },
    {
      "title": "Great Machine for a Great Price",
      "body": "Great little laptop! I am still getting used to Windows 11 but using this machine is easy. I do love having the touch screen feature. It does what I need it to do which is mostly some office stuff and movies.",
      "rating": "5"
    },
    {
      "title": "Compact",
      "body": "The best compact laptop easy to handle the speed is awesome don’t need a mouse",
      "rating": "5"
    },
    {
      "title": "Great product",
      "body": "I have had this laptop for few months now and to be honest it’s the best I had so far. It’s the perfect size and does the job well. I am a student and it’s being so good so far with the price it’s worth it",
      "rating": "5"
    },
    {
      "title": "Laptop for college",
      "body": "Very fast and efficient. Amazing clarity. Great touch screen sensitivity too. I love it and highly recommend! It's worth every cent!",
      "rating": "5"
    },
    {
      "title": "Great laptop",
      "body": "Nice and smooth, easy to use with the keyboards to type",
      "rating": "5"
    },
    {
      "title": "Loved it",
      "body": "Love the laptop. The designar is crear, is so light. Great security features for the price.",
      "rating": "5"
    },
    {
      "title": "Great little laptop!",
      "body": "The laptop is a welcome upgrade to my old chromebook and the touchscreen along with lighted keyboard and faster speeds are exactly what I was looking for. It is a basic laptop for home or even schoolwork, ai believe there is also a pen you can use for it too. The battery is also very good, after initial charge, I’ve used it off and on for about 5 days without a charge. Sound and brightness are also pretty good.",
      "rating": "5"
    },
    {
      "title": "Honest review.",
      "body": "Nice laptop. Great screen.  I wish you could purchase devices with no junk programs and games.  Im tired of them taking up valuable memory, slowing the system and wasting my time.  If I need it, I'll go get it and load it.  I'd pay $10 extra to purchase a computer without junk embedded in it.  Are you listening HP, Dell, Best Buy etc.?",
      "rating": "5"
    },
    {
      "title": "Great Computer",
      "body": "I would absolutely recommend this computer.It is fast and reliable. Word and powerpoint works like a dream.It also worke well with low bit gaming.It is a great computer!",
      "rating": "5"
    },
    {
      "title": "Good for college.",
      "body": "Perfect laptop for college. Its a decent size, fast, and works great.",
      "rating": "5"
    },
    {
      "title": "New laptop",
      "body": "So far I like it better than my desktop very user-friendly",
      "rating": "5"
    },
    {
      "title": "Review",
      "body": "Really great laptop for the price! I was suprised!",
      "rating": "5"
    },
    {
      "title": "HP Envy",
      "body": "I've gone through 3 laptops. HP isn't the greatest, customer service is horrible when seeking clarity for why the laptops stop working after 2 months or why the screen crashed the day I took home. Meanwhile it gets the job done, touch screen is nice, works ok with the stylist and easy to travel with.",
      "rating": "2"
    },
    {
      "title": "Wanda",
      "body": "It does everything that I bought it for. Has audio for video watching, light weight and easy to use.",
      "rating": "5"
    },
    {
      "title": "Best Buy store support",
      "body": "Laptop is very good, as I expected. But I was most pleased with the friendly and professional way that I was treated the young gentleman that helped me with my purchase . I wish I had his name; he was absolutely FREAT!",
      "rating": "5"
    },
    {
      "title": "HP Laptop",
      "body": "Laptop is durable, excellent speed, good battery life and the grey colour is awesome",
      "rating": "5"
    },
    {
      "title": "My new HP",
      "body": "I've always been a HP person but this knocked my socks off. I did my own onboarding and it all went seemlessly. Hooked to my printer in less than 5 minutes. HP, you never cease to make me happy!",
      "rating": "5"
    },
    {
      "title": "My New Computer",
      "body": "Easy and great to use!  Simple to understand.  Love the size because before we had a giant computer.",
      "rating": "5"
    },
    {
      "title": "Great touch-screen feature!",
      "body": "This laptop is the most requested by college students. They love the touch-screen feature. I always purchase it as a gift for students because it will be useful for them.\nUna Daniels-Edwards",
      "rating": "5"
    },
    {
      "title": "Ms.",
      "body": "The computer is very light and easy to manage. It has a great screen with sharp colors.",
      "rating": "5"
    },
    {
      "title": "Nice laptop",
      "body": "Nice feel, speed and great price. Glad  I bought this one!",
      "rating": "4"
    },
    {
      "title": "Recommend",
      "body": "Works great, its efficient, serves the purpose. Its light to carry around",
      "rating": "5"
    },
    {
      "title": "Happy with HP",
      "body": "My son is very happy with his new hp laptop .  The best things are the lighted keyboard and it’s touchscreen feature.  So far so good with its quality.",
      "rating": "5"
    },
    {
      "title": "HP Envy is an excellent choice",
      "body": "This laptop is great! Super lightweight and the touch screen is very convenient.",
      "rating": "5"
    },
    {
      "title": "☆Great Laptop",
      "body": "I Bough these for my 2 son's as a Graduation gift. It was the perfect gift idea. I also have the vlack one. The graphics are worth it. Happy with my purchases.",
      "rating": "5"
    },
    {
      "title": "Perfect computer upgrade!!",
      "body": "Perfect computer for an aging individual. I needed an upgrade from an older HP computer that had been upgraded to run the windows 10 software and it struggled to do much of anything. This computer has a fast startup, quick internet access, setup was a breeze.",
      "rating": "5"
    },
    {
      "title": "amazing",
      "body": "I love is excellent laptop  ,the touch screen makes everything perfect",
      "rating": "5"
    },
    {
      "title": "no complaints on this one!",
      "body": "light weight, fast and easy to navigate. highly recommend.",
      "rating": "5"
    },
    {
      "title": "Practical and eficient!",
      "body": "It's great! It's very practical thanks to its size and it works very well.",
      "rating": "5"
    },
    {
      "title": "Laptop",
      "body": "Great sound. Great picture quality. Touch screen. an amazing basic laptop",
      "rating": "4"
    },
    {
      "title": "HP-Envy 2-in-1 14\" full HD touch screen laptop",
      "body": "It's always a challenge when you purchase a new laptop with transfering files and learning how to use the new computer.  The GeekSquad has been helpful but I have had to go in 3 times purchased a new Quicken program and now it says that my Quicken has expired. Very frustrating,",
      "rating": "4"
    },
    {
      "title": "Nice and good laptop",
      "body": "It’s a very good laptop that even my son uses it and also it is very reliable and useful and it never loses charge when it’s closed.",
      "rating": "5"
    },
    {
      "title": "HP ENVY",
      "body": "This HP Envy is just the right size for travel ,Being a bus driver with a lot of down time , watching movies , playing games , ect.",
      "rating": "5"
    },
    {
      "title": "HP Envy",
      "body": "It is working great. It was a super easy transition from my previous HP that I broke the cord input. I just had to log into my microsoft One Drive and it all effortlesly transferred over!!!",
      "rating": "5"
    },
    {
      "title": "Decent",
      "body": "Good laptop overall, couldn't upgrade ram or storage tho",
      "rating": "4"
    },
    {
      "title": "Overall satisfied with this laptop",
      "body": "Enjoying the laptop so far. Its a little heavier than I like but everything else is great. It's got touch screen and handles most task pretty well. happy with the purchase.",
      "rating": "5"
    },
    {
      "title": "Envy Review",
      "body": "Good size, and works very quickly. This sturdy laptop makes it great for school.",
      "rating": "5"
    },
    {
      "title": "Hp laptop",
      "body": "I loved my HP laptop I purchased. Perfect size, lightweight and friendly user.",
      "rating": "5"
    },
    {
      "title": "A good computer",
      "body": "I love this pc for everyday basis, it don’t overheat and it’s quite fast! I bought it because I can do iPad things and computer things both at once",
      "rating": "5"
    },
    {
      "title": "Good value",
      "body": "Small size. Light weight. Powerful for what I need to do.",
      "rating": "5"
    },
    {
      "title": "Solid, Easily Transportable Laptop",
      "body": "I have had this laptop now for 2 years. Within the first couple of months had a battery issue but I was able to get a new one sent and replaced. Since then it has worked well as a slim and easily transportable laptop. I am not used to the smaller screen size, but it makes up for it in nice display and graphics. For the specs it runs my game (sims 4) very well, it's snappy and doesn't lag.",
      "rating": "4"
    },
    {
      "title": "I would buy it again",
      "body": "Good quality, easy to download files, lots of storage. It’s very light weight to carry around, you can connect your phone to it. I love it so much I would buy it again or recommend it to anyone I love,",
      "rating": "5"
    },
    {
      "title": "HP Envy 2 in 1",
      "body": "I bought this laptop for my niece and she loves it. I also have one myself and I am able to do everything I need such as school, meetings, work, etc.",
      "rating": "5"
    },
    {
      "title": "Mr Davis review",
      "body": "I am totally satisfied with his laptop. I can do music production and also game on it at such a beautiful screen. I love the fact that it’s touchscreen and you can also use it as a tablet. It has so many uses and so many great advantages. This is a good product here. I am satisfied",
      "rating": "5"
    },
    {
      "title": "I Love It",
      "body": "I really love my new laptop. For the price it is pretty decent. If you’re thinking if you should get this right now please do u won’t regret it",
      "rating": "5"
    },
    {
      "title": "Pretty good computer for its price",
      "body": "Its a pretty good computer for classwork while also being small and not to big. Has great battery life it went 10 hours with no charge",
      "rating": "4"
    },
    {
      "title": "Awesome and versitile computer.",
      "body": "The tablet mode is perfect when you meed to conserve space. The desktop rotates to match the direction of the screen without having to change settings. The screen image is super clear. It starts up and operates quickly, and the fingerprint scanner makes login so simple.",
      "rating": "5"
    },
    {
      "title": "Great for students",
      "body": "I bought this for school as an incoming freshmen. I would definitely recommend! Affordable, lasts all day on an average use but obviously if you’re using it more the battery life does fall short. Sound is good. Compatible with all systems used in class compared to other devices I seen my peers using.",
      "rating": "5"
    },
    {
      "title": "Great Buy",
      "body": "I just love it easy touchable screen clear and sharp picture I would recommend anyone looking to buy this model",
      "rating": "5"
    },
    {
      "title": "Abdulkath",
      "body": "Very nice product and very economical.me and my daughter use  this one.we are 100 present satisfied.So any body want to buy for personal use but it.",
      "rating": "5"
    },
    {
      "title": "Great little laptop",
      "body": "I cant really say much about it my self,for it was a gift but my wife really likes it. She use it a lot with are 6 month old its light and being 2 in 1 shes able to do what ever she need to do if its streaming videos or her spread sheets surfing the web down to watching Mickey mouse club its a great little laptop.",
      "rating": "5"
    },
    {
      "title": "HP",
      "body": "Light in weight. Batter is great. Looks v elegant.",
      "rating": "5"
    },
    {
      "title": "Purchase review",
      "body": "Associate was a big help, offered honest opinion based on my need.  Seemed like a great value. Smaller screen than planned, but the value outweighed the size.",
      "rating": "5"
    },
    {
      "title": "Mr",
      "body": "This is one of the laptop i ever got,even the screen is superb",
      "rating": "5"
    },
    {
      "title": "A real bargain",
      "body": "The deal was too good to pass up! Very nice laptop at a super price.\nOnly 1 flaw; the RAM is onboard and can not be upgraded.",
      "rating": "5"
    },
    {
      "title": "Excellent laptop",
      "body": "Excellent laptop for college student.. Bought this for my sons machineist classes and he loves it.",
      "rating": "5"
    },
    {
      "title": "Good buy",
      "body": "So far so good was actually impressed. Awesome price and size.",
      "rating": "5"
    },
    {
      "title": "Great Laptop",
      "body": "It works great! The fingerprint scan is super convenient and the laptop always works really fast.",
      "rating": "5"
    },
    {
      "title": "Love it!",
      "body": "I really like this computer.  Nice sized screen.  Light weight.  Is a 2 in one.  Good price.  Cord isn’t too big.  Just wish it had a smoother keyboard and touch pad  touch.",
      "rating": "4"
    },
    {
      "title": "Great laptop",
      "body": "Overall great laptop I bought it for school work and the screen is touchscreen it is an awesome laptop for watching movies and doing homework!!",
      "rating": "5"
    },
    {
      "title": "Very happy so far",
      "body": "Really happy with my laptop but it does run pretty warm after a short time editing pic/videos for my job.",
      "rating": "4"
    },
    {
      "title": "Great aall around computer",
      "body": "Its a great laptop and very us to navigate. The quality is nice with the silver finish.",
      "rating": "5"
    },
    {
      "title": "Great computer at a great deal",
      "body": "Bought this for my daughter cuz her old 1 was windows 8 n failing horribly. Got this at a great deal n she says it super fast and reliable.",
      "rating": "5"
    },
    {
      "title": "Terrific machine",
      "body": "Amazing device. Perfect for the PC applications class that my college kid is taking this fall. If only other computer companies would do the touch screen with the full size keyboard.",
      "rating": "5"
    },
    {
      "title": "Happiness lends you into success",
      "body": "Very happy and useful to what I purchased! A big help in what I’m doing at present",
      "rating": "5"
    },
    {
      "title": "VERY PLEASED!",
      "body": "So far, i am very pleased with my hp envy.  The size is perfect. I keep forgetting to use touchscreen but I like having the option.",
      "rating": "5"
    },
    {
      "title": "Hp computer",
      "body": "this computer is the best, I have used it every day since I bought it. No issue with it. I recommend it for anyone.",
      "rating": "5"
    },
    {
      "title": "Computer",
      "body": "Comfortable size.  Good memory,  Easy to use.  I am very happy with this computer.  Excellent graphics.  You will like it too!",
      "rating": "5"
    },
    {
      "title": "Pretty good better than my old HP",
      "body": "I love the laptops that flip into tablets so when I saw this one I had to have it! 2 months in I wish it were a little louder but over it's a pretty good computer",
      "rating": "5"
    },
    {
      "title": "Computer",
      "body": "Nice computer and very easy to use.. It’s a personal computer was able to download a lot on this computer.",
      "rating": "5"
    },
    {
      "title": "New HP",
      "body": "The new HP laptop I bought for my wife seems to have everything she will need to get started with the writing projects she's hoping to accomplish. She is looking forward to figuring out her shiny new computer.",
      "rating": "5"
    },
    {
      "title": "Excellent laptop",
      "body": "Excellent laptop! Everything loads quickly and updates fast. The battery could be better.",
      "rating": "5"
    },
    {
      "title": "Review",
      "body": "Really good laptop. Perfect size, love that it’s touchscreen",
      "rating": "5"
    },
    {
      "title": "Great for college students",
      "body": "Very good for school and small projects (that’s all I’ve used it for) really love that it’s a 2 in 1, definitely would recommend for a college student!",
      "rating": "5"
    },
    {
      "title": "Best Choice!",
      "body": "Beautiful slerk design wiyh all the needed features and power.  Love that it's convertible and is the number one choice for other nurses and professionals in my field.  Would buy it again in a heartbeat!",
      "rating": "5"
    },
    {
      "title": "Great computer",
      "body": "I just got it to watch YouTube, shop, and occasionally play girlypop games on. Its great, but my only complaint is that for some reason, the volume doesnt get very loud at all.",
      "rating": "4"
    },
    {
      "title": "Buy this product!",
      "body": "Amazing product! HP did not disappoint as this is versatile and very good quality. Perfect size",
      "rating": "5"
    },
    {
      "title": "Very good laptop",
      "body": "Good laptop at affordable price. I would definitely recommend it.",
      "rating": "5"
    },
    {
      "title": "HO",
      "body": "I just need something small and fast for work tasks, and the bestbuy deals gave me a HP that was a great help",
      "rating": "5"
    },
    {
      "title": "Envious Laptop!",
      "body": "Nice touch screen laptop and a budget price!  Purchased during Christmas sale time.",
      "rating": "5"
    },
    {
      "title": "Laptop perfection!",
      "body": "This laptop is overall a great laptop. From the design to the processing efficiency. A must buy.",
      "rating": "5"
    },
    {
      "title": "New computer .",
      "body": "It is very easy to get on the intern now and I like the way you can get off. The people at the store were excellent at explaining the net computer to me as",
      "rating": "5"
    },
    {
      "title": "Good, General Purpose Laptop",
      "body": "This is a good, general purpose laptop for everyday use.  It does what I need it to do.  However, the battery life is no where near to what is advertised.  And this is for general use, not gaming or high energy consumption activities.",
      "rating": "4"
    },
    {
      "title": "Great laptop ! You",
      "body": "Perfect for me during my retirement years ! Super easy set up by The Geek Squad at Best Buy store.",
      "rating": "5"
    },
    {
      "title": "New",
      "body": "Easy to set up and no hassle must have. Leaving a review",
      "rating": "5"
    },
    {
      "title": "Love my laptop!",
      "body": "I love my HP Envy laptop. It is so convenient and easy-to-use!",
      "rating": "5"
    },
    {
      "title": "New PC",
      "body": "Easy to use, display super crisp and clear. Opens fast",
      "rating": "5"
    },
    {
      "title": "HP Envy",
      "body": "Perfect size and functionality. Touch screen a bonus.",
      "rating": "5"
    },
    {
      "title": "Nice",
      "body": "Good product, good to buy charging to good reasonable",
      "rating": "5"
    },
    {
      "title": "Electronice",
      "body": "This computer very excellent product  i like too much",
      "rating": "5"
    },
    {
      "title": "Replacement",
      "body": "The reason for the purchase was to replace my existing laptop that broke. So far, I am satisfied.",
      "rating": "5"
    },
    {
      "title": "Laptop",
      "body": "I’ve had no issues this far with the laptop so far so good perfect for what I needed",
      "rating": "5"
    },
    {
      "title": "2 in 1 laptop good for just surfing",
      "body": "Great two in one for an average surfer or  movie watcher. The low amount of RAM it is not a good choice for gaming or any heavy multitasking applications. The ram is not upgradable since it is Saturday on the board.",
      "rating": "3"
    },
    {
      "title": "New Laptop 4 Grandma",
      "body": "I am familiar with HP products because I use them in my job.  HP has always been dependable and reliable and easy to use.  I also have an HP Envy Photo Printer 7855 that easily synced with the new laptop.",
      "rating": "5"
    },
    {
      "title": "HP Envy Laptop",
      "body": "Really love this laptop. Great laptop for school and everyday tasks. Laptop is lightweight.",
      "rating": "5"
    },
    {
      "title": "Great lightweight touchscreen!",
      "body": "Great, lightweight touchscreen. Perfect for my kid to do his homework and write essays.",
      "rating": "5"
    },
    {
      "title": "New laptop, great investment",
      "body": "We had to purchase a new laptop unexpectedly, and this was a good value for a good product that has been reliable.",
      "rating": "5"
    },
    {
      "title": "Compact, light, computer, works well, so far..",
      "body": "I think it impossible to give a valid review after a month or so usage. So far, everything is working well. Easy to use, has plenty of bells and whistles, certainly enough to for me. But I am not using it for business or gaming. I use it for news, communication, etc. I gave it a 'good' because so far I have had not had any problems.",
      "rating": "4"
    },
    {
      "title": "HP",
      "body": "Great everyday casual work or home laptop for everyday use such as movies, streaming and work calls",
      "rating": "5"
    },
    {
      "title": "Great buy",
      "body": "Great product. Love the touch screen feature. Keyboard and products work well.",
      "rating": "5"
    },
    {
      "title": "Love this computer",
      "body": "Perfect size and Best Buy made it so easy to have everything transferred from old computer.",
      "rating": "5"
    },
    {
      "title": "10/10",
      "body": "Perfect for students! Really good price and 2 in one computer/ laptop",
      "rating": "5"
    },
    {
      "title": "HP Envy",
      "body": "So far it is holding up well. This is the second time purchasing this laptop/",
      "rating": "5"
    },
    {
      "title": "Laptop",
      "body": "Excelent purchase of a laptop hp.  Good price!  Complete satisfied!!!",
      "rating": "5"
    },
    {
      "title": "Perfect!!!",
      "body": "We were looking for a 2 in 1 laptop and this is perfect! The price we paid for it was during the 4th of July Black Friday and was quite competitive! Excellent product!!",
      "rating": "5"
    },
    {
      "title": "Best Price",
      "body": "Nice laptop for the price, price beat the same laptop listed by Amazon",
      "rating": "5"
    },
    {
      "title": "Very Good",
      "body": "Laptop looking very good and working nicely.Battery percentage is also good",
      "rating": "5"
    },
    {
      "title": "Perfect for School work",
      "body": "Excellent for school work, and the fact that it can fold up into a tab",
      "rating": "5"
    },
    {
      "title": "Perfect Laptop for Daily Use!",
      "body": "Perfect laptop for those who need it for writing and research. It works well and is super lightweight! The tablet option is perfect for when I am doing Bible study or when I am watching videos!",
      "rating": "5"
    },
    {
      "title": "Awesome!",
      "body": "Love this laptop! It is very durable and lightweight at the same time! The quality is amazing! And I love the two in one as it is more versatile for my school and personal use! Would definitely recommend",
      "rating": "5"
    },
    {
      "title": "Great product",
      "body": "Good look and works great. It is heavier than I expected.",
      "rating": "5"
    },
    {
      "title": "Best thing ever",
      "body": "I love it the fact I can use it as a laptop but also a tablet is super convenient. Would recommend for any college student",
      "rating": "5"
    },
    {
      "title": "Good purchase",
      "body": "I bought this as open box (rated excellent). It seems it was never touched. I love the performance and dependability of the last HP. So far this past week, I’m enjoying the newer features.",
      "rating": "5"
    },
    {
      "title": "Touch-Screen feature",
      "body": "I like the Touch-Screen feature which is very convenient, especially when my 5-year old granddaughter wants to explore something on this laptop.",
      "rating": "5"
    },
    {
      "title": "Reasonable cost",
      "body": "Laptop is best one I bought in the recent days for the reasonable price",
      "rating": "5"
    },
    {
      "title": "Good Device",
      "body": "Very good device, met all expectations, very compact and very fast, so we are very happy with the purchase.",
      "rating": "5"
    },
    {
      "title": "Multi-functional & fast",
      "body": "This laptop is perfect for what I need, which is basic functionality for MS products and some entertainment. The touchscreen/tablet feature is really useful when online shopping and streaming shows!!",
      "rating": "5"
    },
    {
      "title": "Laptop good",
      "body": "Excellent laptop. Got it from black Friday and this is runny well",
      "rating": "5"
    },
    {
      "title": "HP ENVY x360 Laptop",
      "body": "So far I have really enjoyed this laptop.  Main reason for not giving 5 stars is more of a personal issue as when typing I often bump the mouse pad and inadvertainly move the mouse.   The display is awesome.  Response time is very good.",
      "rating": "4"
    },
    {
      "title": "Computer",
      "body": "The computer is great. It’s touchscreen it folds and charging ability is great",
      "rating": "5"
    },
    {
      "title": "Computer",
      "body": "Good computer, has everything i was looking for!!!",
      "rating": "5"
    },
    {
      "title": "Great laptop for the price",
      "body": "Runs excel well. Great for business students ona budget",
      "rating": "5"
    },
    {
      "title": "Best day to day laptop",
      "body": "Best compact light weight laptop at a very reasonable rate.",
      "rating": "5"
    },
    {
      "title": "Great laptop",
      "body": "I bought it for schoolwork and every day use, I love it.",
      "rating": "5"
    },
    {
      "title": "Laptop",
      "body": "Cheapest and good laptop good battery health and fast to",
      "rating": "5"
    },
    {
      "title": "Highly recommend",
      "body": "I love it! Simple and easy, gets the job done. Great for first time laptop owners!",
      "rating": "5"
    },
    {
      "title": "5/5 stars",
      "body": "I really like it! It’s amazing. I particularly like the battery life. I can do my work, take phone calls, and send messages all from my laptop. I would recommend others to get it.",
      "rating": "5"
    },
    {
      "title": "Laptop",
      "body": "My laptop i so fast i could do anything i want . I really enjoy it",
      "rating": "5"
    },
    {
      "title": "2 in 1 laptop",
      "body": "Great laptop for college students. Light weight and easy to carry.",
      "rating": "5"
    },
    {
      "title": "Unbelievable performance",
      "body": "Wonderful laptop. Highly recommend it for anyone looking for a reliable laptop for a long time.",
      "rating": "5"
    },
    {
      "title": "Very light and nice",
      "body": "Very nice. No word or excel. Not a full keyboard,  numbers on top. Otherwise great!",
      "rating": "4"
    },
    {
      "title": "Hp",
      "body": "Bought it for my wife to do her school work and she absolutely loves it. Great for the price.",
      "rating": "5"
    },
    {
      "title": "Great laptop",
      "body": "Love this laptop!! It’s the perfect size, I can carry it with me everywhere and it’s 2-in 1 feature really comes in handy",
      "rating": "5"
    },
    {
      "title": "Amazing laptop for my brother",
      "body": "My brother is working on his GED and I got him this laptop during Black Friday. He loves it, it works amazingly!",
      "rating": "4"
    },
    {
      "title": "Laptop",
      "body": "I bought this laptop for my business and it was great for the price.",
      "rating": "5"
    },
    {
      "title": "HP Laptop",
      "body": "HP Laptop is heads and shoulders over DELL and the other manufacturers.",
      "rating": "5"
    },
    {
      "title": "New pc",
      "body": "Ea little amaller than i expected but now that im learning all the features its turning out to be a good litrle computer",
      "rating": "5"
    },
    {
      "title": "Get it!",
      "body": "awesome. amazing quality. worth the price. perfect system for my daily needs,",
      "rating": "5"
    },
    {
      "title": "new lap top",
      "body": "ordered in the evening on line and picked it up the next day with all data transfered from my old PC by 2 the next day",
      "rating": "5"
    },
    {
      "title": "No Frills Back to School Tool",
      "body": "Lightweight and compact, perfect for school. Sturdy aluminum case, and backlit keys, made for dorm and lecture hall.",
      "rating": "5"
    },
    {
      "title": "Best Buy is A+ for service and sales",
      "body": "Best Buy did a wonderful job at ordering my new HP Envy laptop. I ordered online and picked it up the next day. I've bought a variety of things here and everything went great. Between the in-store service and online activity, I'll be shopping here again.",
      "rating": "5"
    },
    {
      "title": "Stunning Laptop",
      "body": "the product is too good. really enjoyed it. I have been using this for around 6 months and this was true value for money.",
      "rating": "5"
    },
    {
      "title": "La mejor",
      "body": "Excelente laptop, la utilizo a diario muy rapida,  muy reco.endada",
      "rating": "5"
    },
    {
      "title": "Hp Envyx360",
      "body": "I am totally impressed by this HP. Thank you.  Runs so smooth. Touch screen. Love it. ♥️",
      "rating": "5"
    },
    {
      "title": "Nice Laptop",
      "body": "I bought this laptop this months and I had one before. I gifted this to someone cause it’s really affordable when you are new commer in US.",
      "rating": "5"
    },
    {
      "title": "HP Laptop",
      "body": "Love my HP laptop. I had to buy a new one. Light weight. Easy to use and set up. Customer service was excellent. I consider Best Buy my Harley Shop.",
      "rating": "5"
    },
    {
      "title": "Low cost-high value",
      "body": "A good value, and because of my Total Membership, it was discounted on a particular day and I was able to buy it on sale.  Easy to set up and use, even for a beginner.",
      "rating": "5"
    },
    {
      "title": "Laptop",
      "body": "Great product.display is nice and spied is great!!",
      "rating": "5"
    },
    {
      "title": "Laptop purchase",
      "body": "It's a good purchase, my kid likes it very much. It works perfectly for his school homework",
      "rating": "5"
    },
    {
      "title": "Laptop computer",
      "body": "The laptop is a reliable computer. It will be used to replace an Windows 10.",
      "rating": "5"
    },
    {
      "title": "Hp Laptop",
      "body": "I love! I also got it 200 off. It turns into a tablet and is also touching screen. I was scared it would be flimsy with it being foldable but it’s very durable.",
      "rating": "5"
    },
    {
      "title": "Hp Laptop",
      "body": "This is a good product . I ‘ m satisfied , I can recommand friends",
      "rating": "5"
    },
    {
      "title": "Lab Top",
      "body": "Very nice lab top thats not overpriced. Size is nice too. Perfect for what i use it for.",
      "rating": "4"
    },
    {
      "title": "Laptop",
      "body": "Laptop is great for children between middle and HS",
      "rating": "5"
    },
    {
      "title": "Value for money",
      "body": "Very good laptop. Only concern about the memory, unnecessary 70 GB of memory is old by system.",
      "rating": "4"
    },
    {
      "title": "HP Envy 360 14\"",
      "body": "I am very happy with my new laptop. HP Envy 360  14\"",
      "rating": "5"
    },
    {
      "title": "Good laptop",
      "body": "Good for school use and so far no problems seen or found.",
      "rating": "5"
    },
    {
      "title": "Computer",
      "body": "Great product and easy to use. I highly recommend it",
      "rating": "5"
    },
    {
      "title": "Awesome laptop",
      "body": "It’s not a top of the line laptop but it’s still fast.  Having the ability to convert into a tablet is a huge plus and ideal for my kids.  I have no complaints.",
      "rating": "5"
    },
    {
      "title": "College laptop",
      "body": "This is an out standing product! It’s very reliable and easy to set up. Given that I am a college student, it has provided me with everything I would need and more! 10/10",
      "rating": "5"
    },
    {
      "title": "HP Envy × 360 Laptop",
      "body": ". I really like it. I recommended it to any one looking for  Great tool to work.",
      "rating": "5"
    },
    {
      "title": "Sandy",
      "body": "Pleased with performance, speed and accessibility.  The battery remained charged throughout my usage time.\nThank you",
      "rating": "5"
    },
    {
      "title": "HP laptop",
      "body": "Excellent product! Just what I need for my small business.",
      "rating": "5"
    },
    {
      "title": "HP",
      "body": "Great computer at a great price.  Service was excellent.",
      "rating": "5"
    },
    {
      "title": "Great device",
      "body": "Great device great service from bestbuy for helping choose the right product",
      "rating": "5"
    },
    {
      "title": "Perfect value for quality",
      "body": "Excellent product, exactly what I was looking for, perfect value for quality",
      "rating": "5"
    },
    {
      "title": "Absolutely Great!",
      "body": "this product is top grade. The service was outstanding!!",
      "rating": "5"
    },
    {
      "title": "VERY PLEASED",
      "body": "VERY EASY TO CONNECT TO INTERNET SERVER\nSTILL GETTING USE TO IT VERY SENSITIVE TO TOUCH COMPARED TO MY OLD COMPUTER SO FAR EVERYTHING IS GREAT VERY FAST",
      "rating": "5"
    },
    {
      "title": "A great tool for our family",
      "body": "This device has been a great tool for our family. It’s fast it’s reliable, The computer holds charge a lot longer than I thought it would.",
      "rating": "5"
    },
    {
      "title": "Lupe",
      "body": "It’s awesome!! Perfect for my DJ business. Easy to use. I like the longer battery life and storage space.",
      "rating": "5"
    },
    {
      "title": "6",
      "body": "Good I like to much , my friend recommended it to me",
      "rating": "5"
    },
    {
      "title": "Decent",
      "body": "I bought this computer for college and it definitely was the right choice. This computer is very pretty and easy to use.",
      "rating": "4"
    },
    {
      "title": "Great price",
      "body": "Great price and laptop running with no issues. Easy to set-up",
      "rating": "5"
    },
    {
      "title": "Students Laptop",
      "body": "Works perfectly, great screen graphics. Touch screen is responsive and does not blur.",
      "rating": "5"
    },
    {
      "title": "Laptop",
      "body": "Perfect size, runs smoothly, easy to use! Ideal for students and adults.",
      "rating": "2"
    },
    {
      "title": "Great buy",
      "body": "This was an excellent deal and I thoroughly enjoy my new laptop. Good speed in booting up and love the add-ons.",
      "rating": "5"
    },
    {
      "title": "Great Product!",
      "body": "It does more than I expected for the price. I trust HP products.",
      "rating": "5"
    },
    {
      "title": "HP LAPTOP",
      "body": "I like my HP LAPTOP. I don't have any thing else to say about this product. Except I wished that it was FREE.  THAT WOULD BE AWESOME.",
      "rating": "5"
    },
    {
      "title": "Great choice",
      "body": "Great technology. Love the fingerprint option to unlock.\nLightweight",
      "rating": "5"
    },
    {
      "title": "Business | Home Laptop",
      "body": "Best handy laptop with touch screen, Perfect machine for heavy duty work business and home.",
      "rating": "5"
    },
    {
      "title": "Loving my product",
      "body": "Excellent product, Everything works accordingly. Best buy is always winning",
      "rating": "5"
    },
    {
      "title": "Great price",
      "body": "This is exactly what I was looking for! I am able to podcast with a great computer.",
      "rating": "5"
    },
    {
      "title": "Worth it",
      "body": "Fantastic laptop. It is able to perform everything I need for school.",
      "rating": "5"
    },
    {
      "title": "Solid option for the price range",
      "body": "Solid option for the price range - would recommend!",
      "rating": "5"
    },
    {
      "title": "Excellent product",
      "body": "My new HP does exactly what I wanted. Fine machine.",
      "rating": "5"
    },
    {
      "title": "Laptop",
      "body": "I am satisfied with the purchase. It is the one i need for everyday needs.",
      "rating": "5"
    },
    {
      "title": "VJ",
      "body": "Pretty good laptop for great value, thin and very easy to carry.\nValue for money.",
      "rating": "5"
    },
    {
      "title": "New laptop buy",
      "body": "I got exactly what i wanted with the help of a self associate.",
      "rating": "5"
    },
    {
      "title": "good",
      "body": "is really good, i love it, is good for college, and its",
      "rating": "5"
    },
    {
      "title": "Very good laptop",
      "body": "My granddaughter loves it, she is 17. Will last her years.",
      "rating": "5"
    },
    {
      "title": "Laptop",
      "body": "I really love this computer, no problems, touch screen is great.",
      "rating": "5"
    },
    {
      "title": "great laptop for a student",
      "body": "great laptop for a student. Easy to use, great value.",
      "rating": "5"
    },
    {
      "title": "Hp laptop",
      "body": "The best laptop I have got in my life. Best quality camera and battery",
      "rating": "5"
    },
    {
      "title": "Dell",
      "body": "I love my laptop it converts to a tablet best purchase",
      "rating": "5"
    },
    {
      "title": "HP - Envy 2-in-1 14\" Full HD Touch-Screen Laptop -",
      "body": "I love the option of touch screen to keyboard feature. I have only gave it 4 stars because i have not had it long, however so far a great choice and for the price point at the time of purchase.",
      "rating": "4"
    },
    {
      "title": "Hp laptop",
      "body": "Great laptop, worth it every dollar!\nFast and amazing !",
      "rating": "5"
    },
    {
      "title": "The best laptop ever!",
      "body": "This is the best laptop ever! I love the size and the touch screen. Besides it make my work easier now.",
      "rating": "5"
    },
    {
      "title": "pc",
      "body": "nice computer easy to work with it \nl will recommend",
      "rating": "5"
    },
    {
      "title": "Yay my best purchase ever",
      "body": "I love it whatever you are doing leave it and go get this I promise you all will love it",
      "rating": "5"
    },
    {
      "title": "Great product except for all the adware",
      "body": "Great laptop at a great price, but too much adware",
      "rating": "4"
    },
    {
      "title": "Great purchase.",
      "body": "Easy to use. For me the screen is small but for the price on sale it’s fine. I paid less than $600",
      "rating": "5"
    },
    {
      "title": "Nive look & feel, low memory makes it slow",
      "body": "I wanted a laptop with separate Page Up/Down keys & apparently, only HP provides it now. So I got this one during a sale. The laptop works well for its configuration. Its a bit slow due to limited RAM. Just one annoying thing is the dedicated Co-pilot key next to ALT, instead of a CTRL key.",
      "rating": "3"
    },
    {
      "title": "Must buy",
      "body": "It is simple and easy to use.  It is awesome. I really like it.",
      "rating": "5"
    },
    {
      "title": "great value",
      "body": "great value and potential and clor and icing yeah!",
      "rating": "5"
    },
    {
      "title": "Good laptop",
      "body": "This is really a great product within budget range.",
      "rating": "5"
    },
    {
      "title": "Super reliable laptop!!!",
      "body": "This is laptop is so amazing and 100% reliable, not only for school but also for personal use aswell. Happiness 100 percent guaranteed.",
      "rating": "5"
    },
    {
      "title": "Does the job",
      "body": "I bought it on Excellent- Open box and am loving it! Fast internet connection on Wi-Fi and does the job. Am using it for my Virtual Assistant job. Clear screen and what I like the most is that it has keyboard light which is really helpful when am working at night. Overall satisfied!",
      "rating": "5"
    },
    {
      "title": "Great!",
      "body": "Excellent Laptop, purchased this for one of my team members and it has been great. Very sleek design.",
      "rating": "5"
    },
    {
      "title": "Great quality",
      "body": "Working on it for school and work is actually not that bad.",
      "rating": "5"
    },
    {
      "title": "Great price for an amazing laptop",
      "body": "Amazing laptop!   I purchased on 11/8/24 for 749.00, it went on sale for 449.00 and was able to get a price adjustment.  Super easy to set up, keyboard is backlit.",
      "rating": "5"
    },
    {
      "title": "great laptop",
      "body": "Excellent ,excellent laptop !! A bonus is that this laptop is touchscreen",
      "rating": "5"
    },
    {
      "title": "Disappointed with the battery life",
      "body": "Puracged this laptop because of its battery life specs (up to 12.5 hrs) but really disappointed as its not lasting even for 3 hours when fully charged.",
      "rating": "3"
    },
    {
      "title": "Awesome",
      "body": "It is good and display and speed was more than expected",
      "rating": "5"
    },
    {
      "title": "Great item",
      "body": "Great laptop and fast processor worth the price tag",
      "rating": "5"
    },
    {
      "title": "Good buy",
      "body": "The battery does not last long, but overall it is a very good computer.",
      "rating": "4"
    },
    {
      "title": "Great laptop",
      "body": "Awesome for school work! Love the touch screen as well as the other features",
      "rating": "5"
    },
    {
      "title": "Soup",
      "body": "It’s perfect for what I needed for his compact nice touchscreen easy to use",
      "rating": "5"
    },
    {
      "title": "HP",
      "body": "light and responds quickly.  Only issue is the laptop has to be opened for power to be turned on",
      "rating": "4"
    },
    {
      "title": "Well worth it!",
      "body": "Great product! Great Price! I would most definitely recommend anyone to buy it!",
      "rating": "5"
    },
    {
      "title": "Fits All My Computer Needs",
      "body": "Love this computer.  Handles my needs efficiently and is sleek and easy to transport and use.",
      "rating": "5"
    },
    {
      "title": "GOOD BUY",
      "body": "I like the laptop and that it was is loghter than my old one.",
      "rating": "5"
    },
    {
      "title": "It's Ok",
      "body": "Not to bad. Fingerprint scanner on point touch screen on point. It's a pretty decent laptop only major downfall is that the batteries die super fast. 3 to 4 hours",
      "rating": "3"
    },
    {
      "title": "Review",
      "body": "It is awesome. It is working really well!!!!!!!!!!",
      "rating": "5"
    },
    {
      "title": "Very sleek",
      "body": "This computer is a good buy. I wish it came Windows.",
      "rating": "4"
    },
    {
      "title": "Great laptop",
      "body": "Great laptop! Awesome combination of price and quality.",
      "rating": "5"
    },
    {
      "title": "HP Envy",
      "body": "The HP Envy laptop is great, it's small and compact great for traveling.",
      "rating": "5"
    },
    {
      "title": "Worth the cost and value",
      "body": "I needed a basic computer for search engines and small level projects and it did the job. Long battery life which is needed if you spend long hours on the computer.",
      "rating": "4"
    },
    {
      "title": "Review",
      "body": "Great product,  no problems as of yet. Easy to set up.",
      "rating": "5"
    },
    {
      "title": "Mr",
      "body": "Met all my needs and is reasonably priced and available in stock.",
      "rating": "5"
    },
    {
      "title": "HP envy",
      "body": "The staff was really kind with me and the product was perfect I would recommend this 100%",
      "rating": "5"
    },
    {
      "title": "Very satisfied..",
      "body": "I am very happy with my laptop.  I went from a chromebook to this and although a little bit to get used to it, I'm very pleased.  The folks at the Geek Squad were very helpful in steeing it up.  Thank you.",
      "rating": "5"
    },
    {
      "title": "HP laptop",
      "body": "Absolutely love the laptop. Great price and user friendly.",
      "rating": "5"
    },
    {
      "title": "HP computer",
      "body": "This is a very good product. The screen size is perfect.",
      "rating": "5"
    },
    {
      "title": "Very good computer",
      "body": "Bought it for my mom, she loves how quick and smooth it is.",
      "rating": "5"
    },
    {
      "title": "HP Laptop",
      "body": "Love it. Very user friendly. Definitely would recommend to a friend.",
      "rating": "5"
    },
    {
      "title": "Amazing laptop",
      "body": "I love my laptop it’s so light I can carry everywhere!",
      "rating": "5"
    },
    {
      "title": "Laptop",
      "body": "This was my first laptop and I am very impressed with it.",
      "rating": "5"
    },
    {
      "title": "Hp",
      "body": "works good, very fast and easy to use. Will recommend",
      "rating": "5"
    },
    {
      "title": "HP laptop",
      "body": "Good quality and great battery life. Recommend to get one more",
      "rating": "5"
    },
    {
      "title": "Awesome Product",
      "body": "More specifications for lower price, a must buy and a best buy product",
      "rating": "4"
    },
    {
      "title": "Awesome",
      "body": "Very good works awesome would recommend to everyone",
      "rating": "5"
    },
    {
      "title": "Great Lap Top for the Price",
      "body": "Very light and works well. The set up with seamless.",
      "rating": "5"
    },
    {
      "title": "Computer",
      "body": "Use it to edit my photos & it's pefect! I love it!",
      "rating": "5"
    },
    {
      "title": "Excellente service",
      "body": "The computer arrived on time and it was properly stored in a very safe condition. Very happy with the value and handling from best buy!",
      "rating": "5"
    },
    {
      "title": "Hp laptop",
      "body": "Great laptop for school. Super fast and budget friendly. Wud recommend",
      "rating": "5"
    },
    {
      "title": "John",
      "body": "so far it has been  a big improvement over my last computer.",
      "rating": "4"
    },
    {
      "title": "Great laptop",
      "body": "Thank you so very much, i am in school and it is a life saver.",
      "rating": "5"
    },
    {
      "title": "HP Laptop",
      "body": "Great laptop user friendly excellent for school work.",
      "rating": "5"
    },
    {
      "title": "Good buy for the money",
      "body": "Great laptop. It does everything I need it to do. It has a lot of storage. It goes from off to ready to use very quickly.",
      "rating": "5"
    },
    {
      "title": "MR USHER",
      "body": "THE REPAIR WAS EXCELLECT AND DONE IN A TIMELY MANNER",
      "rating": "5"
    },
    {
      "title": "Laptop",
      "body": "I love the fast and friendly service. Best Buy has been my favorite place to shop and they have everything I need.",
      "rating": "5"
    },
    {
      "title": "Hp envy 2-1",
      "body": "Excellent product and service greatly recommend and will purchase again in near future for my business",
      "rating": "5"
    },
    {
      "title": "laptop",
      "body": "This was a perfect replacement for the last laptop.",
      "rating": "5"
    },
    {
      "title": "Great laptop for the money",
      "body": "Fast little laptop. My only complaint is the battery life.",
      "rating": "5"
    },
    {
      "title": "Good price, great product!!",
      "body": "Just started school and needed a laptop. For the price i got it for and what im using it for is amazing. Im definitly not using it to its fullest capabilities. Very easy to set up right out of the box and i have no complaints",
      "rating": "3"
    },
    {
      "title": "Student",
      "body": "Best laptop gift for my daughter that is going to college.",
      "rating": "5"
    },
    {
      "title": "Navya",
      "body": "I really appreciate this product I like it and good",
      "rating": "5"
    },
    {
      "title": "This a great buy",
      "body": "Great laptop it’s super reliable. During Black Friday it was at an awesome discount",
      "rating": "5"
    },
    {
      "title": "HP laptop",
      "body": "Very pleased so far!  Purchased for wife.  Simple & efficient laptop",
      "rating": "4"
    },
    {
      "title": "Very good product.",
      "body": "The computer looks good. I always use hp brand. I have bought this computer base on brand, capacity, and totally new product.",
      "rating": "5"
    },
    {
      "title": "customer service",
      "body": "Best Buy team really worked with me in choosing a computer, returning it to get a better deal and then great financing",
      "rating": "5"
    },
    {
      "title": "Great",
      "body": "Great product. Stylish Design been using it for the last few days.",
      "rating": "4"
    },
    {
      "title": "Beautiful Laptop",
      "body": "may be a little heavy. In other way would be perfect.",
      "rating": "5"
    },
    {
      "title": "Review",
      "body": "Loved it. The service is so good and love the features for regular use.",
      "rating": "5"
    },
    {
      "title": "HP Laptop",
      "body": "Works well. Exactly what I needed for work related tasks and entertainment.",
      "rating": "5"
    },
    {
      "title": "I don’t recommend",
      "body": "It cuts off randomly but it doesn’t erase my stuff. Won’t stay charged very long. Gets the job done for school, which is minimal use.",
      "rating": "3"
    },
    {
      "title": "H.P. LAPTOP",
      "body": "GREAT PRODUCT BY H.P. EASY SET UP GREAT TO CARRY AROUND.",
      "rating": "5"
    },
    {
      "title": "My review",
      "body": "Laptop is running well. Great in store buying experience.",
      "rating": "5"
    },
    {
      "title": "HP Envy 2-in-1 14\" Performs Great",
      "body": "Very pleased with my new HP Envy 2-in-1 14\" Laptop.  Very knowledgeable Best Buy salesperson helped me determine the best laptop for my needs.  The fingerprint pad is wonderful and saves time.  Graphics and speed are also good even when multitasking.  Happy with this purchase.",
      "rating": "5"
    },
    {
      "title": "What a little workhorse!",
      "body": "My old laptop crrashed and burned in the middle of an important project. I purchased the HP Envy as a replacement. That little Envy picked right up where my old laprop left off and never looked back. It even has some new features that make my work easier.",
      "rating": "5"
    },
    {
      "title": "Good Computer!",
      "body": "Very good computer at that price. Works very well. Have not had any problem so far.",
      "rating": "4"
    },
    {
      "title": "HP Envy",
      "body": "Enjoying my new laptop.  Still navigating and learning all it has to offer.",
      "rating": "4"
    },
    {
      "title": "Superr",
      "body": "Good this laptop works better then my last laptop which I had used",
      "rating": "4"
    },
    {
      "title": "Amazing",
      "body": "Overall this product exceeds expectations. It was by far the best for the price i got it at.",
      "rating": "5"
    },
    {
      "title": "Good",
      "body": "I used to get nothing but HP in high school and college. But I bought a Dell a while ago, and I greatly Prefer it over the HP. Had to buy the HP for an emergency business situation",
      "rating": "3"
    },
    {
      "title": "Nice laptop",
      "body": "Awesome for all around use. Easily do day to day activities",
      "rating": "4"
    },
    {
      "title": "Laptop",
      "body": "Laptop is very user friendly. Set up is quick. Does not come with pen.",
      "rating": "4"
    },
    {
      "title": "Great for school !!!",
      "body": "Recently got this laptop for school (majoring in poli sci) and it’s worth the money, i’ve had no issues with it all in regards to set up and daily use. i will say battery life is not the best and i find myself charging it more often than a mac for example. other than that i highly recommend !!!",
      "rating": "4"
    },
    {
      "title": "Buy open/box, save money!!!",
      "body": "I am in IT line of work.  I rarely buy brand new technology as I can do repairs and upgrades myself. I bought this computer as open box, and was very pleased.  It was just as good as new!",
      "rating": "5"
    },
    {
      "title": "Envy",
      "body": "Laptop is fine for student.HP is a great product. Thank you",
      "rating": "5"
    },
    {
      "title": "School laptop",
      "body": "Bought for my fiancée to use for school. She absolutely loves it",
      "rating": "5"
    },
    {
      "title": "Happy with purchase",
      "body": "Works good so far. Good sale price. Time will tell.",
      "rating": "5"
    },
    {
      "title": "Venkat",
      "body": "Good laptop.           \n Baisc needs are full filing.  Worth buying and low budget.",
      "rating": "4"
    },
    {
      "title": "Easy, Quick and Transparent",
      "body": "Overall very nice experience to buy at Best Buy. Easy, Quick and Transparent.",
      "rating": "5"
    },
    {
      "title": "Gift",
      "body": "Not sure this was for my cousin, she seemed happy about it though.",
      "rating": "5"
    },
    {
      "title": "Laptop",
      "body": "Works seamlessly..no issues..very easy to startup .",
      "rating": "4"
    },
    {
      "title": "Perfect laptop",
      "body": "Perfect machine. Works well and has featires that I like.",
      "rating": "5"
    },
    {
      "title": "New Washer",
      "body": "Great deals on Appliances,,,,always,,,at Best Buy.",
      "rating": "5"
    },
    {
      "title": "Open Box is Great",
      "body": "Bought this open box, paid 1/2 price...it was perfect my granddaughter loves it for school.",
      "rating": "5"
    },
    {
      "title": "Gets the job done",
      "body": "Perfect for a student. The ability to fold back is very helpful.",
      "rating": "5"
    },
    {
      "title": "Excellent",
      "body": "Customer service was knowledgeable and extremely helpful.  There are know complaints about the product what-so-ever as I purchased 2 laptops",
      "rating": "5"
    },
    {
      "title": "Just alright",
      "body": "Just ok. Not very good for multitasking, smooth silver finish and 8GB of Memory not enough on Windows.",
      "rating": "3"
    },
    {
      "title": "Review",
      "body": "Very good for college students. I’m currently in school been using the computer for a couple months only thing I would say could be better would be the battery life but it makes up for it.",
      "rating": "4"
    },
    {
      "title": "HP Laptop",
      "body": "I love my new laptop. There’s a bit of a learning curve but I know if I need help I could call the Geek Squad for help.",
      "rating": "5"
    },
    {
      "title": "Great 2-in-1",
      "body": "Overall this was a great purchase. Works great for all of my school needs, little slow when gaming and a little big when in tablet mode for kindle book reading. Wish I had gone with a slightly smaller size but overall love this purchase. Would recommend to others who are looking for a 2-in-1.",
      "rating": "4"
    },
    {
      "title": "Shockingly awful",
      "body": "I figured getting a laptop for school that costs $750 would be a safe bet. I assumed that it would be capable of handling the very basics such as keeping a couple chrome tabs open. \nI see now that was wrong of me. Every single day my laptop runs out of memory while I have TWO tabs open. One on a school text book, another on an assignment. \nMy assignment progress is then gone. I have to locate the module to open it, restart where I was, all the while losing time bc assignments are timed :/ awful and sooooo disappointing",
      "rating": "2"
    },
    {
      "title": "HP Envy",
      "body": "Amazing laptop, would definitely recommend. Even plays a few games pretty well!",
      "rating": "5"
    },
    {
      "title": "Work from home computer",
      "body": "Good product if you work from home, highly recommended.",
      "rating": "5"
    },
    {
      "title": "Quality for price",
      "body": "Great quality for the price.\nI would recommend it to anyone.",
      "rating": "5"
    },
    {
      "title": "Worth the price but a bit too small in size",
      "body": "I like the laptop, very easy to manage and very clear with good storage; however, it is smaller than I expected.",
      "rating": "5"
    },
    {
      "title": "Great buy",
      "body": "Good deal and working fine without any issues. Recommend",
      "rating": "5"
    },
    {
      "title": "Would repurchase",
      "body": "Very well constructed laptop, the laptop starts up very quick and instantly connects to wifi which is very impressive. Great overal",
      "rating": "5"
    },
    {
      "title": "Laptop it up",
      "body": "Awesome laptop. #No complaints except sometimes the mouse left clicks when I am trying to right click because it is sensitive.  And keyboard is still active when folded into tablet mode, which sometimes causes the keys get clicked when unwanted.  Also battery life is not so good",
      "rating": "4"
    },
    {
      "title": "Ms",
      "body": "The associate that took care of me was very helpful in asking the right questions to recommend the best computer for me and what I was going to use it for.",
      "rating": "5"
    },
    {
      "title": "Reliable computer for the price",
      "body": "So far this lap top seems to be reliable. A bit heavier than the Microsoft but if the battery dies i understand it can be replaced.",
      "rating": "5"
    },
    {
      "title": "A new family member",
      "body": "Im loving my new device. The keyboard is the right size for my over 50 eyes. Screen clarity is also a plus. Me and (nickname) will be together for a long time.",
      "rating": "5"
    },
    {
      "title": "New computer",
      "body": "So far so good!!  Haven’t had any problems trying to use a new computer computer. I had Geek Squad to set it up for me so I am anticipating a great experience with it.",
      "rating": "5"
    },
    {
      "title": "Decent inexpensive windows laptop",
      "body": "Needed a cheap small windows laptop to carry around and travel thus seems good so far. Not the fastest or most powerful. Screen is nice. Missing an “insert” key which is annoying for cut and paste.",
      "rating": "4"
    },
    {
      "title": "Hundred percent satisfaction guaranteed!",
      "body": "All staff were very knowledgeable and professional. Very easy to work with",
      "rating": "5"
    },
    {
      "title": "Laptop",
      "body": "Laptop for streaming and watching videos in my room!!",
      "rating": "5"
    },
    {
      "title": "Perfect",
      "body": "Purchased this laptop not once but twice in the last year. Great for everyday use. I use it for Real Estate and my husband uses it for drag racing.",
      "rating": "5"
    },
    {
      "title": "HP ENVY x360",
      "body": "Excellent value for the price. Everything seems perfect.",
      "rating": "5"
    },
    {
      "title": "Why did I by an HP",
      "body": "Not happy with HP forgot how many times they bug people to pay for this and pay for that.",
      "rating": "3"
    },
    {
      "title": "Laptop",
      "body": "I Love my computer ! :) and It’s very good for school.",
      "rating": "5"
    },
    {
      "title": "HP computer",
      "body": "It's fast and easy !  ************************************",
      "rating": "5"
    },
    {
      "title": "Stacy's HP laptop",
      "body": "I absolutely love my HP laptop and the young man who assisted me in my purchase was extremely knowledgeable and not pushy whatsoever.",
      "rating": "5"
    },
    {
      "title": "Old computer about to explode so a new one ASAP.",
      "body": "I had to buy a new laptop and got very good advice based on what I do with it. best Buy staff and Geek Squad did an excellent job.",
      "rating": "5"
    },
    {
      "title": "Laptop",
      "body": "Its amazing products i  bought laptop it was good product.  They delivered ontime.",
      "rating": "5"
    },
    {
      "title": "Actually better than i expected",
      "body": "Works well and the display quality is good. Only 60 hz refresh rate. Does not cool very well though. But I would buy again",
      "rating": "5"
    },
    {
      "title": "Good for the price",
      "body": "The laptop was good for the price but there’s better options for a little more money.",
      "rating": "4"
    },
    {
      "title": "HP laptop",
      "body": "Haven't had an computer/laptop for years. Seems to be good so far.",
      "rating": "4"
    },
    {
      "title": "Great pc",
      "body": "This purchase was great. We love it thank you very much.",
      "rating": "5"
    },
    {
      "title": "Just like new",
      "body": "It came in really excellent condition amd with all the accessories. Just lije new.",
      "rating": "5"
    },
    {
      "title": "Perfect college student laptop",
      "body": "Ordered this for my son for college. He loves it and is perfect for his needs.",
      "rating": "5"
    },
    {
      "title": "Great budget Laptop",
      "body": "Great budget laptop. Got an open box and has been working well",
      "rating": "4"
    },
    {
      "title": "Enjoy working on it.",
      "body": "Wonderful laptop. Best I've ever had! Beautiful screen, easy touch keyboard.",
      "rating": "5"
    },
    {
      "title": "Good laptop",
      "body": "It’s been a good laptop for my son. He uses it every day at school",
      "rating": "4"
    },
    {
      "title": "غفلزن",
      "body": "نيسمتالاتتنن وردا البد نتا نال ناد رتم ند مز ما ند متر رددن ما",
      "rating": "5"
    },
    {
      "title": "computer",
      "body": "Great laptop to buy has many features and works great for business",
      "rating": "5"
    },
    {
      "title": "Dr.",
      "body": "Excellent laptop! This laptop is a must-get for all who love working on a laptop. The features are top of the line.",
      "rating": "5"
    },
    {
      "title": "Awesome",
      "body": "Good product worth it for money works good looks good",
      "rating": "5"
    },
    {
      "title": "Perfect",
      "body": "I am  happy with these computer i haven't had any issues  so far,",
      "rating": "4"
    },
    {
      "title": "M",
      "body": "Very good customer service. Explain all my concerns",
      "rating": "5"
    },
    {
      "title": "New HP Laptop",
      "body": "My old HP laptop was very slow, so I purchased the new one to replace it. I particularly like the solid state hard drive. I had some concerns about Windows 11, but have found it works fine.",
      "rating": "4"
    },
    {
      "title": "Afforadable price",
      "body": "The was absolute best and affordable for college student",
      "rating": "5"
    },
    {
      "title": "Working great",
      "body": "Love it working great for what i need it for and colors are good it's what I need it for",
      "rating": "5"
    },
    {
      "title": "Perfect choice",
      "body": "Best to buy. Having a wonderfull experience using this laptop.",
      "rating": "5"
    },
    {
      "title": "Beautiful",
      "body": "So far so good, nice finger print security. Good office work also school work",
      "rating": "5"
    },
    {
      "title": "Excellent purchase",
      "body": "Excellent for small business needs and all what you may want in your personal use.",
      "rating": "5"
    },
    {
      "title": "nice",
      "body": "A rat in the house might eat the ice cream.  A rat in the house might eat the ice cream",
      "rating": "5"
    },
    {
      "title": "New Laptop",
      "body": "Performs exactly as expected. The finger print scan is cool. Coming from 2016 Surface pro 4",
      "rating": "5"
    },
    {
      "title": "Great Laptop on Open box sale!",
      "body": "Great Laptot, excellent batery performance, I buy this machine with Open box deal.",
      "rating": "5"
    },
    {
      "title": "Good",
      "body": "A nice computer exceot the power button is too cloe to the delete key and does not have a lighted keyboard.",
      "rating": "4"
    },
    {
      "title": "Computer",
      "body": "Nice computer and the price is not that bad i would recommend buying here again",
      "rating": "5"
    },
    {
      "title": "Ms",
      "body": "Customer service was on point \nI appreciated how he took his time with me",
      "rating": "5"
    },
    {
      "title": "Great for College",
      "body": "This a great project so far my college classes and personal usage. It helps with it's storage unit and fast connection.",
      "rating": "4"
    },
    {
      "title": "Laptop",
      "body": "Very good laptop for the money. Display is very bright. Very easy to operate.",
      "rating": "5"
    },
    {
      "title": "Good Deal",
      "body": "Very  Fast Option for The money.  It has great keyboard  space.",
      "rating": "5"
    },
    {
      "title": "Great product!",
      "body": "Perfect for all my homework and school, as well as personal needs.",
      "rating": "5"
    },
    {
      "title": "Awesome",
      "body": "Great product and the salesman was very helpful and knowledgeable !!",
      "rating": "5"
    },
    {
      "title": "Laptop",
      "body": "Very good laptop very pleased with it. Wonderful job with staff also",
      "rating": "5"
    },
    {
      "title": "Functional for the price",
      "body": "The laptop is very functional and meets all my needs, the only issue I have with it is the battery runs down very quickly when not plugged in.",
      "rating": "4"
    },
    {
      "title": "Pleased",
      "body": "So far so good. I’m pleased with the laptop. The computer runs must better than the older version I have.",
      "rating": "4"
    },
    {
      "title": "Great Lapto",
      "body": "Great laptop and great customer service sales person was very knowledgeable",
      "rating": "5"
    },
    {
      "title": "Very Satisfied",
      "body": "Great Computer. Can't go wrong with this purchase for the price.",
      "rating": "5"
    },
    {
      "title": "New computer",
      "body": "It is really good quality with picture and easily accessible. The speakers could be a little better.",
      "rating": "4"
    },
    {
      "title": "Learning curve",
      "body": "Nice computer still getting the hang of it. Got help from geek squad.",
      "rating": "5"
    },
    {
      "title": "HP laptop",
      "body": "Best laptop I've ever owned!!!!!!!!!!!!!!!!!!!!!!!",
      "rating": "5"
    },
    {
      "title": "Perfect for home use",
      "body": "Exactly what I needed for my home use.  Excellent tech support.",
      "rating": "5"
    },
    {
      "title": "So far, So good!",
      "body": "Sleek professional look, but durable build. Love the multi-function!",
      "rating": "5"
    },
    {
      "title": "Well",
      "body": "Good and I like it so much I just want to recommend.",
      "rating": "5"
    },
    {
      "title": "HP ENVY",
      "body": "Me gista lo liviana y compacta que es mi nueva computadora Envy the HP",
      "rating": "5"
    },
    {
      "title": "Brian",
      "body": "This't very good, I like use this en my free time.",
      "rating": "5"
    },
    {
      "title": "YAYYYY",
      "body": "best ever comput, gf berry hapy, so much in lobe wit cumput",
      "rating": "5"
    },
    {
      "title": "I ❤️ My Laptop",
      "body": "My laptop is everything i was sold a Great Product",
      "rating": "5"
    },
    {
      "title": "Just awesome",
      "body": "Just awesome and worth for the money. recommended one",
      "rating": "5"
    },
    {
      "title": "Great buy",
      "body": "Bought this great laptop with a great price great deal",
      "rating": "5"
    },
    {
      "title": "HP audio volume is unacceptably low",
      "body": "This computer has one unacceptable issue—the audio volume does not get loud enough. At full volume it is not enough.",
      "rating": "4"
    },
    {
      "title": "Awesome service.",
      "body": "The rep was excellent.  Very pleased with purchase.",
      "rating": "5"
    },
    {
      "title": "HP ENVY 2-1 14\" FULL HD TOUCH SCREEN LAPTOP",
      "body": "awesome laptop.  i WOULD HIGHLY RECOMMEND THIS TO ALL",
      "rating": "5"
    },
    {
      "title": "Value laptop",
      "body": "I bought the laptop when it was discounted, and for what it offers, it was pretty good value with a solid build",
      "rating": "4"
    },
    {
      "title": "HP-Envy 2-in-114\"",
      "body": "Great laptop.  Use it everyday almost all day long.",
      "rating": "4"
    },
    {
      "title": "Good",
      "body": "Good price for student. This is the second time i bought it",
      "rating": "4"
    },
    {
      "title": "About computer",
      "body": "It is a very nice computer and I am happy with everything that is on the computer.",
      "rating": "4"
    },
    {
      "title": "Worse laptop i had ever",
      "body": "Donot buy this laptop since I bought i fave problem with touchpad not working at that time was undet warranty they fix update and after that work 1 week and since I bought that not working very bad I tried everything thing nothing work believe me if you need hardtime buy it",
      "rating": "1"
    },
    {
      "title": "Same as it ever was",
      "body": "Its the same as the one I bought last year. Functional.",
      "rating": "4"
    },
    {
      "title": "New computer",
      "body": "I got it for my husband,  for work. He said it was ok so far",
      "rating": "4"
    },
    {
      "title": "PC PLATOP OK BUT AMERICAN DREAM BEST BUY IS BAD",
      "body": "THE AMERICAN DREAM SHOPPING EXPERIENCE IS VERY BAD  1.  THE STORE COULDN'T ACCESS OUR RESALE SETTING and PROCESS ORDER  2. IT's IN A PLACE wHERE they CHARGE for $5 for even for 1/2 hour, it's RIPOFF BY MALL and BUSTBUY supports. AFTER SENDING TIME & MONEY COULDn'T BUY IT.  PC PLATOP OK BUT AMERICAN DREAM BEST BUY IS BAD",
      "rating": "2"
    },
    {
      "title": "bad experience",
      "body": "the first time i used it i could not type in blanks  spent over one hour on the phone with Geek squad.   they said they fixed it but it happened again and i was able to turn off computer and reset but did not want to do that forever.   Itenm was returned and purchase cancelled",
      "rating": "1"
    },
    {
      "title": "Battery and Speed problems",
      "body": "Battery dies very fast especially when playing a game.",
      "rating": "3"
    },
    {
      "title": "Worst Experience with Best Buy Delivery",
      "body": "Really worst experience with Best Buy .. They did wrong delivery some door dash guy taken away the laptop box but best buy never respond if you have all proof of cc camera and police case Report id..",
      "rating": "1"
    },
    {
      "title": "Loud",
      "body": "Very load motor. We have only owned it less than month.",
      "rating": "3"
    },
    {
      "title": "Speed",
      "body": "Great computer but bit slow for high speed computing",
      "rating": "3"
    },
    {
      "title": "Terrible",
      "body": "Returned after 2 weeks. Very slow updating. Froze after a download and had to force shutdown. Camera stopped working.",
      "rating": "1"
    },
    {
      "title": "Extremely disappointed",
      "body": "Bought this laptop as a xmas present. After 2 weeks laptop would not connect to internet. We tried  troubleshooting and no luck.Took it back to store and they told me this laptop has this issue a lot. It seems to be a bad model. Had to exchange ot for a different brand. Extremely disappointed to say the least.",
      "rating": "1"
    },
    {
      "title": "Regret",
      "body": "Best Buy sold me a faulty computer that they knew overheated and had mic issues! Scam",
      "rating": "1"
    },
    {
      "title": "An Okay laptop.",
      "body": "This is not the new 14 inch Envy, given the price difference I would definitely go for the other one. \nThe item is hard to take apart for SSD upgrading.",
      "rating": "2"
    },
    {
      "title": "Buy it if you like junk",
      "body": "Junk. Machine does not function unless you bootup, wait for the OS to load, and tyen restart.  Every time. Most worthless piece of machinery I've owned, out of 20-plus computers. Returning asap as nothing works: OS, processor (Intel is a joke), battery, touchscreen. This is not my first HP laptop, \nbut it is my last. HP should be ashamed of producing such shoddy gear.",
      "rating": "1"
    },
    {
      "title": "HP Envy 2 In 1 4 IN",
      "body": "Got this laptop for school, does everything I need it to do while being portable and the right size to fit in my backpack",
      "rating": "4"
    },
    {
      "title": "Nice laptop but low Ram",
      "body": "Nice laptop but low Ram\n\nI really liked this laptop except for the Ram which is not upgradable so i ended up exchanging ir for different one with 16gb Ram. But this should a good laptop for kids in school.",
      "rating": "4"
    },
    {
      "title": "Nice HP",
      "body": "Awesome laptop! Very fast and easy to use. Bought a riser to go along with it since it will primarily be on my desk.",
      "rating": "5"
    },
    {
      "title": "Great Purchased",
      "body": "Great performance! It’s very fast and you can download apps very easily",
      "rating": "5"
    },
    {
      "title": "Raju",
      "body": "Very well working and price is very good , person can afford a price",
      "rating": "5"
    },
    {
      "title": "Ms",
      "body": "It is easy to use and meets the criteria I needed.ms",
      "rating": "4"
    },
    {
      "title": "STAY AWAY FROM HP PRODUCTS",
      "body": "STAY AWAY FROM HP PRODUCTS! UNLESS YOU HAVE MONEY TO WASTE. They will sell you faulty hardware products that do not last at all. And then expect you to pay to fix it. I’ve had many labtops that lasted years, even when I was the reason it had any type of damage to it, it still worked. But this one takes the cake for the worst. Didnt even have it a full year of usage. The system hardware failed after a little while. With blinking caps lock.  Didnt use it daily, didnt drop it, it had no type of physical damage caused by me. The issues are internal from the faulty system they set up and sent out to me. The customer service is AWFUL. THEY DO NOT CARE ABOUT THE CUSTOMER AT ALL. I’m so disappointed and wish I never brought it. I can either be out $600 or fight this. I’m a fighter so I’ll be seeking legalities to get my money back for sure.",
      "rating": "1"
    },
    {
      "title": "excellent",
      "body": "It was one of the purchases that I liked the most for my own benefit.",
      "rating": "5"
    },
    {
      "title": "Broke college student meets broken hinge",
      "body": "Was nice at first but after a little over a year, the hinge broke and when I tried to unknowingly close the laptop, the screen cracked. Still works but wasted close to $900",
      "rating": "1"
    }
  ]
}