{
  "name": "HP 15-fd0127dx",
  "price": "599.99",
  "rating": "4.6",
  "reviews": "415",
  "specs": " 15.6\" Full HD Touch - Screen Laptop  -  Intel Core i7  -  16GB Memory  -  512GB SSD  -  Natural Silver",
  "product_url": "https://www.bestbuy.com/site/hp-15-6-full-hd-touch-screen-laptop-intel-core-i7-16gb-memory-512gb-ssd-natural-silver/6612253.p?skuId=6612253",
  "full_specs": {
    "Screen Type": "IPS",
    "Screen Size": "15.6 inches",
    "Screen Resolution": "1920 x 1080 (Full HD)",
    "Touch Screen": "Yes",
    "Brightness": "300 nits",
    "Processor Model": "Intel 13th Generation Core i7",
    "Storage Type": "SSD",
    "Total Storage Capacity": "512 gigabytes",
    "System Memory (RAM)": "16 gigabytes",
    "Graphics": "Intel Iris Xe Graphics",
    "Display Connector(s)": "1 x HDMI 1.4",
    "Battery Life (up to)": "7.75 hours",
    "Battery Chemistry": "Lithium-ion polymer",
    "2-in-1 Design": "No",
    "Backlit Keyboard": "No",
    "Brand": "HP",
    "Model Number": "15-fd0127dx",
    "Product Name": "15.6\" Full HD Touch-Screen Laptop - Intel Core i7 - 16GB Memory - 512GB SSD",
    "Color": "Natural Silver",
    "Year of Release": "2025",
    "Display Type": "LED",
    "Color Gamut (NTSC)": "45 percent",
    "Processor Brand": "Intel",
    "Processor Model Number": "1355U",
    "CPU Boost Clock Frequency": "5 gigahertz",
    "Number of CPU Cores": "10-core",
    "CPU Cache Memory Level": "L3",
    "L3 Cache": "12 megabytes",
    "Solid State Drive Capacity": "512 gigabytes",
    "Solid State Drive Interface": "PCIe",
    "Type of Memory (RAM)": "DDR4",
    "System Memory RAM Speed": "3200 megahertz",
    "Graphics Type": "Integrated",
    "GPU Brand": "Intel",
    "Operating System": "Windows 11 Home",
    "Number of HDMI Outputs (Total)": "1",
    "USB Ports": "1 x USB-C 3.0, 2 x USB-A 3.0",
    "Number of USB Ports (Total)": "3",
    "Headphone Jack": "Yes",
    "Microphone Input": "Yes",
    "Wireless Connectivity": "Bluetooth, Wi-Fi",
    "Wireless Networking Standard": "Wi-Fi 6",
    "Number Of Ethernet Ports": "0",
    "CPU Cooling System": "Air",
    "Power Supply Maximum Wattage": "45 watts",
    "Battery Cells": "3-cell",
    "Front-Facing Camera": "Yes",
    "Front Facing Camera Video Resolution": "720p",
    "Built-In Microphone": "Yes",
    "Media Card Reader": "No",
    "Audio Technology": "HD Audio",
    "Speaker Type": "Stereo",
    "Security Features": "Privacy camera",
    "Product Height": "0.73 inches",
    "Product Width": "14.17 inches",
    "Product Depth": "9.29 inches",
    "Product Weight": "3.52 pounds",
    "ENERGY STAR Certified": "Yes",
    "EPEAT Qualified": "Yes",
    "EPEAT Level": "Gold",
    "Included Software": "HP Support Assistant, myHP, HP BIOS Protection, and more.",
    "Optical Drive Type": "None",
    "Numeric Keypad": "Yes",
    "Warranty - Parts": "1 year",
    "Warranty - Labor": "1 year",
    "UPC": "198828898210"
  },
  "all_reviews": [
    {
      "title": "Great laptop",
      "body": "I think this laptop suits my needs. I find the 15.6 inch comfortable in my lap. The battery doesnt last as long as my macbook but i will compromised for the full keyboard and screen size. I love this screen size and its 16:9 aspect ratio for fitting many windows side by side. I tried to play a game “Fae Farm” and it got really hot, fans were off the chain and drained my battery from 100% to 80% within 30 min. Overall if you’re looking for a laptop to do anything not gaming related, this works perfectly. It is pretty fast and the touch screen makes things even quicker and more convenient. I am pleased.",
      "rating": "4"
    },
    {
      "title": "HP laptop",
      "body": "I recently purchased this laptop from Best Buy, and overall, I’m very pleased with my experience. The buying process was smooth online, and the online assistant staff was helpful in answering my questions and helping me choose the right model for my needs.\n\nPerformance:\nThe laptop runs smoothly for everyday tasks like browsing, streaming, and working with documents. The processor is fast enough for multitasking, and I haven’t experienced any lag or slowdowns.\n\nDisplay & Design:\nThe screen is bright and clear, making it comfortable to watch videos and work for extended periods. The design is sleek and modern, and the laptop feels lightweight and portable, which is great for taking it on the go.\n\nBattery Life:\nThe battery life has been impressive so far, lasting several hours on a single charge. This makes it convenient for both work and leisure without constantly needing to plug in.\n\nValue:\nFor the price, I feel like I got a great deal. HP laptops are known for their reliability, and I appreciate the warranty and support options available through Best Buy.\n\nOverall:\nI would definitely recommend this laptop to anyone looking for a reliable, affordable, and well-performing device. It’s a great fit for students, professionals, or anyone needing a solid everyday laptop.",
      "rating": "5"
    },
    {
      "title": "Goob buy",
      "body": "Loving this laptop for everyday use\n\nI’ve been using it every day for a while now, and it’s honestly been great for my usual tasks—whether I’m juggling a bunch of browser tabs, video calls, or just kicking back with some Netflix. It boots up fast, runs smooth thanks to the Intel Core i7 and 16GB RAM, and the touchscreen is surprisingly handy. The battery holds up well during the day, and I love that it charges super quick when I need it to. Plus, the design is sleek and lightweight enough to carry around. Definitely a solid pick for anyone who wants a no-fuss, reliable laptop.",
      "rating": "5"
    },
    {
      "title": "Great school laptop for the $, but not premium!!",
      "body": "The performance of this Laptop is fantastic. It helps my daughter power through her schoolwork and never stutters. The screen is great, and the touch screen helps with surfing the web, as well as completing tasks. Viewing angles are good, and the camera cover mechanism is a great touch to ensure privacy. I would give it 5 stars, but the plastic base and plastic keys are a disappointment a bit. That part does not feel Premium.",
      "rating": "4"
    },
    {
      "title": "Useful laptop",
      "body": "It's good; it suits my work and study needs. It is fast and the right size; the only downside is that its battery doesn't last long.",
      "rating": "4"
    },
    {
      "title": "Good product, I recommend it.",
      "body": "Thank you to the Best Buy store and the workers, since they helped me choose a laptop for the type of work I do, and I am very grateful for the store and its workers, in addition to the fact that they speak Spanish, since I only speak Spanish and use a translator.",
      "rating": "5"
    },
    {
      "title": "HP",
      "body": "My old laptop was way to slow couldn't open more than 1 tab at a time. i really needed this. 1 thing I don't like is , after I press the on button ,it seems like it takes too long to open up the screen to log in. It's been like that since I got it. After, I sign in it's fine. Just waiting for it to load the sign in page takes some time. Other than that i like it",
      "rating": "4"
    },
    {
      "title": "Outstanding Performance and Design – A Top-Tier Co",
      "body": "This computer delivers exceptional performance and reliability, making it an excellent choice for both professional and personal use. Its high-speed processing capabilities, sleek design, and user-friendly interface contribute to an overall outstanding user experience",
      "rating": "5"
    },
    {
      "title": "Nice laptop",
      "body": "Pretty great overall. I thought it would have a fingerprint sensor but not with this model. I like the camera curtain. I like that it’s touch screen and has good enough space for work files and such.",
      "rating": "4"
    },
    {
      "title": "Nice",
      "body": "I’m really not that great with computers, but I do like this one. The touch screen is more responsive than my last touchscreen laptop. The new built-in assistant is quite nice as well",
      "rating": "5"
    },
    {
      "title": "HP laptop",
      "body": "Great deal on it, i got it the same day my daughter needed it and she loves it.",
      "rating": "5"
    },
    {
      "title": "Nice reliable HP laptop.",
      "body": "Fast, powerful and efficient laptop. Good display and touch screen capability.",
      "rating": "5"
    },
    {
      "title": "Budget Friendly",
      "body": "Very smooth and tough and smooth body,good size display!",
      "rating": "5"
    },
    {
      "title": "HP 15” i7 512GB",
      "body": "Most efficient and worth it computer for the specs.",
      "rating": "5"
    },
    {
      "title": "Computer for school",
      "body": "Got this for school, love it! Has a good battery life and great quality.",
      "rating": "5"
    },
    {
      "title": "This notebook has good bones...",
      "body": "This silver HP15 notebook has a lot of potential (and good bones as I say).  It's based on Intel's i7 1355U CPU, 10 Cores and 12 Threads (2 Performance Cores w/4 Threads, running from 1.7 GHz to 5.0 GHz Turbo and 8 Efficient Cores w/8 Threads running from 1.2 GHz to 3.7 GHz Turbo). Its multi thread rating is 14590 and single thread rating is 3471. Typically consuming 15W but peaking at 55w.  It's a power efficient processor that has been popular in mid to high-end notebooks.  It weighs 3.5 pounds.  With a 1920x1080 HD touch screen. This HP15 does not have a dedicated GPU, instead offering Intel's iRISxe GPU.  IT also does not have a backlit keyboard (which I think a notebook in this price range should have). It also does not have an Ethernet port or a SDcard reader.  It has two USB 3.0 USB-A ports and one 3.0 USB-C port and 1 HDMI 1.4 port (w/HDR). It has a headphone/mic jack.  It supports Wi-Fi 6 and Bluetooth 5.3 (not 5.4). It has a 720P camera with a physical camera shutter (Also I think the camera should be 1080P at this price).  It integrates Microsoft Copilot with a Copilot key. And you can quickly mute the microphone with the F6 key (love this feature).  The USB ports are all limited to 5Gbps, not 10 w/USB 3.1 or 20 w/USB 3.1 v2, it does not support outputting to a USB monitor via the USB-C port.  It has a nice trackpad. The back of the monitor is a silver plastic as is the keyboard base, the bottom of the computer is a lighter weight gray plastic.  The back can easily be removed by removing 4 screws (good/easy).\n\nIntel's iRISxe GPU is a big improvement over older Intel integrated graphics processors, it can handle light gaming at lower settings. It is fine for basic video editing and creative tasks and for browsing the internet.  It's energy efficient; it is not suitable for high-end gaming. It should get about 7 hours of usage on battery power.  It comes with a unremarkable Samsung Gen 4x4 PM9C1 SSD; spec'd to have max seq writes at 4950 MBs and reads at 2500 MBs.  It supports DDR4 memory 3200 MT/s. It comes with 16GB (2x8GB SODIMMs).  The SSD and Memory are removable/replaceable.  This is why I acquired this notebook; to upgrade it.\n\nI did the initial set up and upgrades with the base hardware.  Windows Home 11 requires you to have a Microsoft account to log into. I went through a HP BIOS upgrade and needed at least 3 \"updates\" to get all of the Microsoft updates.\n\nI'm replacing the SSD with a much faster 2TB Orico SSD rated at 7400 seq reads and 7000 seq writes, of which I got 7032 reads and 6348 writes. And I will upgrade the memory to 64GB with G.SKILL Ripjaws DDR4 (2x32GB) 3200 MT/s CL22.  To clone the SSD you must disable Windows 11 BitLocker (Encryption), with Windows 11 Home this is slightly more complicated but doable.  The Samsung SSD tested out at 4440 reads and 2105 writes (CrystalDiskMark8).  This is about 30% slower than the Orico SSD.  Both my memory and SSD upgrades went smoothly.\n\nThe notebook runs a little warm, you can feel that the left side of the keyboard and palmrest is warmer than the right side. But it has a very nice screen and it's FAST and only 3/4\" thick. The keyboard is just ok, there is a little bit of give, and the island keys have a cheap plastic feel to them, with a so-so key travel (And I've become used to having a backlit keyboard).  With the faster SSD and some configuration changes browsing the internet with either Edge or Chrome (via WiFi 6) was very fast.  I did some audio editing and it was smooth and fast.  The speakers are adequate.  I usually edit with a BT connection or using headphones/earbuds, both of these worked very well.  I do astrophotography where I stack hundreds of night photos.  This is why I needed more memory.  The application I use is not so GPU intensive as it is memory intensive. Loading and comparing hundreds of images can only be done efficiently with lots of memory.  This computer's i7 processor handles this pretty efficiently.  I processed a stack of about 100 images in just over 2 minutes 40 seconds.  My older notebook (2 years old (i7 w/48Gb memory)) took just over 5 minutes.  So this notebook, as upgraded, will be faster; partially because SSDs have gotten faster.  When Gen5 SSD's and notebooks come down in price I'll likely upgrade again.  But for now this is not a bad compromise (once upgraded).",
      "rating": "4"
    },
    {
      "title": "Large screen, lightweight, fast",
      "body": "This is my first HP laptop with a touchscreen. The laptop weighs only about 3.5 lbs thanks to its all plastic chassis; the 45 Watt charger adds another half pound of weight when travelling. The laptop is around 3/4\" thick with a very slight taper from back to front. I like this form factor because it's got a large screen but doesn't feel heavy or bulky. \n\nThis build comes with a 13th Gen Intel i7-1355U processor that has a 1.7 GHz base clock with 5GHz max boost, 16GB of 3200 MHz DDR4 RAM pre-installed across two 8GB sticks, and 512GB NVMe Gen 4 m.2 SSD. Note that 16GB is the advertised maximum RAM capacity for this model and it cannot be upgraded further, however, the SSD can be replaced with a larger capacity if desired by removing four small screws on the bottom and popping off the base panel. The power port and a USB-A 3.0 port are at its right-side back corner, and a second USB-A 3.0, as well as HDMI 1.4 out, USB-C 3.0, and combo mic/headphone port are on its left side.\n\nThe IPS display is glossy without the matte haze of a glare filter but still rejects reflections well. The max resolution is 1920x1080p FHD with a 16:9 aspect ratio. It is decently bright at 300 nits but only has 8-bit color covering 45% of the NTSC color gamut (65% sRGB) which may not be detailed or accurate enough for some creators and digital artists. As I'm more accustomed to 100% sRGB displays, the colors look slightly dull and under saturated to my eye. Clarity is very good though with crisp, easy-to-read onscreen text. The display is powered by Intel's Iris Xe which is an entry-level integrated graphics suitable for casual gaming. Connectivity-wise it supports WiFi 6 and Bluetooth 5.3, however, there is no Ethernet port.\n\nAt the top of the screen is a 720p integrated webcam with dual-array microphone. The image quality of the camera is serviceable for virtual meetings and live streaming but tends to be slightly grainy with a soft focus even in the best lighting conditions. It has a status LED so you know when it's on and a sliding privacy cover. However, it isn't compatible with Windows Hello facial recognition for login.\n\nThe touch features work fine and respond to swipes and multi-finger gestures like pinch-to-zoom. I was also impressed with how oleophobic the glass is, keeping it relatively fingerprint and smudge free. The panel does not, however, fold 360 degrees flat for use as a \"tablet\" and stops around 120 degrees open. The screen's hinge gives slightly when the screen is touched or tapped which makes using it somewhat awkward. Since the large 5\"x3\" mouse trackpad is closer to the keyboard, I tend to use it more often out of habit and convenience. \n\nThe keyboard is full-size and includes a number pad on the right-hand side. The up/down directional arrow keys are only half-keys, however, which takes a bit of getting used to and may impact one's gaming experience. While the exterior of the laptop feels pretty solid, there is a bit of flex to the keyboard deck and a sense of hollowness when typing. The keys are also fairly clicky with a high actuation force and rough plastic-y feel which is different from the soft-touch mushiness that I'm used to in laptops. The keyboard's top row consists of action keys by default, like emoji menu, brightness, volume, and playback controls, while F-functions are secondary. There's a dedicated key for launching HP's system control and configuration apps, Omen Gaming Hub and/or myHP, as well as Window's AI assistant, co-pilot.\n\nThe power, caps lock, and speaker/mic mute keys all have status LEDs built-in so you know when they are toggled on. One of the things that I found really impressive was the sound quality of the downward-facing stereo speakers. They are loud with a bright, rich sound that resonates throughout the entire keyboard deck with only the slightest hint of tinny boxiness and distortion at max volume. The fans are also surprisingly quiet and don't compete with the speakers making this laptop a good fit for consuming music and streaming video content.\n\nThe battery charges quickly, in only a couple hours, and its status LED will turn from orange to white when fully charged. While it’s rated to last up to nearly 8 hours on battery, I found that on max brightness I’m usually able to only get around 2-3 hours of mixed use from it (gaming, web browsing, word processing, and listening to music at medium volume). To extend the battery life to its max, you'll need to enable Eco settings and reduce screen brightness, etc. \n\nOverall, this laptop is a decent mid-level, general use laptop that is lightweight, quiet, and fast while offering a large screen. While color accuracy isn’t top tier and only the SSD can be upgraded, its specs are good enough to handle games like Warframe and Path of Exile at medium graphics, and it performs well for everyday tasks like web browsing and consuming media.",
      "rating": "5"
    },
    {
      "title": "Students and casual users may want to take a look.",
      "body": "The design of this laptop is functional and suitable for both school and work scenarios. The plastic build contributes to its light weight, although it feels less sturdy. The top cannot be lifted with one hand and tends to wobble during use. The screen features thin bezels but has a thicker chin. It includes a camera with a security slider and microphone holes at the top. \n\nThe laptop is equipped with a few ports: HDMI 2.1, two USB-A, and one USB-C (which does not support Thunderbolt 4, charging, or video output) but offers super-speed capabilities. \n\nThe full-size keyboard may feel slightly cramped, requiring an adjustment period. The keys have good travel and spring, though they may feel less durable. There is no backlight, which may affect typing in low light conditions. The trackpad is highly responsive and smooth, with satisfying springboard-style clicking. \n\nThe 1080p-60Hz display performs adequately in most situations. However, at 300 nits, the brightness is insufficient for well-lit environments, and the glossy screen may be problematic. Color accuracy is limited, making it unsuitable for serious photo or video editing. \n\nFor security, this laptop does not support face or fingerprint Windows Hello.  \n\nPerformance is adequate for a mid-range laptop. The i7-1355U processor handles regular productivity tasks, content consumption, and web browsing efficiently, supported by 16GB of RAM allowing multiple apps and tabs to run simultaneously. The laptop struggles with more demanding tasks such as advanced content creation and gaming. While there is no overheating, the fans activate frequently and can be loud. A 512GB SSD is enough space for most users. The AI feature is there for those like me who are getting into it. The 720p camera and microphone work well enough for most video calls, but are not very good.\n\nThe speakers provide clear sound without strong bass, and the inclusion of a 3.5mm headphone jack is practical for users who prefer wired headsets. \n\nThe battery life extends through a full workday and often longer. The power brick is compact but uses a proprietary plug instead of USB-C. \n\nOverall, this laptop is a viable option for students or users seeking a budget-friendly device despite some limitations.",
      "rating": "4"
    },
    {
      "title": "Good value - average performance",
      "body": "My business is IT – so I see all kinds of laptops, desktops, all-in-ones everyday day.  Today I received the HP - 15.6\" Full HD Touch-Screen Laptop - Intel Core i7 - 16GB Memory - 512GB SSD - Natural Silver, Model:15-fd0127dx and gave it a run.\n\nSetup was a breeze – like most Windows PCs today.  No glitches or issues right out of the box.  \n\nThe initial impression is that it’s a clean-looking machine, light with a small 45 watt charger.  Weighs in at less than 4 lbs total including charger.  HOWEVER, the first thing that caught my eye is the old-style round plug charger.  I just can’t figure out why manufacturers don’t just leverage the more modern USB-C charging that many of today’s laptops already have built in.  Can it really save you that much money?  HP – if you’re reading this – we’d love an explanation!  That took 1 Star off the review immediately.\n\nNext, once setup, I began to surf the web a bit and type a few documents.  In fact, I’m typing this review on the very device – and I’m notice a bit of funkiness with the keyboard.  I guess it just doesn’t really feel solid to me as it gives in a little bit when typing.  Also has a very plastic-like feel and click to the keyboard.  May not bother you – but I notice it.\n\nThe screen is very nice – although not 4k quality, it will suffice for most business and productivity use cases – as this is NOT a gaming laptop.  It folds out to about 120 degrees, feels solid when using the touchscreen (doesn’t seem to move if you have light fingers) and produces nice colors and clarity.\nThis model has a large touchpad that works well and feels responsive.  It supports multi-finger gestures, and I feel it is suited to this mid-range laptop style.\n\nOn all my machines, I use a Passmark Performance Test tool to compare the main components.  Overall – this machine produces decent CPU test scores and great SSD hard disk scores (see attached screenshots).  It lacks a dedicated GPU (which is why this isn’t a gaming rig) but it will work perfectly well for everyday surfing, streaming and office work.\n\nLack of more USB-C ports lost this machine another star in my rating – you only have 1.  You have two other USB-A ports available – do don’t plan to plug lots or peripherals into this laptop unless you have a USB-C dock.\n\nOverall – it’s a fine machine for everyday use, just a bit on the lower side for specs and performance.",
      "rating": "3"
    },
    {
      "title": "Great Thin and Lightweight Workhorse Laptop",
      "body": "When my HP Model 15-fd0127dx laptop arrived, you could immediately tell that it was the no-frills, workhorse of a computer that I expected.  With no fancy model names and no extravagant packaging, this 15.6 diagonal touch-screened, lightweight 3.52 lbs, thin 0.73\" thick laptop meets the needs of those who are looking for a moderately priced but powerful work / school computer.  \n\nThis laptop with its 13th Generation Intel Core i7-1355U high power efficiency 15W low voltage mobile processor with Intel IRIS Xe Graphics at 1300 MHz onboard, 12MB of L3 Cache, 16 GB of DDR4 3200 MHz of RAM and 512GB of SSD storage was designed to hit the latest sweetspot between price and performance and I think this machine does this well.  The 1920 x 1080 dpi 15.6\" IPS LED touchscreen display at 300 NITs brightness provides a clear and pleasant user experience whether viewing spreadsheets, drawing in 3D CAD programs, surfing the Web or playing casual games. \n\nI am pleased that HP provided plenty of useful ports on this model.  There is a 45W AC pin power port, (2) 3.0 SS USB A ports, (1) 3.0 SS USB C port and (1) 1.4b HDMI port. There is also a headphone and microphone combo port on the right.  \n\nThe keyboard has a large, clear font and has a much desired (by workers and students)10-key numerical input. \n\nThere is no Ethernet port.  This HP has WiFi 6.\n\nThere is a sufficient 720p front facing video camera that can be placed in privacy mode with the privacy hood.  Paired with the camera are the built-in HD Audio microphone and Stereo speakers, which make for good Zoom meetings or other connected encounters. \n\nThe battery life is rated at up to 7 and 3/4 hours, but I haven't tested this out, since I usually leave my laptops plugged into an outlet.\n\nAll-in-all this HP 15-fd0127dx model has everything I need for most work and casual play.  I wouldn't use it for accurate color reproduction for movies or photos, and I wouldn't use it for heavy duty online gaming, but it will do just about anything else that you can throw at it and do it well.",
      "rating": "5"
    },
    {
      "title": "Excelent",
      "body": "I've been using this laptop for a few weeks now, and I'm extremely satisfied with its performance. It's fast, boots up in seconds, and handles multitasking with ease. The display is bright and clear, perfect for both work and streaming. Battery life is impressive too – it easily lasts a full day on a single charge.\n\nThe build quality feels premium, and the keyboard is very comfortable for long typing sessions. I also appreciate the lightweight design, which makes it super portable.\n\nOverall, this laptop exceeded my expectations. Whether you're a student, a professional, or just need a reliable computer for everyday use, I highly recommend it",
      "rating": "5"
    },
    {
      "title": "Simple. Fast. No-Frills.",
      "body": "It's the perfect no-frills laptop. But hey, you can upgrade it if you need to.\n\nDisplay:\nThe display on this laptop is Full HD and a great size at 15.6\". The IPS panel only reaches 300 nits, but I find it perfectly adequate. It’s plenty bright for use in a well-lit room. The display is also a touchscreen that is both accurate and responsive.\n\nBattery:\nThis is where I had to remove a star. The battery life is rated at 7 hours and 45 minutes according to the manual, but after testing, I still haven't been able to hit that estimate. I'm sure I could tweak some power settings, but in 2025, I find it completely unacceptable that a laptop in this price range can’t last more than seven hours during regular use with stock settings out of the box. Again, I could optimize the system to extend battery life, but it would be at the cost of performance.\n\nOverall Specs:\nThis HP, paired with the i7-1355U and 16GB of RAM, is snappy and perfectly capable of handling everyday browsing, streaming, and any other task the average user could throw at it. I have to give HP massive credit when it comes to upgradeability.\n\nI’m more comfortable than most when it comes to computers, and I’ve been known to upgrade my RAM and solid-state drives when the time comes to beef up a system. I was pleased to see that neither of these components is soldered to the motherboard (see photos). I opened up my system so you don't have to, and I had the biggest grin when I saw that not only is this system running dual-channel RAM (two sticks of 8GB), but the M.2 solid-state drive is also easily accessible. This means that years down the road, when your system isn’t as fast as it was out of the box or you run out of storage, any computer technician or DIYer could upgrade this system in minutes. I love seeing manufacturers giving consumers these options… well done, HP.\n\nPorts:\nUnfortunately, I think most people in the market for this HP would want an SD card reader, and this laptop doesn’t have one. This isn’t a dealbreaker for me, but I know some people still want the convenience of sliding in an SD card without needing an additional dongle. Other than that, this laptop has all the ports you'd expect.\n\nI also don’t love that HP is still using a barrel-jack-style charger. Can we please just adopt USB-C as the standard? The USB-C port on this HP is for data transfer only, which is a missed opportunity.\n\nMy Wish List:\nThis laptop would have been exceptional with a few more creature comforts. There’s no backlight for the keyboard, the charger is proprietary, and the battery life is subpar. Had these features been addressed, this laptop would have been a slam dunk. That being said, if you're a student, casual user, or primarily run basic office applications, this laptop will do everything you need.",
      "rating": "4"
    },
    {
      "title": "Great on paper, but with a few flaws.",
      "body": "On paper, the HP 15-fd0127dx sounds like a standard, good, middle of the range laptop.  It has a colorful and clear 15.6” LED 1080p touchscreen that’s not the brightest at 300 nits, but still fine indoors in normal lighting.  It has an i7 processor, 16 gigs of DDR4 RAM which is more than enough for normal tasks and a bit beyond.  The 512 gig SSD drive is speedy and has enough storage for many.  It doesn’t even weigh 4 pounds so it’s light enough to carry in a backpack.  The speakers (on the bottom) are so-so ok but do the job. So it has all the basics and a bit more.  Unfortunately, there are a couple of glaring issues that I can’t get over. \n\nSetup was pretty standard. Your power comes from a 45w small power brick that unfortunately, isn’t USB-C… It’s a proprietary plug. You’ll need to reserve a bit of time, as the HP will have a quite large update out of the box once starting up.  Once up and running, things run smoothly with the processor and RAM working together.  Graphics are from an integrated IRIS Xe chip, but it works well enough.  Basic to mid-range games run fine on it, though heavy-hitter games needing higher frame rates might stutter a bit.  Image editing works fine with common editors and small video projects will run along fine as well. \n\nYou have a few ports, but they’re somewhat outdated by 2025 standards.  You have two older USB-A style ports, but today, most items have migrated into USB-C, and there is only one USB-C port on the left along with one USB-A, a HDMI port, and your headphone jack. The other side has another USB-A port and the proprietary power plug-in.  There isn’t a memory card slot.  A 720p web cam sits on top of the monitor which does ok in very good light – less so in lower light, and lacks in details and color accuracy.  \n\nMicrosoft Copilot is installed with Windows 11, so you can ask Copilot a variety of things to get help with writing, rewording documents, finding solutions to answers and much more.  This is a good feature that now is standard on most Windows laptops and is a good edition to this one.  I find myself using it more than I thought I would.  Use responsibly, as they say. \n\nI do not however, have a good time using the keyboard.  The keyboard on this model feels very flimsy and plasticky. The give of the keys just feels low-quality, as though they are from a much less expensive machine.  While usable, longer typing sessions become uncomfortable.  There is also no back lighting on this keyboard – unimaginable today, and especially on this level/price of laptop.  You do get a full numeric pad on the right, and standard controls via the function keys for the basics, including one dedicated to inserting emojis in applicable programs. Since having a good quality keyboard is one of the most important parts of a computer however, this is the biggest flaw on this model. There is no fingerprint reader. The trackpad is a decent size and feels fine, allowing for all basic gestures and clicks. The overall build quality of the laptop is good, but again, the keyboard quality drags it down considerably.\n\nThe battery charges reasonably quick and specs say you get just over 7 hours with varied use.  I found it to be more like 5 ½ hours of mixed use, at least the way I use it.  Not great but not the worst, but you will have to take the propriety charger brick/cable with you if you plan on using this all day out and about. \n\nUnfortunately, I just can’t recommend the HP 15-fd0127dx.  While the overall specs are fine and it runs ok from an operational standpoint, the plasticky keyboard with no backlighting ruins it for me. Having a propriety power plug in the age where most everything is charging and using USB-C cables is a negative, and not having more than one USB-C port today?  I’m afraid I just can’t give this one my thumbs-up.",
      "rating": "3"
    },
    {
      "title": "Affordable Laptop For Everyday Use",
      "body": "For those who require a dependable machine for both business and enjoyment, this laptop is a great fit since it balances portability and performance. This is my view of what this laptop provides,The machine has a professional yet contemporary look from its elegant, natural silver finish. For a laptop in this price category, the construction quality seems strong and the casing feels to be minimally flexible. Particularly for individuals who would want touch interactions or occasionally use the device in tablet mode, the touch screen adds a degree of ease. \n\nThough it's not the brightest panel available, the 15.6-inch Full HD touch screen is vivid and shows good color reproduction. Regarding regular productivity chores, streaming, and casual gaming, the display excels. On professional front the photo or video editing, you may feel the color accuracy and brightness deficient when compared to more upscale versions. Driven by its DDR4 16GB of RAM and 13TH Gen Intel Core i7 processor, this laptop easily manages most of the multitasking. From running several browser tabs to working with video editing tools, the performance is seamless. Quick boot times and speedy application launches guaranteed by the inbuilt 512 SSD storage greatly improve your experience. \n\nThough it can manage difficult jobs, this is a U-series chip, which means it's intended for efficiency rather than raw power, hence performance-wise it's not on par with H-series chips. The battery life of this device is among the usual points of contention. For those wanting a full day's work without a charger, it falls short even if it's sufficient for moderate use roughly 4–5 hours. Though it's a trade-off for the power it packs, if you travel frequently this is something to take into account. Crucially for productivity, the keyboard offers a good travel and comfortable typing experience. Though it's not a deal-breaker, the touchpad might use a little more responsiveness even if it is functionally sound. \n\nThe laptop has a good range of connectors, including USB-C, USB-A, HDMI and charge port which supports charging, screen output, and data transmission and Headphone Jack, nearly non-existent in present market. For connectivity particularly for people who utilize docking stations or must connect several peripherals, this is a major advantage. The laptop can warm under severe use, and the fans may grow somewhat noisy. For most users, this won't be a daily concern, for places where silence is required, this isn't ideal. \n\nBased on my usage i can confidently say the HP 15-fd0127 presents outstanding value. Though it's not the least expensive choice, it's fairly priced for what you get a strong processor, lots of RAM, and a touch screen. For the typical user, this laptop checks several criteria the trade-offs are in battery life and maybe display quality for creative workers. This laptop is a well-rounded one that performs for its class really brilliantly. For professionals, students, or anybody else depending on a consistent machine for regular computing chores with sporadic heavy lifting, it's perfect. Although it has several drawbacks, especially with regard to battery life and screen quality for professional work, its benefits in performance, build quality, and connectivity make it a good option for anyone trying to strike a mix between cost and competence. Should you be able to live with its concessions, this laptop will be useful for many years.",
      "rating": "4"
    },
    {
      "title": "A very practical laptop",
      "body": "This laptop has a very uninspiring name, it is just called hp laptop 15. It is thin and light. The back of the laptop is made of plastic but the build is sturdy and has very little flex. Build quality is very good. All the seams are tight.\nFor 15-inch laptop, this laptop is not heavy at all. Can easily be used as a travel laptop.\n\nThis laptop is also very speedy. Boot up very fast like just 13 seconds.\nEvery application or game I throw at it run fast and smooth. I am surprised that the integrated graphics by intel called iRIS xe can run games like Need for Speed smoothly. Playing Fortnite though is a bit too much but still playable with correct setting.\nBrowsing web or working or typing has no problem but the fan is always running when the power is plugged in. Luckily it is not loud. Running on battery is very quiet. \n\nLaptop this thin will get warm and this laptop does get a bit warm especially during Windows initial update and playing Fortnite but I think it manages quite well.\n\nTyping on the keyboard is comfortable, the keys are well spaced but sounds hollow when pressing down the keys. The only flaw of this laptop is no backlit keyboard! Why? Actually there is another thing I don't like, it requires me to register with email before I can proceed during the initial setup.\n\nThe touch pad is very responsive. No complain there.\n\nThe screen is bright and easy to my eyes. Color is rich but not too intense. \nThe screen Bezel size is acceptable. Touch screen is responsive. \n\nThe stereo speaker is very good, loud and clear.\n\n15-inch laptop is expected to have multiple ports, this laptop has two usb-a and one usb-c. In my opinion one usb-c is not enough.\nIt does have one hdmi port.\n\nThe power adaptor is small and light, easy for traveling. The laptop is charged using 3.5 mm connector, no usb-c charging.",
      "rating": "4"
    },
    {
      "title": "New HP laptop",
      "body": "Love my new laptop. Crisp color. Larger keys than my old one. Fast processing. Really light weight.",
      "rating": "5"
    },
    {
      "title": "Excellent purchase.",
      "body": "I've been using it for a month and I'm very satisfied. I'll highlight the speed as a strong point. There are some points that I expected more, but for the price and the way I use it, it meets my needs: Battery life leaves something to be desired. Another point is that, out of nowhere, the Bluetooth mouse or mouse stops working. The pointer follows the commands, but when I click to select it, it doesn't obey, making it necessary to restart the laptop.",
      "rating": "5"
    },
    {
      "title": "HP PC",
      "body": "Easy to set up, fast, does have a learning curve with Windows 11, PC is light, buttons soft.",
      "rating": "5"
    },
    {
      "title": "Fast computer",
      "body": "Fast computer. Nice touch screen with lots of memory. Looks good.",
      "rating": "5"
    },
    {
      "title": "HP",
      "body": "Love my HP Laptop.  Fast easy to use.  Lightweight",
      "rating": "5"
    },
    {
      "title": "memac",
      "body": "lighter than previous model  right size keys   faster",
      "rating": "5"
    },
    {
      "title": "Laptop for a good price",
      "body": "Easy to use and fast for the price.  Touch screen which makes it easier",
      "rating": "5"
    },
    {
      "title": "Sleek, sexy & affordable!",
      "body": "Love my new portable PC! I was in and out of the store in under 15 minutes. It's sleek, fast and really lightweight. Was easy to set up -- fast walk through and I was up and running. Bought it for travel, perfect pick thanks to my salesguy there.",
      "rating": "5"
    },
    {
      "title": "Great replacement laptop",
      "body": "My old Dell laptop started giving me problems, I replaced the battery and a week later it stopped working unless it was plugged in. So I purchased a HP laptop which was faster and more efficient and it even had a touchscreen. It works great!",
      "rating": "5"
    },
    {
      "title": "Very Happy",
      "body": "It is very fast and intuitive. the battery life is not the best but it is just fine for me. It runs games well even though it is not a gaming pc. It checks all boxes.",
      "rating": "5"
    },
    {
      "title": "My Laptop from Staples",
      "body": "Enjoying the experience- clear 17' screen, easy navigation.",
      "rating": "5"
    },
    {
      "title": "Ms",
      "body": "Fast access to internet, light weight, easy to navigate.",
      "rating": "5"
    },
    {
      "title": "Good for the price",
      "body": "Long battery life. Fast processor. Excellent display",
      "rating": "5"
    },
    {
      "title": "Great buy",
      "body": "Laptop does everything I need. Fast and display is great also",
      "rating": "5"
    },
    {
      "title": "I recommend this product",
      "body": "I’m not a gamer but this computer is lightweight and works fast. I recommend this product.",
      "rating": "5"
    },
    {
      "title": "Excellent laptop computer.",
      "body": "This is a great product. I easily transferred the data from my old computer to the new one. I use a mouse most of the time, but the touch screen is very handy when I want to rest my mousing hand. I am new to Win11, but it is faster and easier to use than I expected.",
      "rating": "5"
    },
    {
      "title": "HP touchscreen",
      "body": "A very powerful computer and a small package. The touchscreen is especially helpful when doing certain Internet tasks. It’s small enough to fit easily into most carry cases and backpacks, But large enough to get work done. This laptop is a very good choice for the price and for the overall performance package it contains.",
      "rating": "5"
    },
    {
      "title": "HP",
      "body": "I'm very satisfied with my new HP PC. From the very first start-up, it has proven to be fast, efficient, and reliable. The build quality is excellent, and the modern design gives it a professional look. Perfect for both work and entertainment. A great investment.",
      "rating": "5"
    },
    {
      "title": "Great work laptop",
      "body": "Great new business laptop. Even though we normally use a docking station, when just using the laptop as a stand alone, the screen is large enough to have multiple windows open at the same time.",
      "rating": "5"
    },
    {
      "title": "Great computer",
      "body": "As usual the buying process online was flawless. This computer was easy to set up & easy to use. This computer was perfect for my needs. Would recommend this to friends.",
      "rating": "5"
    },
    {
      "title": "Great computer for the money",
      "body": "Works as it should.  Easy set up.  No issues so far.  Fast enough and works well.  Lightweight and nice design.  Would recommend to others.  Charges up quickly and handles all the personal and business applications as needed.",
      "rating": "5"
    },
    {
      "title": "Very good for a basic work.",
      "body": "So far, very good.  I just use it for work and  personal tasks,  not gaming at all. I do not need any sophisticated  features and I was particularly interested in the ports that this model has, so my needs are very basic.   It's fast,  not intrusive and not heavy.  Keyboard is soft,  very comfortable and numeric pad was a must for me.  It would have been great to have at least 1 Tera..  I didn't test the battery life yet....",
      "rating": "5"
    },
    {
      "title": "Great Laptop Computer",
      "body": "very nice unit, really like that it has numbers key pad on the right side like a desk top key board, much easier to use than hunt for numbers in top row. The darker keys are better too.",
      "rating": "5"
    },
    {
      "title": "Best Buy ROCKS!!!",
      "body": "I recently bought the HP 15.6 Touch Screen Laptop 16 GB and I absolutely love it. I walked in to BestBuy not having any idea what I was looking for, I am not really computer savvy let's just say...LOL. So a sales person came over and asked me, \"Is there anything I can help you with\",  \"BIG MISTAKE\", and I replied, \"Well you sure can\", Golly, I must of asked him over 50 questions about computers, and never once did he ever show any signs of frustration with me. Awesome job Best Buy for your excellence in sales staff and products that you carry. This laptop is awesome,  It is so fast, and the touch screen works perfect. I would recommend this laptop to family and friends.",
      "rating": "5"
    },
    {
      "title": "Amazing laptop for the price point.",
      "body": "The laptop runs smoothly. It is a great laptop at the price point. You can multitask and enjoy content, gaming, and do office work at the same time. A great value and fast RAM.",
      "rating": "5"
    },
    {
      "title": "Laptop Review",
      "body": "Excellent Performance for Work and School\nI’m really impressed with this HP laptop. The Intel Core i7 and 16GB of RAM make multitasking a breeze—I can have multiple tabs, Excel sheets, and video calls running without any lag. The 512GB SSD ensures super-fast boot-up and load times. The touchscreen is responsive and great for quick navigation. Definitely a solid choice for productivity.",
      "rating": "5"
    },
    {
      "title": "Love my new PC!!!",
      "body": "So, for years my husband has been buying refurbished PCs for me and they don't last long...I have a pile of them just sitting here. After the last one bit the dust he ordered another generic brand I've never heard of. I had enough and started doing my own research to find my new best friend. I found this one at Best Buy and bought it on the line and pick up was quick and easy. I must say, I love this PC! It's perfect and I have high hopes that it will last longer than all the others combined. Thank you Best Buy!",
      "rating": "5"
    },
    {
      "title": "Great value",
      "body": "I'm very pleased with this computer; it does everything I need. The graphics are clear and crisp and the colors vivid. Set up was easy and it came with a trial antivirus. The price was actually less than I was expecting to have to pay for this much memory. If I were a gamer, I might want more, but I'm not, so this is fitting my needs and wants very well.",
      "rating": "5"
    },
    {
      "title": "HP 15.6 laptop",
      "body": "Good product -easy setup for the non-techies like me. Screen size is large enough to have multiple windows open and used simultaneously .",
      "rating": "5"
    },
    {
      "title": "My everyday laptop",
      "body": "Not the most expensive laptop in the HP lineup, but perfect for everyday use for emails and financial matters. My last laptop was a much higher priced edition that I used while attending school for a bachelor’s program and was just what I needed for writing papers. Unfortunately after 12 years it decided to die on me, forcing me to purchase a new computer. This new laptop does the same thing for much less money, albeit it’s not nearly as attractive as my last one.",
      "rating": "5"
    },
    {
      "title": "so far it is OK",
      "body": "The laptop is fast, it is not used for gaming so I can't attest to that but for normal web surfing and a few other things it works. While I hate win11 there is no longer a choice since microsoft decided we all need to upgrade. This replaces and old laptop that had gotten so slow it wasn't even usable.\nThe battery doesn't last long though, seems none of companies live up to their claims when it come to battery life.\nOverall it seems to be a decent computer",
      "rating": "4"
    },
    {
      "title": "HP laptop review",
      "body": "Great computer, easy to use interface. Would choose this product, again, if given the chance and would purchase from Best Buy. Great and helpful service.",
      "rating": "5"
    },
    {
      "title": "good laptop for the price",
      "body": "For the price point, this computer has done a great job for my needs. I am not a gamer, so cannot speak to that, but for maintaining household files, photos, general research, using word, spreadsheets and power-point, and travel planning, my laptop has worked beautifully. Only downfall is there is a relatively short battery life before needs recharge.",
      "rating": "5"
    },
    {
      "title": "HP Pavilion performing as advertised",
      "body": "The computer has performed as advertised. Although the associate may have misspoken when telling us about some of the specs for the laptop. He mentioned that it had a backlit keyboard. but as of yet I have not found a way to make the keyboard light up. But that is not as big deal, as our last laptop did not have this feature. The HP laptop works fine and has performed as we had hoped.",
      "rating": "4"
    },
    {
      "title": "Best laptop for multi-tasking and remote work need",
      "body": "To my surprise, this is a thin, sleek, and lightweight laptop. Core i7 processor helped me to handle multi-tasking without any lags. Sometimes fan noise is terrible while playing any games. Speaker has descent volume to fill the living room ambience. Keys are sturdy and good for long life usage. I definitely recommend this laptop as basic office usage and remote workers.",
      "rating": "4"
    },
    {
      "title": "Glad I bought an HP.",
      "body": "I have always had an HP computer but purchased a different one because of the price -MISTAKE.  I had to bring it back and bought this HP and I am very very happy.  I like the improvement they have made with the opening hinge.  Previously it has 2 small one and mine broke.  Now this new one has a nice, all the way across, hinge.  Much sturdier.",
      "rating": "5"
    },
    {
      "title": "Mr",
      "body": "screen could be brighter learning features very good visuals designations right on very fast",
      "rating": "5"
    },
    {
      "title": "HP makes good stuff!",
      "body": "Very pleased with this laptop.  Previous laptop is a HP Pavillion that is 13 years old and still works like a new machine but it is not equipped  to upgrade to Win 11.  So when I finish getting everything moved over to this new machine, I will convert the old one to LINUX, and hope to get many more years of service out of it!",
      "rating": "5"
    },
    {
      "title": "Laptop of the future",
      "body": "Its touch screen is fantastic and its application and óperating system are incredible",
      "rating": "5"
    },
    {
      "title": "HP Laptop",
      "body": "This laptop is great to use, affordable, and light weight.  It does everything my desktop does and unlike my desktop it is portable.  I actually bought this for my wife, and she loves it and does not desktops like I do. I am thinking that maybe I should get one for myself because it is portable.",
      "rating": "5"
    },
    {
      "title": "Great for your buck",
      "body": "This laptop works great. It's super facts and easy to use. Will most definitely Get another one for my son",
      "rating": "5"
    },
    {
      "title": "Good laptop for the price.",
      "body": "A solid computer for regular home computing.  Lighter and faster than the 6 year-old model we replaced.",
      "rating": "5"
    },
    {
      "title": "My Best Buy",
      "body": "Best upgrade from outdated one and quicker. Everything was transferred from my old computer to my new computer.",
      "rating": "5"
    },
    {
      "title": "Ta laptop",
      "body": "Computer is fast and works great with photoshop and autocad.",
      "rating": "5"
    },
    {
      "title": "laptop",
      "body": "nice computer and easy to use. Like the larger screen.",
      "rating": "5"
    },
    {
      "title": "A good pc on a budget price",
      "body": "A good cost-effective computer. Boughtit on sale. Has a i7 processor, 16 GB RAM and 512 GB storage. Can handle practically all tasks. Smooth keyboard and sensitive touchpad. Easy to install, had it ready in half an hour. Also the screen colors are easy on the eye.",
      "rating": "5"
    },
    {
      "title": "This laptop does it all for my work needs",
      "body": "Very happy with the purchase.  It's a great processor, enough memory for me (had 12g before and it was sluggish).  I use it as a work laptop and happy with it's functions.  Numeric keyboard was a must. Picture quality is great.",
      "rating": "5"
    },
    {
      "title": "Lap top",
      "body": "The Best Buy employee was very knowledgeable when there to buy a certain computer came out with what I actually needed. The computer has been doing what I needed to do. I did a great purchase. I’m very happy for a great price.",
      "rating": "5"
    },
    {
      "title": "PC",
      "body": "I like the touchscreen it is very responsive and a lot you can do too make it feel like yours",
      "rating": "5"
    },
    {
      "title": "Windows Laptop",
      "body": "Just what I was looking for.  Touch screen is nice but the mousepad is a little wonky. Got a zoom workplace for a remote job and it does the job.",
      "rating": "4"
    },
    {
      "title": "Great purchase",
      "body": "Great product. Being able to use touch screen is awesome.",
      "rating": "5"
    },
    {
      "title": "Owner",
      "body": "Very nice and functional laptop. Snappy response time, crisp screen and imaging, large keys.",
      "rating": "5"
    },
    {
      "title": "HP Laptop",
      "body": "My new hp laptop is doing great! I am enjoying using it and getting everything set up. Look forward to it's dependable service!  The one thing I'm working on is better sound and ability to increase the volume better, maybe adding speakers.",
      "rating": "5"
    },
    {
      "title": "New Windows 11 Computer",
      "body": "The problem is more me than the computer.  I'm so use to Windows 10 that I am having a hard time finding everything on this computer. It's just going to take a bit of time and working on it to adjust to it. I like how it types and that it has the number keys.",
      "rating": "4"
    },
    {
      "title": "Slick!",
      "body": "Excellent product, touch screen and other features were great and easy to operate",
      "rating": "5"
    },
    {
      "title": "HP",
      "body": "It was ok. I just think that you should have employees trained to be able to assist customers that are not tech savvy. The person was good, but he had to keep asking other employees for assistance",
      "rating": "5"
    },
    {
      "title": "HP",
      "body": "Lightweight and Compact, All the necessities in one.",
      "rating": "5"
    },
    {
      "title": "HP for domestic use",
      "body": "This HP computer has a great price and, after testing it extensively, I can say that it was an excellent choice. It has great performance, the battery is acceptable, the screen is of good quality, and it is very comfortable to use daily. I compared it with other models and did some performance tests, and the results were very positive. In addition, the reviews from other users confirm my experience. In the end, I was very satisfied with the purchase.",
      "rating": "5"
    },
    {
      "title": "The best Laptop for my money.",
      "body": "I bought this laptop for my niece as belated Christmas/birthday gift and she was elated with it,  plus it's a touch screen her happiness has known no bounds. \nThe staff that helped me at the best buy store where I purchased the computer was so knowledgeable about computers that really helped me in choosing this computer.",
      "rating": "5"
    },
    {
      "title": "Great value laptop",
      "body": "The startup was straightforward, and once I logged into my MS account it was running smoothly, and installing few applications also was quick! Browser is fast (Edge), and Google Chrome runs nicely well. I am happy with the display colors and great performance.",
      "rating": "5"
    },
    {
      "title": "Great laptop",
      "body": "Great computer. Very satisfied and the touch screen feature is great.",
      "rating": "5"
    },
    {
      "title": "Excellent choice.",
      "body": "Excellent purchase.  Price was in line with competitors and even a bit lower because of the sale.  I already had a HP laptop for work so wanted another one for personal.  I do a lot of 3d printing so needed something that could handle the storage of files.  This is a great laptop.  I'm very please with my purchase.",
      "rating": "5"
    },
    {
      "title": "Nice computer",
      "body": "I haven't used it much yet, but got it set up.  It's smaller and sleeker than my last laptop which is nice.  If you have exchange emails you will not be able to use the new outlook however, you can dial back to the old outlook and use that.  But all in in all, a good purchse.",
      "rating": "4"
    },
    {
      "title": "Good laptop for students",
      "body": "Good laptop.\nSleek and large screen.\nWeight wise bit heavier.",
      "rating": "5"
    },
    {
      "title": "Great Value!",
      "body": "This laptop was purchased when it went on sale.  I had been looking for a replacement that would have more memory and storage space than my current laptop.  This particular laptop met all my needs and more, but the cost at the time was more than I could afford.  When it went on sale, I headed for our local Best Buy store and purchased it!",
      "rating": "5"
    },
    {
      "title": "Intel Corei7",
      "body": "Meets expectations. Works great! Display is perfect for my needs.",
      "rating": "5"
    },
    {
      "title": "Great product at a great price",
      "body": "I am very pleased with this product.  It is lightweight and the optics are great.  The speed of processing is much improved.  You can't go wrong with this laptop especially if you don't do much gaming.",
      "rating": "5"
    },
    {
      "title": "Very happy with HP laptops",
      "body": "I've been ordering these for our employees for some time now and have never had an issue.  Best bang for your buck.  We used to use Microsoft Surface laptops but for around half the price you can't beat HP in my opinion.  Plus they have multiple USB ports which much more convenient than having to rely on USB hubs.",
      "rating": "5"
    },
    {
      "title": "Love herrr",
      "body": "Got this computer for work and she is great. Everything works smoothly and apps open quickly. Only con I would say is battery life is not as long as I expected. (4/5 hours when connected to all my work programs) but I may just need to adjust settings. Overall she's a great laptop!",
      "rating": "4"
    },
    {
      "title": "New Laptop",
      "body": "No complaints with my laptop. Easy to install and easy to work",
      "rating": "5"
    },
    {
      "title": "Laptop HP",
      "body": "Whoops I put the review on my case for the laptop! But this laptop is very reliable it has many features such as using Spanish on screen. I really love this laptop. Best one I have had yet to date! Thanks HP and Best Buy your the best!",
      "rating": "5"
    },
    {
      "title": "HP-15.6",
      "body": "Everything I asked for in a laptop. \ntouch screen.",
      "rating": "5"
    },
    {
      "title": "Best/HP….Great Combo!!",
      "body": "Best Buy staff was helpful from purchase to set up. They transferred all my date that I wanted transferred to new PC. Easy to use and well made. Keyboard is excellent.",
      "rating": "5"
    },
    {
      "title": "Office Manager",
      "body": "Much faster than my other computer which was a Dell.",
      "rating": "5"
    },
    {
      "title": "Laptop and customer service",
      "body": "This laptop is great! I can use the keyboard, a mouse or touch screen. The customer service at the time I was shopping for a new laptop was great. She was very knowledgeable and extremely helpful.",
      "rating": "5"
    },
    {
      "title": "ITS A MAJOR UPDATE",
      "body": "SO FA SO GOOD ITS GOING GOOD. i WAS A LITTLE BIT DISAPPINTED IN THE BEGINNING I PURCHASED THE WRONG EXTENDED MONITOR BUT I HAVE THE RIGHT NOW NOW AND IT WORKS.",
      "rating": "5"
    },
    {
      "title": "New Laptop",
      "body": "It is an easy to use laptop, but at it's price point it isn't overly sturdy.",
      "rating": "4"
    },
    {
      "title": "Good unit",
      "body": "It is a good solid performer and is doing everything I have asked so far. I haven't started any coding on it yet but I don't expect any issues. It seems like a good value at the price.",
      "rating": "5"
    },
    {
      "title": "I DO REGRET MY CHOICE",
      "body": "I do not regret buying my laptop from Best Buy. It is value for money and very effective. I would 100% recommend it to a friend to buy it from Best Buy.",
      "rating": "5"
    },
    {
      "title": "Laptop runs great",
      "body": "Assistance was prompt and informative. The Geek Squad was very helpful and timely. I've used Geek Squad for years and will only buy my electronics from Best Buy. Highly recommended",
      "rating": "5"
    },
    {
      "title": "HP",
      "body": "Wonderful device, came in perfect condition runs superior to other laptops in its field as well. The new camera features allow a more realistic input to what the consumer wants to create. Finally the touchscreen makes it very convenient for any and all activity within device",
      "rating": "5"
    },
    {
      "title": "Great computer at a budget",
      "body": "The computer does what is it supposed to, good speed good memory, nice big screen \nI just dont like the case to be plastic instead of metal",
      "rating": "5"
    },
    {
      "title": "Nice little computer",
      "body": "Good computer. Does what I need it to do.  The sales person was knowledgeable and easily understood my needs and recommended this computer.",
      "rating": "5"
    },
    {
      "title": "Confused",
      "body": "Would love to rate the actual product but there's so much I don't know about it. When I tried to set it up like my old laptop there were so many unanswered questions that I wasn't able to answer and had no one to ask.",
      "rating": "4"
    },
    {
      "title": "Great specs at a great Member price!",
      "body": "Saw this Member deal and had to have it! Great specs for everyday computing and some light gaming. Great display for movie watching although it will reflect glare.",
      "rating": "5"
    },
    {
      "title": "HP Laptop Great Value",
      "body": "This laptop works great! It's fast and has great battery life. It's the second of this laptop I purchased this year. Great laptop for value and performance!",
      "rating": "5"
    },
    {
      "title": "key is everything.",
      "body": "This is a great computer, when it comes down to personal preference. It wasn't for me 100 percent. I enjoy the back lit keys. I also prefer a certain type of key style.\n Otherwise, this computer run fantastic. Graphics are wonderful, with fast start up.",
      "rating": "5"
    },
    {
      "title": "HP Laptop Review",
      "body": "I love it! I thought I'd need Geek Squad to come and hook up my printer, but i was able to do it myself.\n, it wasceasy as 1, 2, 3.",
      "rating": "5"
    },
    {
      "title": "Great deal on an HP Laptop",
      "body": "This is a great laptop for the price and is working well for our staff. It seems solid, unlike some that we’ve purchased in the past that were rather flimsy, the keys have a nice touch, plenty of ports, and overall we’re happy. It’s also readily available which is refreshing as we’ve purchased 2 more following our initial order.",
      "rating": "5"
    },
    {
      "title": "Great for working at home and school.",
      "body": "This computer has everything you need if you only need it for school or basic work assignments. The price is fantastic.",
      "rating": "5"
    },
    {
      "title": "Tower to Laptop",
      "body": "So far, this HP laptop has performance as described. The  Laptop was setup as a Desk workstation using an external keyboard and monitor. Utilizing a small docking station, all the desired peripherals are connected and operating well.",
      "rating": "5"
    },
    {
      "title": "Having problems with pc after only 28 days.",
      "body": "Laptop was working great  until this week.  Thursday when I booted up the screen remained black.  After trying several times, I took it back to Best Buy location where the associate checked out the problem and stated that they would have to send it to Kentucky to be repaired.  The back light is corrupted.  He states that it should be back in 2 weeks.  So I've had the computer less than 30 days and already having a big problem.  One would think a brand new pc wouldn't have these problems.",
      "rating": "3"
    },
    {
      "title": "HP Touch screen laptop.",
      "body": "This is a substantial laptop.  Love the touch screen.  Super fast responses to searches, etc.  I’m very happy with it.",
      "rating": "5"
    },
    {
      "title": "VERY sold mid-range budget computer",
      "body": "The HP 15-fd0127dx is a VERY solid mid-level budget laptop with specs suitable for all but the most resource-intensive applications such as those dealing with 3D graphics.\n\nThis processor for this laptop is a 13th generation i7-1355U, running at 1700 Mhz with 10 cores. This is a small step up from the Intel 12th Generation Core i7 processor in an earlier version of the 15-fd0000 line, the 15-fd0107dx. The Microsoft PassMark rating for the processor is 16710.6, which is respectable at the 58th percentile. The PassMark ratings for the 16 GB memory and 512 GB SSD are very strong, at the 77th and 82 percentiles. Only the 3D graphics rating was below the 50th percentile (31st), and the overall PassMark rating was exactly at the midpoint, 50th percentile. Overall, a very solid computer at a reasonable price.\n\nI weighed the HP 15-fd0127dx with a postage scale and was surprised that this 15.6\" screen laptop was not much heavier (3 lbs., 9.5 oz) than my 13\" screen HP Spectre (3 lbs., 2 oz.). The Spectre has served me extremely well over the past five years, as have previous HP Envy and Spectre laptops I have owned. In my experience, HP laptops are real winners, which is why I did not hesitate to get the 15-fd0127dx.\n \nThere are a half-dozen features of the 15-fd0127dx I am ambivalent about.\n\n1. The laptop uses a Chicony a18-135p1b charger with a standard plug rather than charging through a USB-C port like my Spectre. This frees up a USB port, but also means I am totally dependent on the provided charger. I cannot, for example, use my Anker PD USB charger in a pinch. \n\n2. I like the large keyboard with a number pad, but there is no backlighting.\n \n3. The three USB ports are adequate, but two are A and only one is C; given that C is the new standard, it should have been two Cs and one A. Also, the C USB port is not a Thunderbolt port.\n\n4. The SAMSUNG MZVL8512HELU-00BH1 512 GB SSD will probably be adequate for most users, but I actually replaced the SSD that came with my Spectre with a 1 TB SSD and have filled that drive to just over 512 GB. I will have to either refrain from copying my photos and videos to the new laptop or (more likely) replace the 512 GB drive with a 1 TB drive.\n\n5. The HP 15-fd0127dx includes an HDMI connector, always useful when traveling for connecting the laptop to a large-screen TV in a hotel or Airbnb, but probably unnecessary in day-to-day work at home because the 15.6\" screen is big and beautiful. \n\n6. The HP True Vision HD camera is fine for things like video chat, but it is not IR, which means Windows Hello facial recognition is not available for logging in.\n \nSome users might question why this laptop is made of plastic and not aluminum like the Spectre line and why the hinge does not allow folding back the screen to use in tablet mode. If you want those features, you should buy a more expensive laptop. Honestly, unless you are extremely careless with the laptop, you will not break the hard plastic construction. And using a laptop this big as a tablet does not make much sense. The HP 15-fd0127dx may lack a few features, but that is understandable, given its low price, and I think that budget-minded users will be very happy with the features it does have and its excellent performance. I certainly am.",
      "rating": "5"
    },
    {
      "title": "Fantastic Laptop!",
      "body": "I am really enjoying this laptop. It is fast, sleek, great screen and easy to maneuver through different applications",
      "rating": "5"
    },
    {
      "title": "mr",
      "body": "Finally decided to get rid of my  desk top and was looking for some thing  faster  and bigger screen.   So far  it is working  good for me.",
      "rating": "5"
    },
    {
      "title": "Great Buy at Best Buy",
      "body": "Great bang for the buck. It's got everything you need for just basic work. Very lightweight and easy to work with.\nVery pleased with this.",
      "rating": "5"
    },
    {
      "title": "My New Laptop",
      "body": "We really Love it, is really fast and the touchscreen give us more facility to look for something or create things, is not heavy at all, is just perfect for the job",
      "rating": "5"
    },
    {
      "title": "Laptop Computer",
      "body": "Great laptop to.replace my out dated one!! Acuurant description of the product! Nice display quality and easy to set up. Would recommend!",
      "rating": "5"
    },
    {
      "title": "Easy for Old and New",
      "body": "This computor is very fast, easy to operate; and navagate.      Considering I am both a senior and a beginner, that is saying alot. Bravo!!",
      "rating": "5"
    },
    {
      "title": "HP laptop intel i7 touchscreen",
      "body": "This laptop is great. I like the touchscreen and that its lightweight. It runs fast and i plan to use it for a long time",
      "rating": "5"
    },
    {
      "title": "Great",
      "body": "It was worth the expense.  The Geak Squad is a great job in moving my files from my desktop to my laptop.",
      "rating": "5"
    },
    {
      "title": "HP Laptop",
      "body": "I love my HP laptop. My previous pne was an HP. I have gotten good service and long use with my HPs. I am quite satisfied !!!!!",
      "rating": "5"
    },
    {
      "title": "Great service",
      "body": "Employee was super helpful in helping me find the right laptop for my business needs. Didn’t just try to tell me the most expensive one, taught me about computers and what is important to have to match your needs. A laptop has been amazing and easily fulfilled all my needs to run my business.",
      "rating": "5"
    },
    {
      "title": "Best possible solution",
      "body": "This was the best possible. We have 4 guys that needed computers in our company. Our IT guy recommended 3 possibilities. I love HP and have had a great computer that has lasted 10 yrs. So for me this was my choice.",
      "rating": "5"
    },
    {
      "title": "Excellent college laptop",
      "body": "Excellent product for my daughters college courses. Long battery life. Good performance. Nice touch screen ability when needed.",
      "rating": "5"
    },
    {
      "title": "Love it",
      "body": "It’s really good \nI love it because I only use it for work and it’s actually pretty fast\nBattery life it’s actually pretty good",
      "rating": "5"
    },
    {
      "title": "Nice for the price",
      "body": "Fast. Easy to set up. Touch screen is very responsive. Memory and storage are good, as is the display.",
      "rating": "5"
    },
    {
      "title": "Excellent PC",
      "body": "The HP 15.6 inch touch screen was very easy to set up.  It is quick to respond and can handle many tabs being open at once if researching on the internet, Additionally, it was on sale.  I'm very pleased with it.",
      "rating": "5"
    },
    {
      "title": "Laptop delight.",
      "body": "T went with the recommendation of your computer person and could not be happier with the purchase.",
      "rating": "5"
    },
    {
      "title": "HP Laptop Review",
      "body": "Fantastic computer!  Touchscreen with nice storage at a good price.  It was well worth the money.",
      "rating": "5"
    },
    {
      "title": "HP laptop",
      "body": "Very solid pc! Fast and dependable while also responsive. Not chopped full of bloated software",
      "rating": "5"
    },
    {
      "title": "Excellent laptop - everything runs flawlessly",
      "body": "Excellent laptop - very fast, and has a sleek and modern design. Everything runs flawlessly. Picture quality is excellent, sound is also very good.",
      "rating": "5"
    },
    {
      "title": "HP Laptop",
      "body": "I am happy with the performance of my new HP laptop. The speed and processing has been great!",
      "rating": "5"
    },
    {
      "title": "Mandatory upgrade",
      "body": "I had to upgrade to \"an i7 with at least 16GB\" for work. After using it for a few weeks, I can say I really like this laptop. The touchscreen has come in handy, especially when I'm working in the car.",
      "rating": "5"
    },
    {
      "title": "Happy",
      "body": "Everyone was very helpful and pleasant, took time to listen to my questions and answered so I understood. Thank you.",
      "rating": "5"
    },
    {
      "title": "HP Laptop Great",
      "body": "Love the laptop touch screen. My wife enjoys the services of the CPU. It really helps us with financial decisions.",
      "rating": "5"
    },
    {
      "title": "Bought this for my teen to play online games.",
      "body": "I bought this for my teen to play online games. I have not heard any complains from him. He loves it and it looks very crisp.",
      "rating": "5"
    },
    {
      "title": "Small business computer",
      "body": "Great laptop for the price. I would recommend this purchase and plan to another one soon",
      "rating": "5"
    },
    {
      "title": "A good mid-price computer",
      "body": "A good mid-range price computer. Keyboard is a little rubbery and the location of the On/Off button doesn't make sense.  Otherwise all good and works well.",
      "rating": "4"
    },
    {
      "title": "HP laptop",
      "body": "Easy to operate.  Nice screen and size of the laptop, makes it easy to travel with.  Live the touch screeb",
      "rating": "5"
    },
    {
      "title": "HP laptop",
      "body": "Very fast and light weight.  Still learning Windows 11 after years with Windows 10.",
      "rating": "5"
    },
    {
      "title": "Good Computer",
      "body": "This computer does everything I need it to do. Set up was straightforward and easy.",
      "rating": "5"
    },
    {
      "title": "HP Laptop",
      "body": "Very impressed with new laptop.  Must faster than old laptop that was 14 years old.",
      "rating": "5"
    },
    {
      "title": "Laptop review",
      "body": "Very fast and easy to navigate. I'm enjoying it so far. It's perfect for what I need to do with it.",
      "rating": "5"
    },
    {
      "title": "Excellent service",
      "body": "Excellent product and response from Best buy products very necessary for my8",
      "rating": "5"
    },
    {
      "title": "Laptop",
      "body": "Needed a replacement from an old notebook... So far, so good.  Good results!",
      "rating": "5"
    },
    {
      "title": "I",
      "body": "Very nice laptop handy smooth and powerful only downside is the battery life",
      "rating": "5"
    },
    {
      "title": "Great Laptop",
      "body": "Love the screen size, speed with the i7 and sleek design.  Love Copilot, too",
      "rating": "5"
    },
    {
      "title": "HP 15.6\"",
      "body": "Very good first laptop for my 14 year old son.  Overall, a little bulky, and the screen is average in quality.  Long battery life is a plus.",
      "rating": "4"
    },
    {
      "title": "HP laptop",
      "body": "Nice and good product and I loved it and the performance is smooth and fast",
      "rating": "5"
    },
    {
      "title": "Very good laptop",
      "body": "nice use of technology. It has i7 which can be use for AI purpose as well.",
      "rating": "5"
    },
    {
      "title": "Decent!",
      "body": "it's a decent laptop. Performance is good enough for home activities. Coming from a Lenovo Thinkpad, touchpad here is a total downgrade. It reaches expectation.",
      "rating": "4"
    },
    {
      "title": "Solid Laptop, Great Price",
      "body": "This computer has good performance at a great price point.  The purchasing experience was quick and hassle-free.",
      "rating": "5"
    },
    {
      "title": "Great price",
      "body": "Great product disappointing staff support. I loved their price alerts.",
      "rating": "5"
    },
    {
      "title": "GOOD PC",
      "body": "A great product meets the needs I had and gives me more than expected I highly recommend it.",
      "rating": "5"
    },
    {
      "title": "excellent place to buy what you are looking for",
      "body": "Very good service, everyone was friendly and professional. They helped me find what I was looking for. Recommended. Everything is of quality.",
      "rating": "5"
    },
    {
      "title": "Smart move. . .",
      "body": "I am very happy with my new HP laptop.  I'm still becoming familiar with it; however, it seems to be what I wanted.",
      "rating": "5"
    },
    {
      "title": "New HP Laptop",
      "body": "This a good low priced Laptop. You get what you pay for as they say. I have had no problems. I don't like all the bloatware loaded on new laptops and it takes time to get rid of it. Its light weight (all plastic)",
      "rating": "5"
    },
    {
      "title": "It was a good purchase",
      "body": "It's a good machine, although they could lower the prices a little.",
      "rating": "5"
    },
    {
      "title": "MyNewLapTop",
      "body": "I love  my new laptop. I still have not learn all of the things it can do but I am eager.",
      "rating": "5"
    },
    {
      "title": "Hp laptop",
      "body": "Works very well use it as my tuning laptop and it handles it well, really smooth and no lag on input.",
      "rating": "5"
    },
    {
      "title": "well worth the cost",
      "body": "good response and great screen.  Easy to set up for every day use.",
      "rating": "5"
    },
    {
      "title": "HP laptop",
      "body": "Great laptop. Great service. The tech went over everything I needed to know about the laptop. My files from my old computer where transfered without any problems.",
      "rating": "5"
    },
    {
      "title": "Best Buy is always the best",
      "body": "Good one and I love this product .  Please keep up the best deals",
      "rating": "5"
    },
    {
      "title": "My sisters love it",
      "body": "They have been using it everyday! They love to write stories and watch movies",
      "rating": "5"
    },
    {
      "title": "Love my new laptop!",
      "body": "Great laptop, love it, easy to navigate and very sleek in style.",
      "rating": "5"
    },
    {
      "title": "Excellent",
      "body": "It's a great laptop, and I got it at a great price. I later bought two more for the office staff.",
      "rating": "5"
    },
    {
      "title": "Little old lady",
      "body": "Nice, now if I can figure out how to operate. Getting use to new computer at 80 is overwhelming.",
      "rating": "5"
    },
    {
      "title": "Good!",
      "body": "I like it! \nIt works good! No problem. \nI recommend this item",
      "rating": "5"
    },
    {
      "title": "Excellent laptop",
      "body": "Excellent laptop. Well worth the price.HP has proven to be excellent manufacturer.",
      "rating": "5"
    },
    {
      "title": "HP Laptop",
      "body": "Touch screen is great.  Like the assist that is available",
      "rating": "5"
    },
    {
      "title": "V.Dixon",
      "body": "Very happy with my purchases. Needed more resources to maybe speed things up a little.",
      "rating": "5"
    },
    {
      "title": "Good Buy",
      "body": "Excellent quality and a good price. Battery seems to decline a little quickly.",
      "rating": "5"
    },
    {
      "title": "nice and affordable laptop",
      "body": "this is a nice replacement for one I had and more memory",
      "rating": "5"
    },
    {
      "title": "Great HP laptop",
      "body": "So far I have no issues and enjoy my laptop.  \nThank you",
      "rating": "5"
    },
    {
      "title": "Great purchase",
      "body": "Excellent functions   Slim and easy to use \nDoes not disappoint with anything",
      "rating": "5"
    },
    {
      "title": "Memorial Day Sale!",
      "body": "Great price for this processor, hard drive, and memory!",
      "rating": "5"
    },
    {
      "title": "Happy Customer",
      "body": "The laptop is working great.  Got it for a great price.",
      "rating": "5"
    },
    {
      "title": "HP Laptop",
      "body": "A good laptop especially for the sale price.\nIt does everything I need in a laptop, good battery life.\nI would recommend it for general use.",
      "rating": "4"
    },
    {
      "title": "Affordable Laptop Purchase",
      "body": "It was for my son.  He seems to be very happy with it.",
      "rating": "5"
    },
    {
      "title": "HP computer",
      "body": "Great quality, works well and camera is great quality!",
      "rating": "5"
    },
    {
      "title": "Laptop",
      "body": "I got a laptop \nHigh speed and product \nI recommend my friends to buy this laptop",
      "rating": "5"
    },
    {
      "title": "Wife's Computer",
      "body": "Ibought this computer for my wife in an emergency situation and over all it pretty good.",
      "rating": "4"
    },
    {
      "title": "College laptop",
      "body": "Good size and easy to set up. I am very happy with this laptop for college in the fall.",
      "rating": "4"
    },
    {
      "title": "lap top review",
      "body": "Works fine price was right and I had points as well",
      "rating": "5"
    },
    {
      "title": "Best for college",
      "body": "Easy to set up. Perfect for my son in college.  All the right apps needed for email and writing assignments. Right price and durable for a male student.",
      "rating": "5"
    },
    {
      "title": "Great",
      "body": "A excellent purchase I would recommend you get one",
      "rating": "5"
    },
    {
      "title": "HP Laptop",
      "body": "Easy to use. No issues so far. Quick process time.",
      "rating": "5"
    },
    {
      "title": "Best thing a girl could use",
      "body": "My daughter loves her new labtop easy to work with",
      "rating": "5"
    },
    {
      "title": "HP computer",
      "body": "I love it. The sales rep was very nice and so was the geek squad. Everything worked out great.",
      "rating": "5"
    },
    {
      "title": "Laptop",
      "body": "Excellent, the fastest laptop i've ever had. Battery with no problems.",
      "rating": "5"
    },
    {
      "title": "Gift",
      "body": "Great graduation gift. Will be used throughout his college adventure.",
      "rating": "5"
    },
    {
      "title": "HP Touch Screen laptop",
      "body": "works as a basic computer as intended and great value when on sale!",
      "rating": "5"
    },
    {
      "title": "Computer",
      "body": "This computer is perfect, is fast. La volveria a comprar mil veces",
      "rating": "5"
    },
    {
      "title": "Best Value for your dollar",
      "body": "Best laptop for value. I only use it to pay bills or do some work on excel, word or powerpoint and it gets the job done. Always used HP",
      "rating": "5"
    },
    {
      "title": "Laptop",
      "body": "Loads fast. Great quality. Nice screen picture. I'm very pleased.",
      "rating": "5"
    },
    {
      "title": "Good Display",
      "body": "its so light and easy to carry. laptop working really good.",
      "rating": "5"
    },
    {
      "title": "Laptop",
      "body": "Awesome power. It was exactly what I was looking for. Love it!!",
      "rating": "5"
    },
    {
      "title": "Cool laptop",
      "body": "Computer brand new runs smoothly with all software uploaded performjng well",
      "rating": "5"
    },
    {
      "title": "Wonderful Laptop",
      "body": "This laptop is perfect for traveling. Its system is fast and the graphics are perfect.",
      "rating": "5"
    },
    {
      "title": "Does the job",
      "body": "Pretty fast for my needs I just wish it has more usb ports. Battery lift is decent and the screen is clear and crisp.",
      "rating": "4"
    },
    {
      "title": "great experence",
      "body": "in store had had a great selection to chose from. The clerk was very helpful . the tech transferred the personal info from old laptop to the new one. the new one works perfectly.",
      "rating": "5"
    },
    {
      "title": "Hp laptop",
      "body": "Is better upgrade than the older version and is great for streaming movies and playing games my son loves it",
      "rating": "5"
    },
    {
      "title": "Easy Setup",
      "body": "Good laptop with easy setup.  Too many support pop-ups.\nI would give it 5 stars but the speakers are pretty bad.",
      "rating": "4"
    },
    {
      "title": "Good buy!",
      "body": "Works as sold, fast and easy to navigate. Thinking of buying another one.",
      "rating": "5"
    },
    {
      "title": "Laptop",
      "body": "It’s a great computer for the price. I’ve been very happy with it so far.",
      "rating": "5"
    },
    {
      "title": "Owner",
      "body": "Best laptop I’ve ever owned and I’ve had a few over the years",
      "rating": "5"
    },
    {
      "title": "Happy customer",
      "body": "The lap top works good thesales person was very helpfull .the people  in the geek swad were awesome setting  up lap top and explaining  happything to me",
      "rating": "5"
    },
    {
      "title": "Best Products at Best Buy",
      "body": "Great product in use! Best Buy serves great products for your daily use.",
      "rating": "5"
    },
    {
      "title": "Ms",
      "body": "So far so good. Still having daughters helping out. \nLove it",
      "rating": "5"
    },
    {
      "title": "Good Value for Good Price",
      "body": "Overall great product for the price.  Comparable products are at least $500-1000 more.  Many flagship products don't have as good of specs.",
      "rating": "5"
    },
    {
      "title": "My laptop",
      "body": "The laptop is exactly what we need\nIt has enough memory and the processor",
      "rating": "4"
    },
    {
      "title": "HP &Me",
      "body": "I ordered from the store and received my computer within the time promised. So far, I have enjoyed using it. It synchronized well with my phone and old laptop.",
      "rating": "4"
    },
    {
      "title": "Mamiofsix",
      "body": "It’s the best laptop I’ve had so far. It’s easy to set up and use. My Husband and I have no complaints.",
      "rating": "5"
    },
    {
      "title": "My HP laptop",
      "body": "Great value. All the features that I need plus a large memory.",
      "rating": "5"
    },
    {
      "title": "HP Forever",
      "body": "Excellent hardware. Won't use anything  but HP. Kid you not.",
      "rating": "5"
    },
    {
      "title": "Solid Laptop",
      "body": "Well made and super easy setup. Everything as expected and a good price. Ordered online for store pickup, which made the transaction quick.",
      "rating": "5"
    },
    {
      "title": "Comment",
      "body": "But charger is to hot during charging. Laptop is good.",
      "rating": "5"
    },
    {
      "title": "Perfect",
      "body": "I really love the ease of this lap top for my small business speed is a plus!",
      "rating": "5"
    },
    {
      "title": "HP laptop review",
      "body": "Excellent product.  Good size, speed and capacity...",
      "rating": "5"
    },
    {
      "title": "Happy daughter",
      "body": "Mu daughter is having fun playing and doing homework",
      "rating": "5"
    },
    {
      "title": "laptop user",
      "body": "l have not fully impliemented my new laptop but so far, so good. startup is so much faster than my other computer.",
      "rating": "4"
    },
    {
      "title": "Laptop",
      "body": "Love it I didn't  think I would be  comfortable with this device",
      "rating": "5"
    },
    {
      "title": "good laptop",
      "body": "good product for this price, specifications are good",
      "rating": "5"
    },
    {
      "title": "Great Laptop",
      "body": "This laptop is Great! This is exactly what I needed.",
      "rating": "5"
    },
    {
      "title": "Perfect laptop",
      "body": "Perfect for my husband & I. Geek squad selected what would work for us and after install, we agree. Thank You David for your recommendation",
      "rating": "5"
    },
    {
      "title": "My Lap",
      "body": "Labtop is great  i still have to download  the programs in to it.I have just been working a lot but i plan on getting it done this weekend.",
      "rating": "5"
    },
    {
      "title": "hp",
      "body": "exelent product exelent display batery not too good",
      "rating": "5"
    },
    {
      "title": "HP i7 processor",
      "body": "It's fast and does the job.  Beautiful sleek design",
      "rating": "5"
    },
    {
      "title": "great laptop, very functional, and fast",
      "body": "great laptop, very functional, and fast. I would recommend this to you.",
      "rating": "5"
    },
    {
      "title": "HP Touch Screen Lap Top",
      "body": "Sleek design. Large viewing screen.  Easy set up. Love the touch screen.",
      "rating": "5"
    },
    {
      "title": "Great for school",
      "body": "Just the computer I needed. I got this computer for school and it works perfectly.",
      "rating": "5"
    },
    {
      "title": "Let the fun begin.",
      "body": "My grandchildren love this TV… Have created a special place to watch. Easy to use remote.",
      "rating": "5"
    },
    {
      "title": "hp laptop",
      "body": "Great service and product! Would buy again and recommend.",
      "rating": "5"
    },
    {
      "title": "New HP Computer",
      "body": "So far this Laptop has exceeded all requirements to date.  Just updated the RAM from 16 GB to 64 GB.",
      "rating": "5"
    },
    {
      "title": "Happy Laptop owner",
      "body": "This is exactly what I needed. It was just what was described on line.",
      "rating": "5"
    },
    {
      "title": "laptop review",
      "body": "It's an average or better laptop by hp. The price was not bad.",
      "rating": "4"
    },
    {
      "title": "Healthcare professional",
      "body": "My experience at this Best Buy was top notch. The sales person was very attentive to our needs & helpful. Highly recommended",
      "rating": "5"
    },
    {
      "title": "Great machine",
      "body": "Great price, great machine. Highly recommended. It was for my nephew and he really like this one.",
      "rating": "4"
    },
    {
      "title": "Hp laptop",
      "body": "Just purchased so haven't had time to use my computer. At least it is much faster than my old one and will know more in about a week.",
      "rating": "5"
    },
    {
      "title": "Excellent laptop and great price!",
      "body": "General use, Excel, Teams, emails. Good speed and quiet.",
      "rating": "5"
    },
    {
      "title": "New Laptops",
      "body": "Good laptop for the price.  We bought 2 of the same laptops for our retirement years so far so good.",
      "rating": "5"
    },
    {
      "title": "Laptop",
      "body": "Very good laptop 5***** has everything on that I need",
      "rating": "5"
    },
    {
      "title": "Good quality",
      "body": "Is good experience I like the laptop and is easy to use and fast",
      "rating": "5"
    },
    {
      "title": "Affordable laptop",
      "body": "I can’t believe it took me so long to obtain a new laptop. This is affordable and does everything I need.",
      "rating": "5"
    },
    {
      "title": "Laptop",
      "body": "I previously worked on a desk now I have been working on this laptop it has exceeded my expectations. The speed and convenience of mobility are great.",
      "rating": "5"
    },
    {
      "title": "HP Laptop with touch screen",
      "body": "Husband needed a new laptop and we got a good deal on this one. Friendly and knowledgeable staff at the League City store!",
      "rating": "4"
    },
    {
      "title": "HP labtop",
      "body": "this is the perfect labtop i just love it and so easy to use",
      "rating": "5"
    },
    {
      "title": "HP review",
      "body": "is working well for me, no problems, like keyboard",
      "rating": "5"
    },
    {
      "title": "HP",
      "body": "HP lap top is a great product and purchased at a great price. It has all the specs I required to run my programs",
      "rating": "5"
    },
    {
      "title": "A good buy",
      "body": "Easy setup and use.  The salesperson was very informative, and outlined the features of this model.",
      "rating": "5"
    },
    {
      "title": "Great laptop",
      "body": "Very satisfied with this laptop. It works very well for what I need.",
      "rating": "5"
    },
    {
      "title": "HP 15 review",
      "body": "computer works great , delivery was as  advertised . set=up went fine once I used my older outlook sign -in for back- up",
      "rating": "5"
    },
    {
      "title": "Great laptop",
      "body": "Great laptop and a great price. I’m not very tech savvy and even I could figure out how to use this. I highly recommend.",
      "rating": "5"
    },
    {
      "title": "New Computer worth every penny",
      "body": "Outstanding service from Best Buy. Informed technicians.  Laptop and Windows 11 with copilot fantastic. Great features.",
      "rating": "5"
    },
    {
      "title": "Disappointed",
      "body": "I purchased this last week and now HP wants me to pay to update the drivers???",
      "rating": "4"
    },
    {
      "title": "Best Buy, Best Deal, Compare to No Other.",
      "body": "Very good product with Great customer service skills.\n10/10 for me.",
      "rating": "5"
    },
    {
      "title": "Great Laptop",
      "body": "This is a great Laptop. Have really enjoyed it for everydsy use. I would reccomend this one 100%",
      "rating": "5"
    },
    {
      "title": "Excellent article",
      "body": "An excellent article, it meets the needs of my children.",
      "rating": "5"
    },
    {
      "title": "The Greek Guy",
      "body": "Great, and and easy to work thanks to my Greek guy. Check the date and 1:40 time. He was great at showing me and training me.0",
      "rating": "5"
    },
    {
      "title": "Stars",
      "body": "I gave it five stars. Stars are a wonderful way to write items I highly approve of this method five stars all the way",
      "rating": "5"
    },
    {
      "title": "Awesome",
      "body": "Excellent.  I had a problem with with my lap top, and i had a new one in less than two days.",
      "rating": "5"
    },
    {
      "title": "Bummer no DVD player",
      "body": "Not bad, it remembered all of my stuff from my old computer. The only thing i didn't like is it has no DVD player.",
      "rating": "5"
    },
    {
      "title": "Thumbs up computer",
      "body": "Easy to navigate \nAnd use\nThanks to Geek Squad for their help",
      "rating": "5"
    },
    {
      "title": "Excellent",
      "body": "Very happy with the purchase excellent product I will buy again",
      "rating": "5"
    },
    {
      "title": "laptop",
      "body": "So far, so good.  Will be tested when we take it on vacation in the RV. More than the product was the sales person.  So helpful. We know very little about laptops so the help was invaluable.",
      "rating": "4"
    },
    {
      "title": "Order",
      "body": "My order was received fast and in perfect condition.  Exactly what I was needing.\nThanks!!",
      "rating": "5"
    },
    {
      "title": "HP Laptop",
      "body": "Amazing product!! This is by far one of the best brands",
      "rating": "4"
    },
    {
      "title": "Service Manager",
      "body": "So Far Laptop Is Doing Very Well As Expected, Have Bought Similar Items With You In The Past, Still Satisfied",
      "rating": "5"
    },
    {
      "title": "Best Laptop",
      "body": "I love this Laptop....one of the BEST I've ever purchased!",
      "rating": "5"
    },
    {
      "title": "another great product. thank you.",
      "body": "excellent upgrade to my old HP I5 smaller and faster and has all the bells and whistles that the others have without the price.",
      "rating": "5"
    },
    {
      "title": "HP Laptop",
      "body": "Overall, I like this new laptop.  A little difficult for this senior citizen to handle.  But, once I did, I like it.",
      "rating": "4"
    },
    {
      "title": "ky",
      "body": "It’s sharp graphics and neat designed for every beginner to own. However, it’s little more expensive than the comparable Dell’s which even carries more storage although 2024 year model.",
      "rating": "4"
    },
    {
      "title": "Laptop",
      "body": "Awesome price and customer service.  The laptop is user friendly and all specs were met with this purchase.",
      "rating": "5"
    },
    {
      "title": "Good Purchase for the Price",
      "body": "So far this laptop has met the requirements we needed. This laptop was bought at a good price and has the specs we need for our office.",
      "rating": "5"
    },
    {
      "title": "Laptop",
      "body": "Good experience really enjoying my purchase. Thank you",
      "rating": "5"
    },
    {
      "title": "Hp laptop",
      "body": "Easy to use. Transfer of data from old computer.\nStaff was excellent in helping purchase and answering questions",
      "rating": "5"
    },
    {
      "title": "s",
      "body": "bigger screen comfortable weight, faster processor,",
      "rating": "5"
    },
    {
      "title": "What do you mean enter a title",
      "body": "It was a birthday gift she really enjoys it likes it",
      "rating": "5"
    },
    {
      "title": "Amazing! Worth the purchase!!",
      "body": "This is amazing choice we have made in purchasing this laptop. Faster and easy to tackle around.",
      "rating": "5"
    },
    {
      "title": "Brian T HP Laptop review",
      "body": "Terrific product and great sales team at Best Buy.",
      "rating": "5"
    },
    {
      "title": "Hp",
      "body": "Great computer and value, never had an Hp computer before but definitely worth it and good laptop.",
      "rating": "5"
    },
    {
      "title": "Perfect ok",
      "body": "It's the best I've ever used. Good laptop, I recommend it.",
      "rating": "5"
    },
    {
      "title": "Love my HP",
      "body": "It is a replacement of another HP laptop that accidentally drank some Gatorade.  I really like the functionality and the keyboard.",
      "rating": "5"
    },
    {
      "title": "Hp 15.6 i7 Touchscreen Laptop",
      "body": "Great device Great price and value. Good customer service.",
      "rating": "5"
    },
    {
      "title": "Best pc",
      "body": "The best computer ! It’s have everything for a Cheaper prices !! Good quality on videos",
      "rating": "5"
    },
    {
      "title": "Great product!",
      "body": "Great product! More thank I expected. Was pleasantly surprised with the touch screen!",
      "rating": "5"
    },
    {
      "title": "Nice!",
      "body": "Nice computer. We use a wired mouse with it, so pointing and clicking is easier.  Laptop is thin and lightweight.",
      "rating": "5"
    },
    {
      "title": "Card Member",
      "body": "Always has what I need. Great customer service from everyone that I have dealt with.",
      "rating": "5"
    },
    {
      "title": "Good computer.",
      "body": "It does what I need and wanted it do I like it. I would  buy  it again if I needed a second  computer.",
      "rating": "4"
    },
    {
      "title": "Fair priced quality laptop",
      "body": "Excellent laptop for a fair price.  Easy to use and connected to bluetooth accessories effortlessly.",
      "rating": "5"
    },
    {
      "title": "good",
      "body": "team was frendly and help us to make a choice for the item.",
      "rating": "4"
    },
    {
      "title": "Great laptop!",
      "body": "Seller was very knowledgeable, the product is so much better than what I currently had.",
      "rating": "5"
    },
    {
      "title": "HP computer",
      "body": "Display is Bright and easy to read ,big screen nice colors. And still working on getting to know the computer",
      "rating": "5"
    },
    {
      "title": "Satisfied customer",
      "body": "Love my computer tablet \n\nPerfect for my needs \n\nHighly recommended \n\nPerfect\nPricing !!",
      "rating": "5"
    },
    {
      "title": "BEST BUY - GEEK SQUAD ---Save your Money !!!",
      "body": "Very little instruction or communication was provided to me the customer. The person who lnstalled the software on this laptop spent more time servicing customers waiting in line for service than me. The $199.00 spent for this GEEK SQUAD was a waste of $ ...I feel cheated . SHAME on Best Buy what a sham... I am looking into hiring a true professional to correct problems caused by the installer & GEEK SQUAD people who have rudely HUNG-UP on me or completely ignored specific problems... NOT TO MENTION  **WHY** was this WEBROOT antivirus put on when MICROSOFT 365 already contains the ANTIVIRUS software DEFENDER ...**** WHY **** ??? Is this how HONEST & TRUSTWORTHY Best Buy is??? This whole experience has been a \"NIGHTMARE\" with a capitol \"N\" !! Thanks for NOTHING Best Buy - there is nothing best about you !!!!!",
      "rating": "2"
    },
    {
      "title": "HP Laptop",
      "body": "Run smooth advance. Really like the keyboard layout with the number pad to the right side.",
      "rating": "5"
    },
    {
      "title": "Good Deal",
      "body": "I love this product for the price! For the price a great deal... Was in stock...",
      "rating": "5"
    },
    {
      "title": "Nice laptop",
      "body": "So far, so good. Easy set up. Quick, my profiles all came over from my last laptop when I signed into it..",
      "rating": "5"
    },
    {
      "title": "Betty's review",
      "body": "This is exactly the right computer for me. Thanks to Kass and then Ed for guiding me to look at it in the store.",
      "rating": "5"
    },
    {
      "title": "Great HP",
      "body": "Great HP laptop for the value. Its still alittle on the hevy side",
      "rating": "5"
    },
    {
      "title": "Excellent",
      "body": "Excellent service fast computer and exactly what i need for school",
      "rating": "5"
    },
    {
      "title": "Good",
      "body": "Good laptop, functional and fast for everyday use. ✅",
      "rating": "4"
    },
    {
      "title": "HP laptop",
      "body": "Pleased with the price, easy install.. Raymond was helpful throughout the process..",
      "rating": "5"
    },
    {
      "title": "Quality care",
      "body": "Overall great experience, both customer service and product.",
      "rating": "5"
    },
    {
      "title": "Love it!",
      "body": "It’s very good laptop. I really like the interface. It did take a a minute to find the power button.",
      "rating": "5"
    },
    {
      "title": "Laptop",
      "body": "Very easy to use.\nWindows 11 seems to be like Windows 10 but with a little upgrade to it.",
      "rating": "5"
    },
    {
      "title": "Laptop HP",
      "body": "Support center at store is overworked. Friendly but they were unable to sit and explain my new computer laptop set up.",
      "rating": "4"
    },
    {
      "title": "Amazing!",
      "body": "I am so loving my new laptop. It's everything I could've asked for and very easy to use.",
      "rating": "5"
    },
    {
      "title": "Happiest new laptop user EVER!!!",
      "body": "Love my laptop, love Best Buy sales person and love love love the Geek Squad.  They have all been amazing!",
      "rating": "5"
    },
    {
      "title": "Love this HP!",
      "body": "Love this laptop!  Only need to use occasionally but does just what I need it to do and is very fast!",
      "rating": "5"
    },
    {
      "title": "Inspired to learn new information!",
      "body": "Love my new computer!  Still learning about all the new features!",
      "rating": "5"
    },
    {
      "title": "Very good",
      "body": "Excelente product. I recommend it. The computer has good features",
      "rating": "5"
    },
    {
      "title": "Middle of the road",
      "body": "I bought this laptop to replace an older hp laptop. I needed it to download and send some pdfs. I haven’t used it that much. Sometimes it won’t allow me to go to some websites. I wish it had a lighted keyboard. Honestly, I have not used the laptop for only a few times since purchasing.",
      "rating": "3"
    },
    {
      "title": "My new laptop",
      "body": "This laptop meets my needs perfectly. It is fast and was set up by the Geek Squad,",
      "rating": "5"
    },
    {
      "title": "Rebecca Perez",
      "body": "This HP laptop is amazing. Love the features and the keyboards. New windows program is\nNice",
      "rating": "5"
    },
    {
      "title": "Great laptop",
      "body": "Great laptop for my daughter who's going to college in August",
      "rating": "4"
    },
    {
      "title": "Great office laptop",
      "body": "Great computer for business use. We have purchased several and the employees love them.",
      "rating": "5"
    },
    {
      "title": "Laptop",
      "body": "So far everything has worked great. I am not a tech person so my time using it is limited.",
      "rating": "5"
    },
    {
      "title": "Good",
      "body": "Everything seems to be good. Have only had it a short while",
      "rating": "4"
    },
    {
      "title": "Love my laptop",
      "body": "This is a great brand, it’s offers more specs but a bit less in price.",
      "rating": "5"
    },
    {
      "title": "laptop",
      "body": "I've only had the new laptop for a few days but so far it is great.",
      "rating": "5"
    },
    {
      "title": "Unhappy Customer",
      "body": "I am not a happy Customer, my son bought me this laptop as a gift, and I cannot use it, he did not open the box when the clerk gave it to him from your store, he brought it to me, and when I opened the box and turn it on, the screen was damaged , I returned it to your store and was told that you cannot replace it. You did not even offer to replace the screen, so now I have to look to replace the screen. I know my son should have opened the box and make sure that everything is ok, but he did not, now the 14 day warrenty is finished.",
      "rating": "2"
    },
    {
      "title": "good enough",
      "body": "All tecghnol;ogy is too exspensive.  That said, this does what was needed.",
      "rating": "4"
    },
    {
      "title": "Laptop",
      "body": "Good working laptop, it makes online classes easy to manage",
      "rating": "5"
    },
    {
      "title": "Computer",
      "body": "Works great and has everything that we need to run our 3D printer.",
      "rating": "5"
    },
    {
      "title": "Just what I needed",
      "body": "Very good product, good value for money. A product with very good features and performance.",
      "rating": "5"
    },
    {
      "title": "Best Laptop Ever",
      "body": "Best laptop ever my girlfriend loves it she uses it for work",
      "rating": "5"
    },
    {
      "title": "my new laptop has internet connection problems.",
      "body": "laptop works fine if you dont need to access the internet.  will work great for 2 weeks with no internet problems.  then the next day it keeps getting connected , then drops to not connected to the internet. does that for hours.  then the next day its back to normal and connects to the internet fine. then a week later is back to the constant disconnects.  it is pathetic that i paid over $600 for this new laptop and i am having connection problems to the internet the first month i have the new laptop.  right now it is back to connecting then disconnet and drops the internet connection.",
      "rating": "2"
    },
    {
      "title": "Good for basic functions",
      "body": "Great computer for basic needs. This is a repeat purchase as my previous computer had speaker issues after about 5 years.",
      "rating": "4"
    },
    {
      "title": "Good",
      "body": "Does everything you said it would.\n  Hope you have a nice day",
      "rating": "5"
    },
    {
      "title": "Good buy",
      "body": "So far it has been working very well. Happy with my purchase",
      "rating": "5"
    },
    {
      "title": "Good vslue",
      "body": "Good price - good setup for basic music and photos .",
      "rating": "5"
    },
    {
      "title": "Best Buy sucks",
      "body": "Sales has poor knowledge and would give me false information just to make me purchase their products. I have purchased and returned 2 laptops and will be returning the 3rd one. New order I made was supposed to arrive today and now it's been delayed and will arrive on 21st (2 weeks from now).",
      "rating": "3"
    },
    {
      "title": "ABSOLUTELY PERFECT",
      "body": "Completely fits my needs. I've always loved HP I'm never disappointed.",
      "rating": "5"
    },
    {
      "title": "Fast and easy help",
      "body": "Excellent help in setting up my new laptop. Thank you Anthony!",
      "rating": "5"
    },
    {
      "title": "great",
      "body": "Excellent  Good service and performance, Very knowledgeable sales person",
      "rating": "5"
    },
    {
      "title": "Meets my Needs",
      "body": "Meets my needs. Light weight and easy to transport . So far I am satisfied with the performance of my computer.",
      "rating": "4"
    },
    {
      "title": "Amazing",
      "body": "Great value and perfect condition for open box product",
      "rating": "5"
    },
    {
      "title": "Feedback",
      "body": "Tech are excellent but I'm so LOST! I need a course in how to use this item - DESPERATELY!",
      "rating": "4"
    },
    {
      "title": "Deficiencies in HP Envy TE01-5364",
      "body": "I was surprised that no monitor accompanied the HP Envy, but more surprised and dismayed to discover no internal speaker system was built into this product. I must have spent 2 or more hours via a chat conversation to find out the simple answer that I needed to buy external speakers to gain audio!",
      "rating": "3"
    },
    {
      "title": "computer geek",
      "body": "great processor and it's nice to have a touch screen.  Good Ram and memory.  Perfect for my extent of use.",
      "rating": "4"
    },
    {
      "title": "Good purhcase",
      "body": "This computer has a lot of good features. Really good device for home use.",
      "rating": "5"
    },
    {
      "title": "HP at it's finest",
      "body": "Runs all the applications have, all my games runs smoothly.",
      "rating": "5"
    },
    {
      "title": "HP-15.6 Laptop review",
      "body": "HP-15.6 Laptop is an excellent value at a fair price.",
      "rating": "5"
    },
    {
      "title": "New to this laptop",
      "body": "different keyboard than I'm used to.... only have had it for a few weeks, so tough to give a fair grade",
      "rating": "4"
    },
    {
      "title": "Great work touchscreen laptop",
      "body": "Great laptop thus far, its only been a month but is working great! Love the upgrade to a touchsreen!",
      "rating": "4"
    },
    {
      "title": "Hp love",
      "body": "The brighton store was extremely helpful. Love my new jp",
      "rating": "5"
    },
    {
      "title": "New HP",
      "body": "so far the laptop is working well. The number keyboard is an adjustment to get use to.",
      "rating": "4"
    },
    {
      "title": "SPOOKY",
      "body": "WAS EASY TO SET UP AFTER OPENING, WORKING JUST LIKE I NEED IT TO",
      "rating": "5"
    },
    {
      "title": "computer",
      "body": "generally, a good product\nwould buy again and I'd recommend it",
      "rating": "4"
    },
    {
      "title": "Great laptop",
      "body": "It’s a great value for the price. It works perfectly for my needs.",
      "rating": "5"
    },
    {
      "title": "Hp",
      "body": "Nice. Just get some taking use to.  love the touchscreen. Quick and efficient.",
      "rating": "4"
    },
    {
      "title": "Positive review",
      "body": "I like this choice very much. I use it to type reports and lesson plans.",
      "rating": "4"
    },
    {
      "title": "HP Review",
      "body": "Was easy to set up and works just like we need it to.",
      "rating": "5"
    },
    {
      "title": "Good for small business",
      "body": "Excellent computer very good for your small business",
      "rating": "5"
    },
    {
      "title": "Great computer.",
      "body": "Easy-to-use and easy to install. Excellent product.",
      "rating": "5"
    },
    {
      "title": "Bulky laptop",
      "body": "I returned this product because it was extremely heavy and bulky. Felt like a brick and had poor camera quality. You had to really press the mouse to click as well.",
      "rating": "3"
    },
    {
      "title": "Wonderful",
      "body": "Wonderful computer, does what I need for the price",
      "rating": "5"
    },
    {
      "title": "Darlene’s HP laptop",
      "body": "Love my HP laptop on day one of setting it up, super easy",
      "rating": "5"
    },
    {
      "title": "HP 15.6\" Full HD Touch-Screen Laptop core i 7",
      "body": "Great product and i m satisfied with the purchase.",
      "rating": "5"
    },
    {
      "title": "Needed a laptop quick",
      "body": "Great. Got it fast and the price was right. Best buy has good deals",
      "rating": "4"
    },
    {
      "title": "My review",
      "body": "Great review, graphics and the laptop has a lot a camera.",
      "rating": "5"
    },
    {
      "title": "review",
      "body": "they know there stuff to help me purchase my computer",
      "rating": "5"
    },
    {
      "title": "Good purchase",
      "body": "very good computer, very fast. Love it will recommend to others",
      "rating": "4"
    },
    {
      "title": "Nice!",
      "body": "Works great, I am able to get my work done at home!",
      "rating": "4"
    },
    {
      "title": "Good for personal use",
      "body": "It’s good on the performance.It is worth for personal use.",
      "rating": "4"
    },
    {
      "title": "great laptop",
      "body": "purchased this laptop for my daughter at college and it seems to be working great",
      "rating": "4"
    },
    {
      "title": "Happy with new laptop.",
      "body": "The new PC was relatively easy to set up and is working well.",
      "rating": "4"
    },
    {
      "title": "Good",
      "body": "This would be five stars however it doesn’t have a lightning usb c port. Other brands have this ports on lower quality laptops",
      "rating": "3"
    },
    {
      "title": "Retired",
      "body": "Screen is very clear,performs faster with the intel 7",
      "rating": "4"
    },
    {
      "title": "Aaa",
      "body": "Good……………………………………………………………………………………………………………………….",
      "rating": "4"
    },
    {
      "title": "New laptop won’t charge - terrible customer svc",
      "body": "I got this home to find out the charger didn’t work. When I went back to the Best Buy location I bought it from, I was told I needed to wait 40 minutes or schedule an appointment on another day. The only thing more disappointing than the charger not working was the TERRIBLE customer service experience. Won’t be long before Best Buy suffers the same fate as Circuit City.",
      "rating": "2"
    },
    {
      "title": "Bad boot up.",
      "body": "One big problem is that it can take a long time to boot up. We have tried everything and still it is a problem.",
      "rating": "3"
    },
    {
      "title": "Sticky keys",
      "body": "I've had it for six months, and the keys are already sticky.",
      "rating": "3"
    },
    {
      "title": "A very usable laptop.",
      "body": "So this is a interesting laptop. I would put it in the budget friendly category. Anyone should be happy to use this unless you are one of those picky keyboard people who need it to sound a certain way and click a certain way.\n\nIt has decent brightness but don't go into it thinking about HDR content. If you don't have any vision problems you can get away with leaving the initial display settings alone. If not you might want to set the scale to 150%. Performance from the CPU and the integrated graphics is decent. Was able to play a FPS from 2017 on low settings and it was able to run it at 45fps. \n\nIf full sized keyboards are your thing then you will like this one. 15.6 inch display is pretty good and makes this a good all around use laptop. Unless you need to have the fastest of everything then you are definitely in the wrong space looking at this.\n\nThe battery life is decent and the wifi-6 and Bluetooth are handy. Shouldn't have any connectivity issues using this laptop. The lack of being able to charge using USB-C was probably a bad move. You are stuck using a traditional charger with the barrel plug. The cooling vents at the bottom are good for those new coolers that pull in air and blow directly on the bottom and creates a seal on the bottom of the unit that helps direct the cool air into the laptop.\n\nIf you like a light laptop, you will like this one. Not heavy and very portable. It will fit into any bag.\n\nWould I recommend this to someone? Yes I would. HP has always made a decent product for the average user that as long as you take care of it, it will last a while. A upgrade to a larger drive would probably be in your future unless you are going to use a external drive which I would recommend.",
      "rating": "4"
    },
    {
      "title": "Just Okay!",
      "body": "Not completely satisfied with my purchas but.....I guess I expected a little more regarding quality",
      "rating": "3"
    },
    {
      "title": "Battery overheating and 3 times exchange.",
      "body": "Not sure if Bestbuy sells refurbished product as new or what?  I have bought a laptop and it was having a overheating problem so exchange it within a day.  New exchange laptop also having same battery overheating issue and have to return within 10 days.  They are going to ship me laptop for the 3rd time.  Let's hope they aren't sending me refurbished product for new laptop price.  I can understand it happening once, but if the laptop has issues three times, it means it's not a good one.\n\nGood part about this laptop is high performance and I was able to buy at discount price.",
      "rating": "1"
    },
    {
      "title": "Junk",
      "body": "I haven't had the laptop 30 days and it has taken a dump. It will no charge, power up and I may of lost everything.  I am waiting on a box to send it to HP for repair. Not happy at all.",
      "rating": "1"
    },
    {
      "title": "DONT BUY THIS CRAMP COMPUTER IT DOESNT WORK",
      "body": "MY OLD COMPUTER DIDNT MAKE ME LOGIN TWO TIMES AND PUT IN MY KEYPASS TWO TIMES BEFORE LETTING ME WORK. THIS COMPUTER IS SUPER SLOW AT VERY THING i ASK IT TO DO. THE WOMEN THAT SOLD ME THIS COMPUTER SAID IT WAS AN UPGRADE ITS A DOWN GRADE IF YOU ASK ME. IF THAT WASNT MY ONLY MONEY I WOULD SALE IS CRAMP BACK YOU BEST BUY AND BUY A DIFFRENT COMPUTER WHAT A RIP OFF",
      "rating": "1"
    },
    {
      "title": "Simplistic at home and work device",
      "body": "This HP 15.6” Touch-Screen Laptop is a solid, mid-tier, laptop for everyday use. Unboxing was quick and out of the box, step one is plugging in the laptop and then you are good to go. The material used to make the laptop is lightweight. This was not expected but for the size of the laptop but it is light at 3.5lbs and very easily moved. The material is smooth and rounded on edges, making a simplistic feel and appearance. This laptop can easily be placed in a backpack or bag to be used on the go, while not over-weighing or fatiguing the carrier. That was probably my biggest complaint about my laptop while in college, was it got heavy! The display is clear and there are no issues viewing work related documents or videos. Having an HD screen has become standard at this point and the laptop does not have an obvious defect in this realm - instead it has the upgrade of being a touch screen device. I have not worked very closely with a touch screen device in the laptop realm before (mainly tablets) and do not think there was any loss of display due to this feature. The touch screen allows for a multi-modal approach at tasking, if while typing, one does not feel like swapping down to the touchpad you can just click on the screen and keep going. My child enjoys being able to click something on the screen and make it happen. The screen is also 15.6 inches, which is a moderate size screen that appears larger than I expected. The keyboard also fit more than I had expected. There is a numeric keypad, which most laptops do not have. When considering this device for work-related activities, this is a game changer if one works with numbers or needs to type them frequently. The keyboard design also has one of my largest complaints (a friend also thought this was odd) - the power button is not in the corner of the keyboard, rather it to the right mid portion of the keyboard where it would have been on the edge of the keyboard if there was not a numeric keypad included. It is like the keyboard was designed, then a keypad added, but overall layout was not considered past that point. This is a minor detail, but caused some confusion in my brain and just does not lay right in my mind. The provided hardware unlocks the potential for a solid everyday/work device. The i7 paired with 16GB RAM provides adequate processing power to be able to run multiple applications at once, switching between documents and tabs without delay or lag. Having a video playing while also working away at a document. I have not attempted to push the device with any advanced editing programs; however, I would not expect them to run at full capabilities. Rather, this device allows for the standard everyday computing without a hiccup. With that, in regards to gaming, simple gaming appears to work (OSRS can run without issue) but the graphics capabilities would be limiting in any significant gaming effort. The 512GB storage is smaller than most devices have lately, but in the setting of work/school focused, this is more than enough to allow for daily tasking and not running out of space. Gaming or photo editing would need more, but once again I would not expect those services from this tier of device/hardware included. The battery life appears to be decent, has not died while unplugged and on the go for an afternoon but I would want to have the charger available if was going to be using all day. Predicting with standard use would last about 5-6 hours based on observation. I believe it is claimed to last about 7 hours, but that would make me nervous to bank on. There is an HDMI display connector, so that if you need to plug in device to display on a TV or projector this is easily completed. Have had no issue with connecting to WiFi using this device. Other worthwhile mentions are that the operating system is Windows 11 and Microsoft Copilot available, this appears to have become standard for most devices at this point.",
      "rating": "4"
    },
    {
      "title": "Battery problems",
      "body": "The battery is not working properly.it needs to be fixed",
      "rating": "1"
    },
    {
      "title": "Crooked keyboard, muffled sound",
      "body": "The trackpad is off-center to the letters on the keyboard so I'm constantly lining up my hands incorrectly and typing the wrong letters.  Additionally, the speakers are on the bottom sending the sound into my lap.",
      "rating": "1"
    },
    {
      "title": "Sleek and fast",
      "body": "HP is known to make great quality PCs and Laptops, This device is no exception. First thing I should point out if you are reading my review is that this is not a gaming laptop. This is a everything else laptop. Perfect for work, students and anyone else that wants to be connected to the Internet while still having the processing power to do almost anything else, like surfing the web, checking emails, picture and video editing. Spread sheets and using AI programs etc.\n\nThe specs on this laptop are the minimum anybody should be buying these days, there are cheaper laptops out there for sure, but they have lower specs as well. What you get here is not only quality, but you will be future proofing your investment. \n\nSome features include:\n\nScreen: 15.6 touch-screen FHD\n1080p definition, very crisp very clear, and at 15.6 inches it is a pretty large size screen for a laptop.\n\nProcessor: Intel i7\nA very capable and somewhat high-end processor. Probably the most expensive and best component of this laptop. Very future proof and very capable.\n\n\nRAM: 16 GB SSD\nMore than enough to run pretty much any application, program, or software. Enough RAM to future proof, your investment for a long time. And of course, all this comes in a solid state drive. Or SSD. They run faster, quieter, and more efficient than the old Hard Drives.\n\nMemory: 512 GB\nNot the most memory available, but still decent. You’ll be able to store a few high definition, movies programs and music, but that’s about it, you will most likely run out of memory if you do a lot of downloading. The thing is that you can buy additional memory pretty cheaply these days. \n\nGraphics: Intel Iris Xe\nA very entry-level graphics card. Will only be able to play very simple games, well like I mentioned earlier, this is not a gaming laptop. This graphics card should be good enough to run anything else that’s not considered a video game. For example, little handle basic video editing. Programs and software. \n\nConclusion:\nA very fast, a very capable laptop, has all the connections you need like USB-A, USB-C, HDMI etc. It features Microsoft Copilot, which is an AI program to help you create projects, gives you advice, and overall makes things simpler. Comes with a HD Camera and Microphone, long lasting battery, HP claims it can go for 7hrs and 45 minutes. And Stereo Speakers :)",
      "rating": "5"
    },
    {
      "title": "It will get the job done",
      "body": "This laptop gets the job done but not in any style.  16gb of ram, an i7, and 512GB hard drive means that most people that aren’t heavy gamers or 3d modelers will have a smooth experience.  Integrated graphics means that games like Fortnite and other light games will run on here just fine, but if you want any more intensive games this isn’t the one for you.  Now for someone like my kid that thinks Fortnite is the best game in the world; it has a full keyboard including a number pad, and good enough specs that I don’t have to worry about any school application he might need.  This could be perfect for a student like that… besides the inability to write on the screen.  It is a touch screen but doesn’t support pen input and it doesn’t fold all the way over, it is very much a laptop.  So, if you are one to take notes on your laptop that involve handwriting this isn’t the laptop for you either.  But if you type your notes this would be absolutely fine.\nThe build quality leaves a bit to be desired.  The description is that it comes from recycled plastic, and it feels plastic.  It is decently light for it’s size which is nice, but it doesn’t feel solid, the outside easily compresses to the touch, much more than I would prefer.  The keyboard feels mushy compared to other keyboards I’ve used.  It does work and it’s not the worst, but it is far from the best.  \nThe ports selection is okay, it has HDMI, 2 USB As, and a single USB C.  I wish it had a USB C on both sides like the USB A and I wish the USB C was capable of charging the laptop.  It uses a proprietary charger, which can be nice, but I really like it when it can charge via the USB C ports as well, as USB C is much more universal.  This one you must make sure you never forget your laptop charger. \nThe screen is 1080p and decently bright, not amazing or anything to write home about but it gets the job done. \nOverall, I wouldn’t be afraid of this laptop if it fits the requirements you need spec wise, but I wouldn’t go out of my way to point anyone towards this laptop. It will get the job done.\n\nPros:\nSpecs are good (i7, 16GB ram, 512GB Hard drive)\nSmooth user experience\nLarge screen \nTouch screen\nFull keyboard with number pad\nCons:\nKeyboard is mushy for typing\nNo USB C charging\nNo pen support\nOutside shell isn’t as stiff as I’d prefer it to be.",
      "rating": "3"
    },
    {
      "title": "No Backlights?",
      "body": "No Keyboard Backlights. Touchscreen not useful. I looked elsewhere.",
      "rating": "2"
    },
    {
      "title": "A good budget laptop that shows it is on a budget",
      "body": "There is certainly a lot to like about this HP laptop, but it is clearly a budget laptop that has some compromises.  \n\nFirst the good.  As stated in the description, this laptop is best suited for productivity applications and for that environment it excels.  The Intel i7 processor, while not overly powerful, gets the job done quickly and efficiently at 5ghz speed, and the 16GB RAM means that apps and programs load quickly and can have multiple apps open at once.  That's also good for some very basic gaming, although the graphics processor is pretty basic.\n\nThe 1920x1080 screen is good, but not great.  Detail is crisp, but the screen brightness, at only 300 nits, isn't great for very bright rooms or outside.  \n\n512GB storage capacity is the bare minimum these days.\n\nI do appreciate the fact that this laptop was made from recovered plastic that was recycled.  This is also the reason for the gold rating of the EPEAT tool, which measure the environmental impact of the product.  \n\nThe keyboard is ok.  It feels a bit \"clickety clackity.\"  \n\nNow for the bad, and for me these are deal breakers.  HP really needs to get with the program and stop shipping laptops with a proprietary power supply tip and start using USB-C power supplies.  Who wants to lug around a bulky charger when a simple USB-C charger (with enough watts) will do the job?  The laptop does have one USB-C port, but it is not for charging, only for data.\n\nSecond, battery life is pretty bad.  With the screen at full brightness and streaming a 1080p youtube video, the laptop lasted approximately 4.5 hours before reaching 3% battery and shutting down.  Of course that could be increased somewhat by lowering the screen brightness, but since the maximum brightness isn't all that bright it needs to stay at maximum.",
      "rating": "3"
    },
    {
      "title": "Not a great computer",
      "body": "This computer was plastic and seemed cheap. I returned after opening the box.",
      "rating": "2"
    },
    {
      "title": "This is the worst Laptop I have ever seen",
      "body": "very expensive, not practicale, battery die out quickly.",
      "rating": "1"
    },
    {
      "title": "Keypad/board is terrible!",
      "body": "Do not buy this laptop!!!! I had to download drivers to make the keyboard function properly and after just 1 month of use, the commonly used letters/symbols are already wearing off.",
      "rating": "1"
    },
    {
      "title": "Excellent mid tier basic laptop",
      "body": "The HP 15-fd0127dx is an excellent laptop for your basic PC needs. The price is great for what you get. The device itself is very solid yet light and well made. I love the look, feel and finish. It also has all the ports most people need. 1 HDMI, 1 USB C 3.0, and 2 USB A 3.0, and 3.5 headphone, and mic input. \n\n The screen is an FHD full touch 15.6” IPS display with very nice graphics. Although not OLED it still looks great. The i7 processor is plenty fast, and combined with the 16gb of ram and 512gb SSD everything boots up very quick and runs with no lag at all. Able to open and run multiple tabs with no issues. \n\n It also has Microsoft Co-pilot AI as an assistant. Im still getting use to everything AI has to offer and so far I am very impressed. Looking forward to learning more and more of what it can do. \n\n Another nice feature it has is fast charging. It claims it can charge from 0-50% in 45 minutes, but I havent had to test that yet because the battery life lasts a solid day of moderate use. \n\n I do plan on upgrading the SSD to 1TB eventually. But for now the 512gb is enough. I am very happy with this laptop. It does all the basic stuff I need from a PC and does it well. If you are looking for a mid tier laptop this is a great choice.",
      "rating": "5"
    },
    {
      "title": "Dirty letters on keyboard that can't be cleaned",
      "body": "I purchased this laptop 3 weeks ago and already the keyboard, the letters I use the most, are faded! I went back to Best Buy and they were not able to clean them.",
      "rating": "1"
    },
    {
      "title": "Disappointed customer",
      "body": "Product a little lack luster. I’m disappointed. The battery dies quick and the fans kick on too often.",
      "rating": "1"
    },
    {
      "title": "Very Good Laptop",
      "body": "I have a small woodworking shop that I have a CNC and the laptop that I had for use in that finally gave up the ghost, it was about 7 years old and I really needed to update it because it was lacking in speed and memory.  The only reason I didn’t is because the CNC creates so much dust and I hated the thought of putting a new laptop in that environment.  \n\nSo I had the chance to receive this HP 15” Full HD touch screen and it is a HUGE improvement. The first thing that I did was my son and I built a “compartment” that houses the laptop and shields it from the dust.  I must say that the best feature that I love about this upgrade is the fact that HP is a great company, I have had several HP computers in the past and I am well pleased w/ them as a company.  But having the use of the touchscreen sure makes it easier when programming/inputing files to the CNC, and especially when it comes time to change the bits.  It used to take a while on my old laptop, now I am done in minutes.  I love the size and the weight of this HP laptop, and the graphics are phenomenal for what I need.  \n\nThe initial setup was simple, I made sure it was fully charged and after an update I was able to connect to our home wi-fi w/ out any issues.  The software that I use to run the CNC took a little longer, but I think that was my fault, as my CNC machine is about 50 yds away from my home and I would have been better suited to install everything prior to putting this into the case we made for it.  I have used it for 3 jobs, and they all went smoothly.  I like this HP product and would recommend it.",
      "rating": "5"
    },
    {
      "title": "A Great Office Laptop",
      "body": "If you are familiar with HP products, the design and styling of this will feel right at home. It has a sleek professional design, fitting in well in any office setting. I also very much prefer the curved edges, I have another laptop that has 90° edges, and from a tactile perspective I am just not a fan. I feel the rounded edges are more elegant and professional. The shell is also nice because it's not as much of a fingerprint magnet as some of my other devices.\n\n It has two full size USB ports, which is so nice to have, as well as an HDMI port, a USBC Port, and a headphone jack. The webcam provides an excellent image, and can also be closed when not in use, which is great to have built in. \n\nAs for performance, there are two elements to this. As far as being a good workhorse, this computer is great. Plenty of ram, and an i7 processor. By today's standards, the hard drive is getting to be a bit small, but it is half of a terabyte. Unless you are doing super high-end video editing or rendering, this can handle just about anything you throw at it. \n\nThe flip side of performance on this, though, is that it's not a very portable machine in that I'm only getting 3 to 4 hours out of it with high usage. I am often on the go, and I need a system that can go all day with me, and this, unfortunately, is not that laptop. Laptop. However, again, it's great if it's mostly going to be plugged in.",
      "rating": "4"
    },
    {
      "title": "Good overall",
      "body": "This HP laptop offers a good overall experience but nothing that really stands out. The one thing about this laptop which is either good or bad depending on how you look at it, is  what it’s made of. The body of it is made of plastic, specifically what HP says is ocean bound and post consumer plastic. I’m all for making things of recycled plastic and am definitely all for cleaning up the ocean, it’s just the plastic doesn’t feel all that durable . I guess I’m just so use to aluminum laptops, I just wish the plastic was a little more dense to add a more rigid feeling like aluminum. \n\nSpec wise the laptop will definitely make most people happy especially if you’re using this as a consumption device or as a work computer. The core i7 processor along with 16gb of ram handled all of my needs. WiFi 6 and Bluetooth 5.3 gives you a fast and reliable connection, that allows you to move around without having to worry about losing connection so easily to your router and devices. You get a front facing camera with a physical privacy filter which is nice. The biggest hardware drawback is that it has no backlit keyboard, this to me is a head scratcher at this price. With this HP you get a laptop that is more environmentally friendly with good specs but with some hardware compromises.",
      "rating": "4"
    },
    {
      "title": "Lightweight, next level school, design, business",
      "body": "This HP laptop has an overall nice user value to its quality and appearance. This has a spacious sized SSD while having a nice amount of RAM to support the WinOS and multiple application use. Setup is a breeze from out of the box to getting up and running with initial setup of the machine and signing into your Microsoft account. Like any new machine, there are initial updates that must be done to bring the machine fully current from OS updates, HP, and MS Office as a preinstalled application set on the system. The system is very responsive and show no signs of lag under heavy use and connects easily to an external display as an add-on or primary. The laptop overall stays fairly cool and does warm up a bit under heavy use. This is expected with how light and thin the machine is. Overall, the machine would be a good investment for those looking for something to use every day for school, design, business use, and normal use. You can accomplish some light gaming on this system also, for those that like to game.",
      "rating": "5"
    },
    {
      "title": "Excellent productivity performer",
      "body": "I have a gaming PC that I like, but it's a bit bulky for everyday office needs. I was looking for something that gives me a 15\" class screen and an i7 processor with 16 GB of RAM and has a decent battery life. I stumbled upon the this HP with the right specs and so far it meets my productivity requirements.\n\nThe processor is an i7-1355U. That's a 13th generation processor with 2 Performance Cores and 8 Efficiency cores. The 2 Performance Cores give double threads and the Efficiency Cores are single threaded, so you get 12 total threads of processing.\n\nThe memory is 16 GB of DDR4-3200 RAM. This is where I was slightly disappointed. DDR4 isn't the newest or fastest. I was also looking this up and it doesn't seem like it's upgradeable. 16 GB is the max for this system.\n\nThe storage is mediocre, 512 GB on an NVMe drive. Having done a quick speed test, it reads in the 3600 MB/sec range. I will likely replace this down the road to a more modern 2 TB version when prices come back down. Or I will have to carry a portable SSD.\n\nBattery life has impressed me. It's rated for just shy of 8 hours. So far in my testing, this is pretty accurate. My gaming PC would last me about 2 hours, it's rather bulky and the power supply is bulky as well. This HP is a breath of fresh air. I can easily carry it around and not have to concern myself with a battery for most of my day. I was also surprised at the charging brick. It's tiny compared to my gaming laptop's charger. This charger is rated for 45 watts while most of the other laptops I've dealt with have had minimum 60 watts. \n\nPorts on the HP laptop on the left side include a USB-A, HDMI, an audio jack and a USB-C. Disappointingly, while the USB-C is rated for superspeed, it isn't rated for power nor display out. For that you would need Thunderbolt and this laptop doesn't support it. I would like to get away from proprietary chargers and have a  more generic USB-C charger like some of my other laptops, but this laptop doesn't support it. On the other side of this HP laptop is a USB-A and the barrel connector for power.\n\nThe display is a 15.6\" multi-touch display. It's a glossy screen with nice colors. Resolution is 1920x1080. It's sharp for FullHD. The brightness seems to be in the 300 nits range. It's powered by Intel Iris Xe onboard graphics. This is entry level graphics, which is fine for productivity, but you really can't expect AAA gaming with ultra settings. \n\nThe trackpad is super smooth and is roughly 3\"x5\" so it's a decent size. They keyboard includes a numpad which I find important when doing productivity work. Although the keys are a little small. One thing I immediately found is that the texture of the keyboard keys are a little more coarse than I'm used to. It hasn't affected my typing ability, it's just something that felt a little off the first time I used it.\n\nThe price is right where I expect an i7 PC to be at. For the price, this laptop might hint at cheaper materials, but under the hood, the specs are giving me confidence that I can throw my productivity apps at it with no problems, and even run a Virtual Machine.",
      "rating": "5"
    },
    {
      "title": "Stellar effort at a blanced laptop from HP",
      "body": "HP has been making personal computers since nearly the dawn of the PC age (if you include the predecessor companies) and it REALLY shows when they create a quality, balanced laptop like this one is.\n\nWhen I say this laptop is nicely balanced, I mean that it's rather good at all things.  It's not super overpowered, so it's not a high-end workstation or gaming PC (but nor is it priced like one), it's just a great laptop to use for just about any normal task.  And it's well-built; while it is mostly plastic, it does still FEEL premium and is very lightweight for the size of screen / power of the internals.\n\nSo what do you get here?  You get a higher-end Intel mobile chip in the Core i7 1355U which is powerful when you need it (with 10 cores overall, 2 performance cores and 8 efficiency cores for a total of 12 threads, it's a great multi-tasker) but sips power when you're not asking for much so you still get solid battery life.  The 16GB of DDR4 and 512GB fast NVMe SSD are strong for today should be good into the future as well.  The screen is 15.6\" and FullHD so you have lots of room to work without squinting at tiny text and it does get nice and bright.  It's also very clear for movie watching though the black levels aren't as good as some of the newer screen technologies.  You get a GREAT keyboard with a full number pad and a large trackpad that does seem to support gestures.  Port selection is good though not great with 2xUSB-A, 1xUSB-C and HDMI.  And the laptop is very quiet / near silent even under load which is really nice.\n\nThe included Windows 11 install is pretty standard with just a couple of HP helper apps that don't intrude much and a trial of McAfee that is common on many OEMs these days.  The computer FEELS snappy and is great to use plugged in or unplugged for most tasks.  It zips through office tasks, web browsing, media playback (local or streamed), photo editing and more.  The integrated graphics aren't the best but you can play light / retro games just fine particularly with lower resolutions / lower detail levels.\n\nSo given what you get - a quality laptop that zips through most everything you might want to do (except high end gaming) at a good price - I can highly recommend this HP effort.  Give it a try today!",
      "rating": "5"
    },
    {
      "title": "decent spec productivity laptop",
      "body": "i7 with a respectable 16 gb of RAM, which is important given the Iris Xe integrated graphics. Xe is much better than previous integrated graphics, but all integrated graphics processors borrow memory (hence the \"integrated\") unlike a dedicated GPU, so your RAM is your big limiting step. \n\nPorts: USB-A, USB-C, HDMI, and power jack\nThis is my one and major gripe about this HP laptop. For a laptop with these specs on paper, 15.6\" screen, i7 CPU, 16GB RAM, and 512 GB SSD - this is a slam dunk for a solid productivity laptop, especially with the full size HDMI port. But then, they made the USB-C data transfer only, meaning you can't charge the laptop via the USB-C. In 2025, this makes no sense to me, as every device manufacturer has been consolidating their ports. \n\nTouchscreen matters to some, not to me at all. The OCD in me cringes every time I think about tapping on my screen, and I would personally be wiping off the screen repetitively. But for creative types, or even for simple touch features akin to phones (zoom in/out), touchscreen is a nice quality of life upgrade from using the touchpad. \n\nBattery life is mid, lasting me only about 5 hours using light video play and mostly Word and Excel use unplugged. I get the form factor is slim, limiting the battery capacity, but again, no dedicated GPU so it was a bit disappointing to me.\n\nOverall thoughts: very solid specs for a productivity use laptop, and pleasant surprise that the Iris Xe graphics can handle most of my Steam library. Not being able to use my USB-C cable to charge this laptop and limit the amount of extra stuff I need to carry in my bag was disappointing but not a dealbreaker for me. Worth it for the price",
      "rating": "4"
    },
    {
      "title": "Great laptop",
      "body": "I love it. Its the best computer i had in a long while. Its so fast and can keep up with everything and very well with multitasking which is a must. I was nervous about my game that i play but it handles that no problem.",
      "rating": "5"
    },
    {
      "title": "Covers the basics, but not much else",
      "body": "This system does well for my daughter's schoolwork and general usage. Past that, I'm not sure where I would place it in recommendations. While it does have some decent specifications, it falls short in other areas for a system at this price point. \n\nThe screen is indeed great looking with very responsive touch sensitivity with little to no lag. Videos pop in color and the framerates are smooth if using for cloud gaming. \n\nSpeakers are good enough if at home with minimal noise, but past that, mid-level sound with average performance at best. I will note that voices do ring fairly clear. Those frequencies get a nod. \n\nBattery life is slightly below average. On a full charge, with basic, non-demanding usage, I'm getting 3-4.5 hours before needing to charge, and that is on the balanced setting. With anything labor intensive, I'd be pushing 3. While the screen is beautiful, I see no other reason to have such limited power.\n\nRegardless of battery, the performance lives up to the i7. Thus far, I haven't had any slowdowns or crashes and the tasks I have applied have been uninterrupted. Alos the heat dissipation hasn't been an issue. While using in my lap, the comfort level hasn't been an issue.\n\nNo backlit keys. Minor, but a sore spot for my taste on any machine above $500.\n\nCamera is no frills. Top resolution for video is 720P, and still photos is under 1MP. Works for basic calls, but don't look to do any optimized streaming.\n\nThe build of the machine is a mixed bag. The keys have a great tactile sound and feel. Very springy with a satisfying click on each tap, yet the machine itself feels as though one slip, and it's falling apart. The shelled plastic does not feel very sturdy, and I would caution using this as a \"run-and-gun\" laptop as I wouldn't trust the durability.\n\nThis leads me to my ultimate issue, and where I would have trouble recommending to anyone with my stature. When using the laptop in my lap, there arises an issue where if I rest my wrist on the \"wrist rest\" area, the pressure causes the bottom of the laptop to compress, and the trackpad will stop clicking. At first, I just thought the machine only supported gestures tapping, but once my daughter and wife used, the ma chine, I realized it was directly correlated to my wrist pressure. It is sporadic depending on wrist angle, but very frustrating when trying to navigate swiftly, thus limiting the full useability of the machine. For that, I dropped a star and would only recommend on a specific basis.\n\nIn summary, it is a basic machine that I would only recommend to very casual users who happen to exert light pressure on the wrist rest. Very specific, but that's what it is.",
      "rating": "3"
    },
    {
      "title": "Great Performance",
      "body": "The HP 15.6\" Laptop has great performance, and can easily handle any basic multi-tasking, or work/school related tasks. I have no issue running multiple spreadsheets, browser tabs, and productivity apps at the same time. The laptop is light and quiet, and the screen is good for the price range. The sound quality is decent, and enjoying movies or videos on this laptop is a good experience. The build quality is overall ok, but lacking at the price point in my opinion. When typing on the keyboard there is a large amount of flex, and the keys have a very interesting tactile feel but are somehow still very slippery. When typing there is a large amount of flex on the casing which hampers the typing experience, and when using the touchpad it is much worse and actually makes using the touchpad a pretty bad user experience. The battery life is great, especially for such a light laptop. I was able to watch several movies on a single charge, so this would be very sufficient for a cross country flight. Overall this laptop performs very well, keyboard and touchpad are the downsides.",
      "rating": "3"
    },
    {
      "title": "Best performance and Best buy shop review",
      "body": "Nice product. Hence it is already new, hp always good in quality and performance, I have choose go only for this reason , best buy purchase is for staff and shop is good",
      "rating": "5"
    },
    {
      "title": "HP Laptop",
      "body": "I'm not an expert with laptops, so take it for what it is worth.\nThe body of the laptop seems a bit flimsy.  I don't have much to compare it to, but you can twist the whole thing and it flexes pretty easily with little pressure.  I don't think it effects performance, but might not be that durable if you live a rough and tumble life.\nI'd don't much like the action of the keyboard either.  It has a real light and cheap feel to it.  Maybe it is just personal preference, but I prefer a bit heavier and thicker feel to the keyboard action, if you know what I mean.\nThe computing power seems adequate for what I do, which is not much, basic writing and some excel book keeping.  I've watched a few movies on it, and the screen resolution is good.  Internet seems a bit slow, but it is hard for me to determine if that is from the laptop or my internet service.\nI recommend the laptop with the caveat that I only use it for simple needs.",
      "rating": "3"
    },
    {
      "title": "Great laptop",
      "body": "Great laptop. I use it for school. I was told it will last me a long time. Happy woth my purchase.",
      "rating": "5"
    },
    {
      "title": "Laptop",
      "body": "All went really well please with my purchase will continue to buy from Best buy",
      "rating": "5"
    },
    {
      "title": "Worst computer ever purchased",
      "body": "This is the worst laptop I have ever purchased. I bought 2 of these, one for me and one for my spouse. We bought them solely for light gaming. Right out of the box, one of them would not work properly. That should have been a sign to return it, but I retried to set it up and things went smoothly. Then, just 7 months later, the power cord for one stopped working. For the other one, Windows was corrupted. These computers were supposed to enable our family to all play games (well, just the one game) together. Instead, they have been nothing but a headache. Save your money and energy and invest in a different computer. I would not recommend this one at all, not even for the price.",
      "rating": "1"
    },
    {
      "title": "Why is a new computer model not working",
      "body": "This computer lags and the bottom left side of the mouse gets stuck. This computer is over priced for the it to have this many issues occurring.",
      "rating": "2"
    }
  ]
}