{
  "name": "HP 14-fk0013dx",
  "price": "549.99",
  "rating": "4.5",
  "reviews": "31",
  "specs": " OmniBook X Flip 2 - in - 1  -  Copilot+ PC  -  14\" 2K Touch - Screen Laptop  -  AMD Ryzen AI 5  -  16GB Memory  -  512GB SSD  -  Meteor Silver",
  "product_url": "https://www.bestbuy.com/site/hp-omnibook-x-flip-2-in-1-copilot-pc-14-2k-touch-screen-laptop-amd-ryzen-ai-5-16gb-memory-512gb-ssd-meteor-silver/6613861.p?skuId=6613861",
  "full_specs": {
    "Screen Type": "IPS",
    "Screen Size": "14 inches",
    "Screen Resolution": "1920 x 1200 (Full HD+)",
    "Touch Screen": "Yes",
    "Brightness": "400 nits",
    "Processor Model": "AMD Ryzen AI 300 Series",
    "Storage Type": "SSD",
    "Total Storage Capacity": "512 gigabytes",
    "System Memory (RAM)": "16 gigabytes",
    "Graphics": "AMD Radeon 840M",
    "Display Connector(s)": "1 x HDMI 2.1",
    "Battery Life (up to)": "19.5 hours",
    "Battery Chemistry": "Lithium-ion polymer",
    "2-in-1 Design": "Yes",
    "Backlit Keyboard": "Yes",
    "Brand": "HP",
    "Model Number": "14-fk0013dx",
    "Product Name": "OmniBook X Flip 2-in-1 - Copilot+ PC - 14\" 2K Touch-Screen Laptop - AMD Ryzen AI 5 - 16GB Memory - 512GB SSD",
    "Color": "Meteor Silver",
    "Year of Release": "2025",
    "Display Type": "LED",
    "Synchronization Technology": "FreeSync (AMD Adaptive Sync)",
    "Color Gamut (Standard RGB)": "62.5 percent",
    "Processor Brand": "AMD",
    "Processor Model Number": "340",
    "CPU Boost Clock Frequency": "4.8 gigahertz",
    "Number of CPU Cores": "6-core",
    "CPU Cache Memory Level": "L3",
    "L3 Cache": "16 megabytes",
    "Neural Processing Unit (NPU)": "Yes",
    "Maximum NPU Performance": "50 trillions operations per second",
    "Solid State Drive Capacity": "512 gigabytes",
    "Solid State Drive Interface": "PCIe 4.0",
    "Type of Memory (RAM)": "LPDDR5X",
    "System Memory RAM Speed": "7500 megahertz",
    "Graphics Type": "Integrated",
    "GPU Brand": "AMD Radeon",
    "Operating System": "Windows 11 Home",
    "Number of HDMI Outputs (Total)": "1",
    "USB Ports": "1 x USB-C 4, 1 x USB-C 3.1, 2 x USB-A 3.1",
    "Number of USB Ports (Total)": "4",
    "Headphone Jack": "Yes",
    "Microphone Input": "Yes",
    "Wireless Connectivity": "Bluetooth, Wi-Fi",
    "Wireless Networking Standard": "Wi-Fi 6E",
    "Number Of Ethernet Ports": "0",
    "GPU Cooling System": "Air",
    "Power Supply Maximum Wattage": "65 watts",
    "Battery Cells": "3-cell",
    "Front-Facing Camera": "Yes",
    "Front Facing Camera Megapixels": "5 megapixels",
    "Built-In Microphone": "Yes",
    "Touchpad Type": "Multi-touch",
    "Media Card Reader": "No",
    "Audio Technology": "DTS: X Ultra",
    "Speaker Type": "Poly Studio with dual speakers",
    "Windows AI": "Copilot+ PC",
    "Security Features": "Privacy camera",
    "Casing Material": "Aluminum",
    "Product Height": "0.58 inches",
    "Product Width": "12.32 inches",
    "Product Depth": "8.6 inches",
    "Product Weight": "3.11 pounds",
    "ENERGY STAR Certified": "Yes",
    "EPEAT Qualified": "Yes",
    "EPEAT Level": "Gold",
    "Optical Drive Type": "None",
    "Numeric Keypad": "No",
    "Warranty - Parts": "1 year",
    "Warranty - Labor": "1 year",
    "UPC": "198990145419"
  },
  "all_reviews": [
    {
      "title": "Glossy Display Accentuates Glare",
      "body": "BOTTOM LINE: The HP OmniBook X Flip-14” is an excellent mid-range laptop with a foldable display, plus it’s light and thin.  The Touchscreen is responsive in any position and appears bright and colorful indoors.  The new Ryzen AI5 340 Processor is fast while conserving battery life.  Although the SSD is only 512GB’s, it is more than adequate for most users.  The laptop’s “Achille’s Heel” is the glare-prone glossy screen.  \n\nRATING: An easy 4-Stars this laptop earned itself primally for speed, battery conservation, lightweight portability, and the ability to fold in different positions.  But I would be hesitant to recommend this laptop to a friend only due to the glaring glossy display.  If you are not concerned by the glare, then by all means, go for it!  \n\n\nTL; DR\n\nDISPLAY: There is always a counterbalance with a display’s ability to provide a bright screen while not producing glare.  Manufactures can choose less bright screens, with a lower NITS value, and then compensate by using a glossy screen.  I always prefer a matte-display with a higher NITS valve for display viewability that does not distract the user. \n\nAs much as I wanted to bond with this laptop’s display, the glare I encounter was just too significant for me to recommend to others.  Once you see glare, it never really gets better unless you are in total darkness or view from a distance beyond its intended use.  And setting up for “Dark Mode” to save battery life, only makes it worse, when the majority of the black display areas appear mirror-like.  If you enjoy viewing your ghostly reflections while working, you’ll be in ecstasy. \n\nOn the positive side, viewing at certain angles, the display is very colorful and bright.  Indoors I would adjust the brightness to around 70 to 75% intensity which was perfectly suitable for viewing while conserving battery life.  Outdoors at 100% intensity, the screen is visibly washed out and unreadable.  Finally, using in our screened in porch, during daylight hours at 100%, was usable.  \n\nFOLDING SCREEN: This “2-in-1” design is not new; my wife was using one 10 years ago.  Now beyond using as a standard laptop, using in an A-Fame (tent) configuration certainly has numerous benefits. Examples: Drawing, slideshow, cool video playback, etc.  And flipping the display all the way around will allow you to lay this laptop flat, unobstructed from the keyboard, to easily use an optional stylus/pen for your artwork, painting, or just doodling.  Note that the right-side edge of the laptop has a magnetic pen attachment area that holds the recommended optional pen (HP USB-C Rechargeable MPP2.0 Tilt Pen). \n\nNevertheless, I did not feel flipping the display all the way around in “Sudo-Tablet” mode was useful.  Issue being, holding while feeling the keyboard keys inadvertently depressed, made it nothing like using a solid-back tablet.  Now if there is a case or folio that could shield the keyboard in tablet mode, that could work. \n\nKEYBOARD: It took me a while to appreciate this keyboard due to the limited separation between the keys and soft touch keys.  But after a few days I was fine and it’s currently a non-issue.  The backlighting keys are satisfactory and functional when required, although not the brightness even at their highest setting.  \n\nMEMORY: OK, 16GB may well be more than sufficient for now, and hopefully future use.  However, I would prefer to have 32GB onboard and would be willing to buy and replace myself.  Researching LPDDR memory, it is not modular, it is embedded.  Meaning it has to be soldered directly onto the motherboard for speed and efficiency.  Another design technology trade-off.   Bottom line: Memory is not upgradable. \n\nUsing the current version of Windows 11 Home 24H2, running MS Edge with 5 open tabs, listening to my iTunes M4A’s using Media Player, with an open Excel spreadsheet, while typing this review in Word, Task Manager showed 58% memory use from 41% after a clean bootup.  So just maybe 16GB will be all I will ever require. \n\nHP SOFTWARE: I’m assuming that the current trend for Next Gen Ai, Recall, Copilot, etc. processing requires unique and dedicated applications.  After firing up this laptop, and after the numerous system updates, I jumped over to Settings/Apps/Install Apps for a peak.  Hmmm, there are 13 HP Applications; actually 14 when including the myHP app buried further down the list.  Normally I would uninstall what I consider bloatware but will decline to do so only because I am no longer confident which apps are actually needed.  \n\nFinally, I believe two of the HP application could be married into one. The “HP Support Assistant” and “myHP” both providing HP support type information and options.  Having to open and manage two apps for HP features, both with login’s, is just silly.     \n\nBATTERY LIFE: Excellent!  No doubt the AMD Rysen Ai-5 340 wizardry, coupled with the embedded 65-watt 3-cell lithium-ion polymer battery, is marketed to provide up to 19.5 hours of advertised video playback.  No, I have not seen the 19+ hrs. but have experience over 13 hours of actual laptop use with 20% remaining.  \n\nI will also mention this HP Laptop, using the myHP app, provides access to “Battery Manager - Maximize Battery Health”. That reduces charging the battery to an 80% level for extending its lifespan.  (This is not a Window’s feature but requires a manufacturer application or BIOS setting.)  \n\nSUNDRY FEATURES: High-speed USB 40Gpbs PD Port. IR camera for Facial Recognition (Windows Hello) with mechanical camera block out switch.  Solid WiFi 6e connectivity.  A HDMI 2.1 port.  Radeon 840 graphics.  Corning Gorilla Glass 3 Screen.  And a 65-watt USB Type-C power adapter.  \n\nMANUALS: PDF’s can be found on HP’s web site (User Guide & Maintenance).  It would be helpful if there were links to all of the required Documents found in Best Buy’s site under “From the Manufacturer”.  Currently, there is only a combined “Brochure - Data Sheet” available there. \n\n\n.",
      "rating": "4"
    },
    {
      "title": "Nice size, nice specs, nice laptop",
      "body": "The grey “clam” case design seems well constructed with sturdy hinges. At 3.11 lbs., it is heavier than I expected but still light enough to make it easy to travel with as does the 2 in 1 design and the Gorilla Glass 3 screen. It should more than meet your work, light gaming and streaming needs. \n\nImpressions;\n\nIt comes with AMD Ryzen AI 300 series processor with NPU and 16 meg of L3 cache and AMD Radeon 840M graphics. This combination is nice for pretty much any business app or day-to-day processing you might use as well as light gaming. I loaded up Minecraft Java edition and had my grandsons have at it and they had no issues. But heavy gaming really isn’t an option born out by my PCMark10 and 3Dmark test scores.\n\nI am a huge fan of 13/14 inch laptops. They are just the right size for traveling and fits easily on the seat tray, even when the seat in front is reclined. \n\n16GB LPDDR5X 7500megahertz memory. Faster than I have in my gaming desktop I built 2 years ago.\n\nWD PC SN5000S SDEPNSJ-512G-1006 M.2 SSD. It tested as fast as its specs state using Crystaldiskmark 8.0.6 x64. But why not go with 1TB - the cost must be minimal. Not sure how easy it might be to update by opening the laptop. I updated my drive several years ago on an HP laptop and it was easy. Would be easier to accept if had mico-sd option.\n\nWi-Fi 6e. That’s fast, but why not 7?\n\nLED IPS screen is good at 1920 x 1200 with better colors and viewing angle than I expected but still prefer OLED. At 400 nits laptop will only stream HDR, not natively. Touch sensitivity is very good. The screen is a tad more reflective than I like, which may be in part due to Gorrilla Glass 3 being used? Changing angle always helps.\n\nThe back-lit keyboard is nice size with very large lettering. On/off is top right of keyboard which I like as it makes it hard to accidentally turn off laptop, but it is where the delete key is normally. It does have a small light which is always on which helps to remind you. Function key also has a small light that is always on as well. The touchpad is a nice size and tracks well. Overall, I liked the tactile feel.\n\nThe sound, using 2 Poly Studio speakers, is impressive. I could not find exact watts, but the speakers seem to be mounted on the very front of the laptop under the keyboard area (2 little slits). It has good volume, and the sound seems to envelop you. \n\nLeft side connections are 1 USB 4 (40gbps), 1 USB-C 3.1 (10gbps), 1 USB-A 3.1 (10gbps) and 1 HDMI 2.1. Can charge from either USB-C but would have liked one on the right side to allow charging from either side. I transferred a 7GB movie file from a Samsung T7 M.2 external ssd in under 10 seconds, using any of the USB connections. I connected a 4K monitor using HDMI connection and finally got it setup to stream 4K at 60Hz. Using Windows 11 monitor settings was difficult to setup, and I don’t know if it might be due to me being unfamiliar with how AMD video works. I will say I tried to access Omen Gaming Hub – and it froze every time so not impressed with it.\n\nRight side connections include another USB-A (10gbps) as well as combined headphone/microphone jack.\n\nCamera has a manual slide to cover it – which is an excellent idea.\n\n3 cell Lithium-ion polymer battery. I looped a 1080P movie with balanced power, Bluetooth on using wireless headphones and wi-fi off and after 8 hrs. I had 16% battery left – which is good in my book, but nowhere near the 19 hours mentioned.\n\nNo micro SD card reader \n\nNo Finger print reader.\n\n1-year warranty\n\n\nThis laptop seems to be sturdy and can handle any day-to-day processing needs as well as light gaming. It’s a tad heavier than I would like and does not have OLED screen. But I would be happy to use it and recommend it at 4 stars.",
      "rating": "4"
    },
    {
      "title": "Elegant design and multi-functional",
      "body": "I found the HP OmniBook X Flip 2-in-1 - Copilot+ PC - 14\" 2K Touch-Screen Laptop with AMD Ryzen AI 5 processor to be a very solid performer and quite capable for most laptop tasks. Its 16GB Memory of fast 7500 Mhz RAM and 512GB SSD provide plenty of horsepower and snappy performance for office productiviity software like Microsoft Office 365.  The onboard AMD Radeon 840M graphics powers a bright 1920x1200 display, very appropriate for a 14-inch display.  Another great feature is the lighted keyboard which is almost a necessity for laptop computers these days.\n\nAs stated in the model's name, the HP OmniBook can be used as a tablet and the mechanism to change to a tablet is as simple as flipping over the screen and voila, it’s a tablet. The screen is made of Corning Gorilla Glass, so you know it can hold up to some abuse and suitable for using a stylus with the touch screen.\n\nBattery life it excellent as I ran the laptop for over 7 hours and the battery percentage only dropped from about 90% to around 60%, granted it did sleep for some of that time.  Recharging is quick using the included charger plugged into a USB-C port for convenience.\n\nI think what I really like most about this laptop is the simple clean and thin case design, along with the easy conversion to a tablet, making it a versatile and easily portable laptop for most laptop users’ needs.  The laptop seems to have ample ventilation and not once could I detect any kind of heat in use. Software installation of Microsoft Windows 11 went smoothly, albeit with several downloads and restarts to complete the process.\n  \nAgain, the HP OmniBook offers a very comprehensive laptop with an overall clean design, good battery life, and snappy performance, all wrapped in a stylishlty simple yet sturdy metal case and tough scratch-resistant screen.",
      "rating": "5"
    },
    {
      "title": "So close to being perfect. Impressive CPU",
      "body": "I couldn't help but smile when I opened up the box for this laptop. I was really impressed with the feel and build quality of this laptop. It looks and feels quite premium. Most of the chassis seems to be made of metal, aluminum perhaps. It is chunky, has some weight to it and is cold to the touch. I may be wrong, it is really hard to tell. But I feel like the top and bottom of the laptop is plastic. I only say that because it is lighter than it looks. I can't find information on the materials used in this laptop, either way.. it looks and feels great! It feels like it is built to last. The screen is very glossy, 14\" and seems to be an IPS panel. The screen, in my opinion is the weakest thing about this laptop. The viewing angles aren't great, colors looked a little washed out when viewed from the side, and there is sight backlight bleed / IPS glow in certain situations. Contrast ratio is not the greatest, blacks also look more grey than true black and the screen seems to be capped at 60hz. I feel like laptops should come standard with a 120hz refresh rate. It is not a deal breaker by any means, but it's 2025 and having at least a 120hz refresh rate will make a laptop feel so much better. Especially when scrolls through web pages and applications. It is not the worst screen I've seen on a laptop, but I wish it was better. This laptop is very classy and beautiful. It needs a beautiful screen to match. \n\nThe AMD Risen AI 5 with Radeon 840M integrated GPU feels quick and snappy. It can handle day to day tasks like photo editing, video editing. It can also handle light gaming. I was able to play rocket league, and Ninja Turtles - Shredders revenge without a hitch. It is definitely not a gaming laptop, I experienced serious frame drops when I tried playing more modern AAA titles, but it can handle some games. They'll probably run better at a medium / low settings at 720p/1080p resolutions.\n\nThe Ryzen \"Ai\" chips are new to the Market, at least this is the first I've heard of them. They have a dedicated \"neural\" processing chip for Ai tasks. I'm intrigued to see where this will go, if it's anything like other Ai chips I've researched, I assume they will learn and improve at completing tasks as they go. AMD has always been a favorite chip maker of mine, and the processor in this computer is very impressive. It really sips on battery while performing some intense tasks. Ive been using it daily for about a week, and I've only had to charge it once so far. \n\nThe built in speakers are located on the bottom of this laptop, ( a weird choice) but they still sound very good. The laptop folds all the way back and you can lay it flat with the screen up, or set it up like a tent. So having the speakers on the bottom of the laptop makes sense when you take advantage of the adjustable screen. \n\nSpeaking of Ai.. HP's Ai assistant is kind of meh.. It feels more like bloatware and is redundant. This laptop comes with Microsoft Copilot, a Microsoft Ai assistant which is easier to use and more polished than HP's Ai assistant. Copilot is helpful for daily tasks, but it also needs some polishing and refining. To me, it feels more like a glorified search bar. The ai assistant in this machine is kind of limited for now, perhaps Microsoft will improve it in the near future. But for now, I don't find it to be too useful. I would rather load up a google search bar for finding and doing what I need to do. \n\nOverall, I really enjoy using this laptop. It is great for productivity.. work from home, media consumption and light gaming. The AMD chip in this laptop is the best thing about it, it is so efficient with battery while being very snappy. I hate to give it a 4 star review, because it is so close to being an excellent laptop, but because of how unimpressed I am by the screen on this machine, I have to dock a star and give it a 4 out of 5. Would I recommend this laptop? I'll say yes, but only if you absolutely need and want to have a laptop that can fold completely flat, and can stand like a \"tent\". It is classy, lightweight, and performs well while being very battery efficient.\n\nPros: Classy Design\n\n         Plenty of Ports. 2x USB C, 2 USB A, a full size HDMI and 3.5mm Aux port. \n \n         The new AMD Ryzen Ai chip is quick, snappy and battery efficient \n\n         Keyboard and touchpad are comfortable \n\nCons: The screen has poor viewing angles, and colors look washed out in some situations. Screen is also only 60hz. \n\nThis laptop kind of reminds me of the laptops that corporations buy en masse for the workplace.",
      "rating": "4"
    },
    {
      "title": "The New Standard for Windows Laptops?",
      "body": "HP didn't disappoint with this premium laptop. This is one of the best laptops I've felt. The all-metal design is sturdy. It feels solid and not like some thin aluminum. That was the first thing I noticed. I'm not sure what coating HP is using. This device doesn't absorb fingerprints like some other devices.\n\nPros\n-All Metal-Premium Design\n-Thunderbolt 4 port, USB-C (10GB) port, and 2 USB-A (10GB) ports\n-Lightweight Package that can be easily put into a bag\nAll day battery Life at 60% Screen Brightness, I was able to get over 15 Hours of online video playback\n-A Good Everyday Processor that will get the basic needs and some basic content creation done\n-A Quiet Laptop, Not once did I ever hear the fans ramp up\n-The Keyboard (Subjective) has very short travel, and I mean short, but the clicks were satisfying \n-16GB of RAM and 500GB of Storage (I would like to see 24GB of RAM)\n\nAgain, I can't get over how nice this laptop feels. The speakers get loud even though they fire down. The Omnibook X Flip has set the standard for me for Windows Laptops. There is one flaw, however. This is where I feel like the mark was slightly missed.\n\nNegative\n-HP cheaped out on the screen. The screen is clear and crisp, but its colors are not 100% accurate. This may be a turn-off for some creators. You made such an elegant laptop. You even gave it a glossy screen, which is ideal for a two-in-one. I'm even fine with the 1920x1200. Yet, the color accuracy was missed.\n-Also, no laptop in 2025 should come with McAfee... Uninstall this NOW! HP has a lot of \"bloatware\" that comes with the device. There is so much \"HP\" this and that. Why did my device come with HP's gaming software installed? This is not a gaming laptop... The bloatware needs to stop...\n-AI... AI... AI... I don't care about the AI because it's nowhere near as good on laptops. Feels like HP is shoving it in our faces...\n-RAM not upgradable but the SSD is\n\nEven with the negatives, this is a great laptop. It is suitable for an everyday laptop, a school laptop, or a business laptop. You get everything that you need to get your work done. Lightweight and portable with enough ports to be used as a home work station! Just relax on the bloatware HP...",
      "rating": "4"
    },
    {
      "title": "Good little multi-function display laptop",
      "body": "Overall it’s a good system that combines a nicely multi-functional screen, great battery life, and enough power to run any application you need for utility. It’s probably not quite what you’d want for super intensive tasks like photoshop due to the standard resolution screen and matte appearance, but from a business and common use standpoint it hits the mark. I was super interested to see the keyboard setup as they are very squared and inset against each other. It provided fairly good tactile feedback and I was able to easily type like normal.\n\nThe 180 degree screen is the biggest star although I definitely wished an active stylus had come with it and is it just lends itself to use for tablet style input. It’s an available accessory though so easy to overcome.\n\nOther item of note is the usb-c plug was fairly hard to get inserted but I attribute that to the thinness overall, probably just has very tight tolerances to slip in. If you experience any issues, just know it does fit.\n\nOverall appreciate the portability, power, and battery life which makes it super suitable for work, school, and other such utility use cases.",
      "rating": "4"
    },
    {
      "title": "Solid specs but not sold on the AI companion",
      "body": "I wanted to take as much time as I could with this new HP notebook computer before providing a review. This came mostly from wanting to make sure I understood the AI companion component or the offering. \n\nLet me start with the basics first. This HP comes with pretty solid specs for the home user, and offers the added benefit of a full flip touchscreen for those who prefer to interact that way. It handled all of my usual tasks with ease and the screen was very crisp when not getting hit by glare. \n\nWhere I found myself questioning the usefulness was the AI companion concept. For those who know absolutely nothing about the variety of AI engines out there, I suppose this could be a starting place. But given Windows has copilot built in, I couldn’t find myself going into the companion app to do things it would already do with simple prompting. In my experiences this functionality added additional steps for users who already know what they are doing. \n\nThe one part of the AI companion i did find useful was the “perform” tab which gave system specific information and allowed you to give prompts like “make the camera follow my face” and get to a quicker answer than clicking around aimlessly in the settings. \n\nAll in all I’d say it’s a great computer for the price from a system standpoint but I wouldn’t let the allure of the “AI companion” be a specific draw unless you know nothing about, nor want to learn about, AI prompting via the most popular engines.",
      "rating": "4"
    },
    {
      "title": "Good, All Around 2-in-1. Needs less Bloatware.",
      "body": "TLDR:  Nice 2-in-1 with fair battery life and decent specs.\n\nKEY SPECS\n6C / 12T AMD Ryzen 5 340 AI Processor\n16GB DDR5 RAM\n1 x HDMI 2.1 Port\n1 x USB-C 10Gb Port\n1 x USB-C 40Gb Port\n2 x USB-A Ports\n1 x 3.5mm Headphone Port\n\nPROS\nGood Processing Power for Nearly Any Work Task\nCan be used as a traditional laptop or as a tablet\nGood sound quality while used as a laptop\nBacklit keyboard\n\nCONS\nBattery life not as good as advertised\nDownward firing speakers\nBloatware leads to errors when attempting removal\n\nUSE\nThe HP OmniBook has plenty of power for most any day-to-day task whether it be work or pleasure.  The AMD Ryzen 5 AI processor has a total of 6 cores.  3 Performance and 3 Economy Cores.  Unlike its Intel counterpart, the AMD cores all support multiple threads.  I was able to stream full HD video while still preparing documents and having multiple browser tabs open in the background.  Rarely did it bog down or feel burdened.  Combined with a respectable 16GB or RAM and Radeon 840M Graphics, the OmniBook has plenty of reserve power for most any need.  Even during my most demanding parts of the day, overall memory utilization rarely topped 50%.  CPU utilization varies wildly from minute to minute, but even with everything mentioned above, the Ryzen 5 never lost its cool and remained quiet the entire day.  It was a pleasant surprise.\n\nThe backlit keyboard is a nice addition when using the OmniBook as a traditional laptop.  This day and age, I would not consider a 2-in-1 or any other laptop for that matter without a backlit keyboard.  Unfortunately, this same keyboard isn’t the best.  Its actuation feels cheap and the keys have no texture to easily differentiate one from another.  Competitors’ laptops have far better keyboards.\n\nWith a resolution of just 1920 x 1200, the 14-inch screen is still clear, and the font is legible and smooth.  The touchscreen is accurate and responsive.  Combined with the Corning Gorilla Glass, it makes for a tough, clear display.\n\nCONS\nThe biggest drawback of the OmniBook is the included bloatware.  The biggest offender is McAfee anti-virus.  It is an unnecessary and resource hungry program.  In addition, the Omnibook ships with several other programs to try and make video conferencing look and sound much better.  Programs like Poly Camera Pro, Windows Studio Effects, and other HP “Optimization” programs add up to a taxing demand on the CPU.  If you use your OmniBook for video conferencing, WFH, etc. you may find that these programs are very beneficial, especially the AI noise reduction.  For me, I rarely use video conferencing, so they were unnecessary, and with them always starting up by default, they used up precious system resources, bogging the system down forcing me to manually deactivate them.\n\nSpeakers.  The sound quality of the speakers is quite good.  I found them to be some of the better speakers I’ve used on a laptop.  The HP audio tuning works well and the inclusion of DTS audio processing makes them that much better.  The problem is that they fire downward.  They work great when using the OmniBook as a laptop with the sound bouncing off your desk to your ears, but when used as a tablet, the audio is pointed away from you.  Not ideal.\n\nWhile HP touts “All Day” performance from the OmniBook.  I found myself averaging about 5 hours of constant use before reaching for a charger.  This is at 50% screen brightness and video streaming nearly the entire time.\n\nFINAL THOUGHTS\nThe HP OmniBook offers a lot in a small package.  It’s nowhere near the lightest or most powerful laptop on the market, but it strikes a nice balance.  Enough processing power, memory, and storage to be a useful device for years to come.  \n\nI would still like to have better actuation from the keyboard without the buttons feeling cheap and fragile and I would absolutely love to see HP stop using the often troublesome MediaTek Wi-Fi card, but the OmniBook is still a good laptop and worthy of a look if you are in the market for a 2-in-1, especially if used for teleconferencing and WFH scenarios.\n\nRECOMMENDED",
      "rating": "4"
    },
    {
      "title": "A very premium laptop",
      "body": "The HP OmniBook X Flip 14” laptop is one premium computer that can definitely complete with that other computer which is named after a fruit. Its specs and features are something to brag about. First this is a touch screen laptop that can be flipped so that it can be used as a tablet and can also be setup in tent mode which is good for presentations. This I emphasize as the other brand still has not been able to do this for whatever reason. And like tablets, this computer boasts a battery life of 14 hours or so. Being that this is still new, I wasn’t able to verify this myself.\n\nIts screen can compete with other tablets and premium computers as it has a glossy Corning Gorilla glass 400 nit display which has a resolution of 16:10 which I must say a bit odd. Its gray metal finish definitely screams premium and by no means exagerates itself. But what sets this apart is that this is powered by an AMD Ryzen AI 300 series processors. Independent benchmarks this as one huge performer. And while it is still too early to really find out, this laptop is AI enabled having a 50 TOPS npu where other PCs only have a maximum of 40 TOPS. And to add gravy to this laptop, this is further powered by a Radeon 840M gpu which is quite fast for an integrated gpu.\n\nOther features of this laptop is that it has dual cameras which can be used for facial recognition. And mind you the cameras are quite sharp. As for memory this laptop has 16GB DDR5 RAM and a 512GB MVME M.2 SSD. Pretty much decent nowadays. It has two 10GBPS USB-A ports, a 10GBPS USB-C port and a 40GBPS type C port. Definitely capable.\n\nAs for the software, there is miminal bloatware pre-installed with the exception of McAfee anti-virus and HP utilities. Of course, this has Windows 11 but the home version as this is still a consumer laptop.\n\nThat said, I have nothing more to comment since the specs pretty much speak for themselves. And also, laptops have been around for decades that it has been a matter of specs alone. All I can further say is that this is a good buy and I recommend this for others.",
      "rating": "5"
    },
    {
      "title": "OmniBook review",
      "body": "While this laptop is smaller than the previous one I used, it's really all I need.  It's compact enough to take anywhere and it's lightweight and speedy.",
      "rating": "5"
    },
    {
      "title": "Miss all the requirements in needs of an AI studen",
      "body": "Bought it for my son who had an AI/computer science camp and will use it for high school.",
      "rating": "5"
    },
    {
      "title": "HP Omnibook",
      "body": "Great product, high speed, good quality and very easy to learn",
      "rating": "5"
    },
    {
      "title": "Good Budget Laptop When On Sale",
      "body": "Good budget laptop the keyboard is a little cheap but overall good",
      "rating": "4"
    },
    {
      "title": "Review of my laptop",
      "body": "Great laptop. I will buy again next time i have the means and recommend anytime",
      "rating": "5"
    },
    {
      "title": "Omnibook HP",
      "body": "This product is lightning fast and has so many features .",
      "rating": "5"
    },
    {
      "title": "Decent laptop, with minor faults",
      "body": "The backlit keyboard has a decent feel to it, with positive feedback when a key is pressed.  Not overly noisy either.  My biggest complaint is that the Home and End keys are not dedicated; you have to press the FN key first.  And in another oversight related to this, they decided to associate the ‘FN LOCK’ function to the left SHIFT key.  So, if you want to execute a SHIFT+HOME/END, you have to make sure you press & hold the SHIFT key first, followed by FN, and then HOME/END. If you get the timing wrong and press FN first, then you’ll engage/disengage the FN LOCK instead.  Very poor design.  I’m probably in the minority, but I use those Home/End frequently, and it drives me nuts that they aren’t dedicated.\n\nMy next minor complaint is that the USB-C ports are only on the left side of the laptop.  They have USB-A ports on both sides, so I’m not sure why they thought putting all of the USB-C ports on the same side made sense.  I see this on many laptops, but it’s still annoying.\n\nNon-Microsoft bloatware is kept relatively in check.  Half a dozen or so HP utilities, which mostly stay out of your way unless you open them yourself, Adobe, some kind of Dropbox promotion, and McAfee security.\n\nThe camera has a physical privacy shutter, so that’s a plus.\n\nThe front edge of the laptop, where your wrists likely rest, is smooth.  Some other laptops have a hard edge that can be irritating.\n\nBattery life is pretty good.  I was able to stream music for about 6 hours and still had 15-20% life left.\n\nAlthough I don’t use tablet mode often, it appears that HP took it into consideration with the overall design.  Whereas many manufacturers are going for the smallest display bezel possible, the Flip is designed with just enough of a bezel that you can effectively hold the ‘tablet’ in one hand and interact using the other.  If the bezel were any smaller, you might run into issues with your holding hand inadvertently interacting with the display.  That said, it is a tad on the heavy side if you plan on frequently using it in tablet mode.\n\nOverall it’s a decent unit.  Would probably make a nice laptop for school due to the size and tablet versatility.  But the poor way they handled the Home/End functionality is a fault in my view.",
      "rating": "4"
    },
    {
      "title": "Probably the Best 2-in-1!",
      "body": "This 2-in-1 laptop from HP is top tier! I use it for work and college so it pretty much hits all the marks for me. Laptop when I need it to type, or tablet when I'm just relaxing and want to watch a show or something. It's versatile and can fit into any category with zero limitations software-wise. Speaking of software, this thing runs smoothly. I've had zero issues, no lagging, no overheating, and the touch screen is super responsive. \n\nBattery life is as advertised and lasts the whole day on one charge. From work, I can go straight to class and have battery to spare by the time I get home. Granted, I still bring my charger with me just in case I work on something power-intensive. Better safe than sorry haha. Furthermore, I quite enjoy the build quality. It's sleek and feels like it was built well. Plus, it's aesthetically pleasing. The resolution and screen quality are also great! I do wish it could get brighter, but I mostly use it indoors, so it's not too big of a problem. \n\nThis is great for professional and academic work, especially since it comes with 16GB of RAM, and you can even game on it if you want to. It's not going to give you 4k at 120 FPS, but it can manage on low graphics settings. Overall, this is a great product, and I don't think you'd be disappointed if you decided to take one home! ",
      "rating": "5"
    },
    {
      "title": "Excellent all around small and versatile laptop",
      "body": "This laptop is extremely well built, yet very light, and looks and feels a lot like much more expensive unit. Its very thin, the hinges are solid, and it just feels good in the hands. \n\n At first I didnt think the flip feature would be something I used or needed until I tried it. Being able to set the screen up at any angle makes a huge difference. Especially when viewing media. Although the screen is small it is very crisp and clear at 1920X1200. \n\n Its plenty powerful for your daily use, but dont expect to be gaming here. And of course that isnt what this is made for. But with a Ryzen Ai 5, 512gb SSD, and 16GB of LPDDR5x ram this handles everything I need it to and then some. Tabs for days, extremely fast boot times make for a nice little workhorse that can go anywhere. \n\n The claimed 19 hour battery life is of course under very light usage, but Ive had no problem getting through a day of average use. And it charges fairly quick as well. \n\n The keyboard has a great feel with good feedback, and is backlit which is always a plus. Typing away at night without the need for a light is a nice touch. (Pun intended).\n\n Overall this is a great all around laptop with excellent performance. Well built, looks high end, great battery life, and very versatile. Very much recommended!",
      "rating": "5"
    },
    {
      "title": "Great Screen. Portability is top tier",
      "body": "This laptop is fun to use and carry around. Perfect for the on-the-go creator, producer, or writer. With AI built into the software, it makes solitaire brainstorming a little easier while maintaining a multitask ridden lifestyle. This laptop has an upgraded Intel processor, which causes faster response time when searching or inputting data. Flipping the laptop into a tablet is always a plus in terms of function versatility. The 14 inch screen is highly responsive and performs at an impressive 2K resolution. There are built in programs that advocate for editors and media creators to express and support their vision.\n\nI have Concerns about battery life. On one charge it holds for a good 8-10 hours. However after a week or so the charge hasn't been holding the charge for the same amount. Also while in laptop mode it gets uncomfortably hot in my lap. I can only use it on a desk. But in tablet mode it's fine.\n\nAll in all I'm happy with the laptop. I look forward to using AI to power my creativity.",
      "rating": "4"
    },
    {
      "title": "Light and nimble yet powerful laptop!",
      "body": "This is a great laptop overall and even though there are some minor things that I think just boil down to user preference I'd recommend it as a laptop that would be great for school, work, casual use and entertainment on the go. It's not a gaming laptop with powerful discrete graphics and that's not why you'd get this one anyway as that's not what it's built for. However, it is powerful enough to play casual light graphics games which makes it all around a good general use laptop PC. \n\nINITIAL IMPRESSIONS: When unboxing this laptop you'll notice it's premium finish and look. It's really quite thin and light weighing a little over 3 pounds. The frame feels solid and the keyboard to me had the right feel along with the touchpad. Before turning it on, I love how this laptop looked and felt. \n\nINITIAL SETUP/UPDATES: \n\nThe first boot up and configuration/setup only took a couple of minutes and asked only a few questions to get going after creating a user account or signing in with an existing Microsoft account. There are a lot of people that don't like this but that's more of a Microsoft thing than it is HP. That said, I do actually like it as it lets you bring your settings over from another PC or start fresh and with OneDrive it syncs you files and your account syncs passwords and sign in with Edge so it really is seamless if you use these services on your old laptop or desktop and don't want to worry about losing stuff or keeping it in sync.\n\nImmediately, I uninstalled Mcaffee and wish HP would make that an optional thing you choose to install when you set up your machine. I tend to prefer Windows Defender, it works and is easy to use. Other antivirus software can be good if you use the other features but it's not something I need or use and I wish they'd give you a choice when you setup the computer rather than just have it pre-installed so it nags you or you have to uninstall it.\n\nOnce setup and the updates were done, which only took a few minutes I was up and going and even had Microsoft Office installed and everything synced from my other laptop. Microsoft and HP really makes this easy if you have used Microsoft Office 365 and OneDrive. Microsoft Edge remembered all of my passwords from my old machine and setup the face recognition and pin making it easy to get everything going on this one. \n\nPERFORMANCE/CAMERA/SOUND/KEYBOARD: \n\nIn terms of performance, it's fast and there's plenty of memory for most standard office and entertainment tasks for lots of multi-tasking. The WiFi connection is solid and performs really quite well. The webcam and microphone is definitely tuned for virtual meetings and calls and HP bundled in AI software that uses AI and HDR to make you and your environment look you best so I'd say it'd even be good for someone who does a lot of content creation or streaming on the go. The sound on this laptop is pretty solid. It's loud and crisp but I felt like the bass was a little lacking. When turned up all the way the speakers don't distort and are on par with a tablet in terms of sound and quality but do fall short of sound from other laptops in terms of bass and more rounded out sound overall. Don't let that scare you though, it does sound good but just not up with the best that's out there. As for the keyboard, the keys have a nice feel to them and they are backlit which is nice when you are using it in a darker environment. \n\nDISPLAY: \nAs for the display, you'll either love or hate it. I love that it's glass and Corning Gorilla glass, which does resist scrates and looks amazing but it does have the drawback of attracting a lot of glare so in bright rooms with windows or direct bright lights you may get glare on the screen that could be super annoying. That to me it wasn't that bad but I could definitely see some people having issues with that depending on the environment and preference. Aside to that, the colors and deep blacks on this screen do look great and pop, especially in a darker room. In bright rooms, you'll definitely benefit from turning up the brightness to counter the glare but at the expense of battery life. Perhaps HP will consider a glass with a glare reduction in future versions but I'm still happy with it overall. \n\nCONNECTIVITY:\nYou get WiFi, and Bluetooth and a few different ports, like a Thunderbolt port (1), USB A (1) and Type C (2) ports along with an HDMI. I would have much rather had another USB-C port and Type A port instead of the HDMI so you could use a USB-C to HDMI adapter and have more ports for general connectivity. That said, there is a enough here to do that too so that's just more a preference on my part.\n\nAI:\nIs the AI NPU worth it? I would say most definitely as a future proof tech. As more software supports it, you'll find yourself wanting or even needing this NPU hardware feature as some video and photo editing software packages even now require it in order to use certain editing features which not only are faster but really do enhance your workflow resulting in less work and the ability to do the processing locally rather than putting your data out there online in the cloud. Everyone is talking cloud AI today, but I believe it's a solid bet there'll be new suites of software in the future that specialize in using AI and NPUs on your PC locally rather than in the cloud because it's much cheaper being purpose built and doesn't require a dedicated set of cloud computers to run, and at the same time offers stronger privacy among other many other benefits and leaves the larger AI workloads (like training AI models) for the cloud for businesses and processes that need the additional power.\n\nVERSATILITY:\nI love that you can flip this laptop over, use it as a tablet and even draw or write with an optional stylus. It's all around a solid machine and one that I would expect from HP at this level. The design is refined and purpose driven with the only real issue being the glare on the display. Outside of that, it's solid and I'd recommend it.",
      "rating": "5"
    },
    {
      "title": "The laptop with a friend",
      "body": "The HP Omni X flip offers great capability and Ai performance for those on the go, multi-tasking, facetiming, day to to day requirements that most face. While Ai co-pilot features are still a new design coming in to play, not all are built to the same quality. The Omnibook X Flip offers a glimpse in what a well designed Co-Pilot feature can offer.\n\nOut of the box i have to say first and foremost i was very pleasantly surprised to how well designed the chassis is. Full light weight metal with almost zero torsion or flex. A well light back keyboard with a seamless track pad that never lost place of my finger strokes. After about an hour of charge time i decided to put the battery life to the test and see how long it would last and effect performance with the Ai built processor and Co-Pilot features. This is very first laptop i have ever owned that yielded me 30 hours of normal day to day routines. During that run time i never truly noticed any performance throttling. Ya, there was the diming of the keys and monitor but my Google meet calls ever experienced any issues. All video feeds were crystal clear with no drop outs or distortion. Even when sharing my screen, cpu performance remained at a solid 30% load.  While editing photos i noticed the Co-Pilot feature, which i had turned on, asked me if i wanted help cleaning up the photo. I allowed it to do its thing as most basic cell phones can do basic photo editing anyways. I honestly thought it would do a basic crop and move on but it changed quite a bit more. It cropped the person i was focusing on, cleaned up the lines and blurred out the background, while changing the lighting and color hues. Im assuming it was assuming this was the look i was going for (which i eerily was). The Omnibook also supports windows facially recognition and comes equipped with a beautifully flush window shutter for your lens. I actually didn't even know i had a privacy window at first due to it being that flush.\n\nI tried to really focus on the Ai side to this laptop as this is a really new feature that is going to be present in pretty much everything. Im not a know it all but in my limited knowledge what a consumer needs to know is what makes a lap top a true Co-Pilot is a laptop with a NPU (neural processing unit). The basics of this feature is your now taking your computer and it no longer needs to use Ai from cloud servers but rather in a very basic sense it now has its own logic or built in Ai. Think of it as a brain for your laptop, hence the word neural. Now as far as day to day practicality here is what i noticed. It seemed like it did over ride and take control of other task i was no longer using allowing me to never notice a performance issue when not directly plugged into a power source. I like how when i get confused on what setting to go in to, it very easily guided me there and at times would perform the task i was gonna do anyways. The photo editing feature was cool for sure but still nothing stand out. I spend alot of time on Google Meet and often have to screen share for video presentations. For the most part with my other laptops i get the occasional flickering and diming of the light as the lens tries to focus and adjust. I'll get the random video stutter or when it really loads up i may even get reduced video quality that is being viewed by my other peers. With the OmniBook  i never once experienced any of these issues, not once! The one difference that stood out to me the most was the lighting. I would get distracted when my camera would start to dim my video feed as it would try to adjust to environment. This annoyed so much so that it was the first improvement i noticed with the Omnibook Co-Pilot.\n\nOverall this is the future of computers and at this price point, it is a great way to test the waters. I didn't want to touch too much on the other features as they can easily be pulled from BestBuy but rather i wanted to try to stay on point with the subject at hand which is the current use of Co-Pilot features in feature laptops and PCs. And while its not perfect or ground breaking it can definitely be felt in the way of performance. For me im excited to see how this improves as time goes on.",
      "rating": "5"
    },
    {
      "title": "Great Coice!",
      "body": "Great choice!\n\nThe timing was perfect when I recieved this offer... My wife's laptop had just died and I had given her one that did not have the touch-screen. The poor thing struggled mightily with the non-touch screen. I wouod look over and she would be whacking on the screen and getting frusturated because nothing was happening. I must have reminded her at least five times that the screen on this one was not going to work... She was so used to having the rtouch-screen that was just operating out of habit.\n\nFast forward to this model and suffice it to say, she is much happier! I'm not going to get into tech specifics as thagt inpformation is readily availble from multiple sources. But I will say that this particular model is fast, efficient, and versitle. It can be iused as a laptop, tablet, or tent mode.  \n\nAs far as quality, in typical HP fashion, it's very good build quality. Setup was as expected, typical Windows. \n\nThis is my tyhird experience with Copilot+, and I must admit, it is far and away my preferred AI application. Take your time and enljoy playing with it.\n\nEnd of the day, this is a great choice.",
      "rating": "4"
    },
    {
      "title": "My first touch screen laptop and I love it!",
      "body": "I've been a MacBook user since my college days because ever since I tried one in college, I fell in love with the sleek, premium aluminum build. Over the years, I came to accept that Windows laptops couldn't compete with that design. But little by little things are chaging, and more Windows laptops are stepping up. Honestly, my MacBook is starting to feel outdated especially now that so many laptops come with a touchscreen. I would be lying if I said that Apple will make a touchscreen MacBook in the future because of their obsession with keeping the iPad separate. Luckily, not all companies are greedy, and this is where the HP with its OmniBook X Flip 2 in 1 is making me leave my MacBook behind. \n\nThis thing is a beauty. It looks sleek, feels premium, and perfectly blends laptop functionality with that of a tablet. When I need a laptop, it’s powerful and smooth. But when I want to chill, I just flip it over into tablet mode, and it’s perfect for reading or watching movies on the go. I freaking love it! I wish I could say a MacBook could do that, but it doesn’t. \n\nPersonally, I like to do some light gaming from time to time, so I downloaded EAFC 25, and it runs flawlessly. Honestly, this 2 in 1 laptop does everything I need it to do. I won’t go as far as to say this HP OmniBook X Flip is making me switch to Android phones, but I will say it has moved me away from thinking I need to keep using my MacBook for my productivity. That’s a first for me in over 10 years. I never thought I'd see the day, but it’s here!",
      "rating": "5"
    },
    {
      "title": "Great light duty laptop for school, work, or play",
      "body": "This small laptop is perfect for home use, light gaming, and my two preteen daughters are already using it for school work and play. It charges quickly and holds a charge for a good while. The flip feature to use it as a tablet is fantastic. The touch screen is responsive and smooth when using either a pen or a finger. Although I was disappointed that a pen was not included. \n\nThe screen is bright and antireflective. I have really enjoyed using this in tablet mode like a a-frame to have a mobile tv that's larger than an average tablet. The only thing I thing I don't really is the speakers do not sound very good in this A-frame configuration. They sound very good for such a small laptop in regular laptop mode, and they sound good in tablet mode. But set up they way I like to stand it, they don't sound good at all. \n\nOther than those two small gripes (lack of an included pen and sound in a certain configuration), This laptop is a perfect at home of on the go computer for light to medium duty work.",
      "rating": "5"
    },
    {
      "title": "Little Workhorse with a Touch of Awesomeness",
      "body": "This HP OmniBook X Flip 14 inch Laptop is a sturdy little computer that will handle day to day tasks with ease while throwing in a little bit of fun for the adventurous user. I know that the product description states 16 inch, however the laptop I received and am reviewing is the 14 inch variant.\n\nWhen I was in college I had a flip laptop that I thought would be an amazing bridge between laptop and tablet/television and enjoyed it at first. However, I am not sure that the technology was quite there as the hinges eventually started to wear and the laptop broke in half. This is now the third HP laptop that \"flips\" into the tent or tablet configuration and I am convinced that HP has this figured out now. I have ZERO concerns that this laptop will have any problems with the hinges. So if that is something that causes you anxiety when you look at laptops, take a deep breath and relax!\n\nSetup for the HP OmniBook X Flip was a little bit more cumbersome than other laptops I have had my hands on, but not by much and is definitely very doable for all skill sets. This is the first time that I have received a laptop with absolutely zero battery charge. Normally when I open the box the laptop is around 40-60% charged. Obviously plugging in the laptop is the first thing you want to do anyway, but I had to wait about 30 minutes for the laptop to charge enough to turn on. I would also recommend charging to 100% and/or running on AC power when you first set up this laptop as it needs to go through a fairly timely download/restart cycle when first powered on. Overall, probably took about 20 minutes of just letting the laptop do its thing.\n\nOnce setup, I ran though my basic routine for entertainment and business needs. Pulled up the email, went through my business suppliers weekly deals, made sure my calendar was accurate for the week, streamed music in the shop, and doom scrolled the social medias for a while. When I switched from business mode to boredom solving, I flipped the laptop into tent mode and found this feature and the touch screen as something I have sorely missed. When I finally found the motivation to be productive around the shop, I used the touchscreen and the flexibility of google to through my music to my workshop chromecast and was able to use the HP OmniBook X Flip as a controller for my tunes and videos. The touchscreen was amazingly accurate and responsive.\n\nOverall, the hardware included in this computer really works well together. The operating system, the AMD Ryzen 5 CPU, the 16gb RAM, and the WiFi 6e chip have made my usage so for very smooth and enjoyable! Add onto that I have been using this laptop fairly intensely for the last 3 hours and the battery is currently at 69%. This usage includes stress testing, streaming, and everything that is known to kill batteries.\n\nOn the exterior, the HP OmniBook X Flip has 2 USBs, 2 USB-Cs, HDMI Out, and a headset jack. The USB-C ports are also used for charging, which seems to be the norm for laptops moving forward. I do regularly use an ethernet connection as I program networks and surveillance systems and I do wish this laptop came with an ethernet port, however I have a USB-Ethernet adapter (also available as Best Buy) that I carry in my work bag for this purpose.\n\nIf you are looking for a business or student laptop that can also handle entertainment, I would jump all over this HP OmniBook X Flip. I may consider stepping up to the 16 inch with more storage than the 512gb that comes with this specific machine, however that is just personal preference and you can't go wrong with any computer in this lineup that you choose!",
      "rating": "4"
    },
    {
      "title": "Super battery life. Great processing power.",
      "body": "I've been looking for a new laptop that I can take when I mentor at a local Robotics group. It needs to have decent processing power, touchscreen, long battery life, non-proprietary charging, and HDMI port. This HP Omnibook X Flip 14 fit the bill quite nicely.\n\nPicking up this laptop, it's got a little bit of weight at nearly 3.5 pounds. On the left side, you have a USB-A port, and HDMI port and two USB-C ports. Having the physical HDMI port built in saves me from having to bring a dongle/adapter with me wherever I go. On the right side, there is an audio jack and another USB-A port. Overall decent amount of ports. \n\nProcessing power is granted by an AMD Ryzen AI 5 340 which is paired up with Radeon 840M graphics. That gives this machine 6 cores and ability for 12 threads. It has plenty of horsepower to be used as a programming PC. It comes with 16 GB of RAM which is a decent amount of RAM for most uses these days. I would shy away from any lower amount of RAM these days. Unfortunately, the RAM is not upgradeable on this PC. I found the service manual and it doesn't mention any memory replacement options.\n\nThe storage is rather minimal for my needs. 512 GB of SSD on an NVMe drive. Fortunately, this storage is replaceable. There is only one M.2 slot so if you are upgrading and want to keep the OS or contents of your drive, you'll have to get an adapter and do some work. I've done this before so I have the adapter, I'm just waiting for the pricing to come back down on a 2TB drive. I've had laptops in the past that had 2 M.2 slots that made upgrading easy. Otherwise a modern external SSD is another great option.\n\nThe screen is a 14\" touchscreen with a resolution of 1920 x 1200. What's more is that it has a 360 degree hinge, so you have the flexibility to flip the hinge from a normal laptop format all the way to a tablet style. The hinge is pretty solid and holds at the angle you set. This is important to me because there are sometimes we have to set up our playing field with exact dimensions and having a tablet style format is helpful to be able to zoom in on specifications and pan around the official gameplay documents. The display is nice and bright. It's rated at 400 nits.\n\nBattery life has been fantastic. It's rated for 14 hours of mixed use. So far in my week of testing, it's been sipping at the battery. It has a fast charge feature that gives you 0-50% charge in 30 minutes.\n\nCharging is done via a USB-C which is really important to me. Where I mentor, there are about a dozen laptops to use and there are three formats: barrel connectors, proprietary square (that almost looks like a USB port) and USB-C. The team prefers to use the USB-C computers because we can easily buy 65W adapters without having to stick to a particular manufacturer.\n\nThe trackpad is just over 3\" tall and just under 5\" wide. So it's a decent size. The keyboard does not include a numpad. But the keys are somewhat larger than I expected.\n\nThese days, all laptops are coming with about 50 NPU TOPS which gives you a decent amount of local AI processing power. This is plenty to run Windows Copilot. HP also has their HP AI Companion (Beta). The HP AI Companion does need you to sign in with an HP account though.\n\nI've been looking at the whole package of this HP Omnibook X Flip 14. The only place I'm disappointed is the non-upgradeable memory. I've been seeing a trend laptops not allowing memory upgrades for a couple years now, so it is not surprising. I think the included 16 GB of RAM is plenty for a vast majority of users. Otherwise, this laptop is going to be a great fit for my use.",
      "rating": "4"
    },
    {
      "title": "Good Quality Feel in a Small Package",
      "body": "Having owned an OmniBook previously, I was aware of what to expect.  HP has throughout the years put out highly quality, capable laptops at every price point. This laptop was right inline with that philosophy. \n\nPowered by a Ryzen Processor, this laptop was able to throw everything I could throw at it for general use (Ex: Streaming a movie while scrolling through websites). Even while doing a little light video processing, this computer was able to expediently complete other tasks at the same time. \n\nWhile HP boasts an incredible amount of battery life, it goes without saying their numbers are collected in optimal conditions.  However, even when streaming videos at 100% brightness I can still almost eek out ten hours.  Where are you really going to be that an opportunity to charge your computer wouldn’t be available within that timeline?\n\nThe two big capabilities that this laptop boasts are the 2-in-1 folding capabilities and the AI processing.  I’m not a big user of the laptop in tablet mode, but my daughter is.  She likes the tactile feel of the touchscreen (as do I), but wishes that the laptop came with the optional stylus for digital arts design and the like.  As for the AI, I am not a fan.  Probably more so because I don’t trust the technology quite yet.  The ability for it to complete medial tasks and make my work time more efficient is nice, but again, not a fan in general.\n\nLastly, is the physical screen and keyboard capabilities.  I absolutely LOVE the size and feel of the keys. A backlit keyboard is a must, and this one performs great.  The screen is completely capable for streaming and PowerPoints.  The brightness is wonderful in any indoor locations. However, step outside and the screen washes out quite a bit, even at 100 %. There is a strong amount of glare as well.  If you can get a screen cover that gets rid of the gloss a bit, I would recommend it.  Lastly, the viewing angles for this laptop. I guess that could be good for security purposes.  But if you’re trying to share anything from the screen, it makes it difficult.\n\nThis would be a five-star laptop if it weren’t for the limitations of the screen and the lack of an included stylus.  However, even with those modest flaws I would recommend this laptop to friends and family.",
      "rating": "4"
    },
    {
      "title": "HP continues to make a winner in this price range",
      "body": "This is my second OmniBook, I got one for my wife last year and after she had a good experience with it, decided to get one for me. This laptop comes with AMD's Ryzen AI 5 340 processor, with 6 cores, 12 threads, and typical speeds of 2.0 Ghz. The screen is a 2K IPS LED with a brightness rating up to 400 nits. I was impressed that HP included Corning Gorilla Glass 3 with the OmniBook, resulting in a scratch resistant screen. Graphics duties are handled by the Radeon 840M, which is integrated into the 340 series processor. I know when I hear integrated graphics, I kind of lose interest, but the AI 5 340 chip with the Radeon 840 integrated graphics has gotten some good reviews from the different websites out there.\n\nThe OmniBook X Flip does have four modes of use: laptop, tent, tablet, and reverse. All four worked seamlessly. The keyboard has large keys with little space in between them, and I found myself more than once fat-fingering adjacent keys. They have a refreshing little click to them, and the travel is very low. I'm not sure how I feel about the keyboard, but at this point, it's just okay. It can be backlit, which is very nice, sometimes laptops in this price range are not. \n\nPort-wise, it's always good to see an 'old school' USB connection, 2-USB-C connections (one is used for the power supply), HDMI, and a headphone jack. I really appreciate the headphone jack inclusion. Storage is a 512 GB SSD, and RAM is 16 GB, which is great to see on a laptop at this price range.\n\nThe speakers get decently loud and sound okay at lower volumes, but you'll want to use headphones for any serious listening. \n\nSo all this together, how does it work? My opinion is the OmniBook X is perfect for the home user who multitasks and uses standard office programs, watches videos, and does some light gaming. During my use, the OmniBook X had some challenges viewing 4K content at high framerates and got bogged down pretty quick while playing anything more than Minecraft or Stardew Valley. But let's face it, the OmniBook X is not touting itself as a gaming computer or a 4K machine. In use, it ran cool, and other than a couple of times when I tried to stream 4K video or play Final Fantasy X, I didn't feel like it hung up, stuttered, or got hot. I have a test where I open dozens of tabs on the internet and access memory-intense webpages and leave them all running in the background while opening Office apps and playing music. The OmniBook X handled this test really well, which means it will work just fine for most home users.\n\nI feel in this price range that HP has a winner. The OmniBook X with AMD's 300 Series AI processor is lightweight and powerful enough for the home office user.",
      "rating": "5"
    },
    {
      "title": "Portable and powerful",
      "body": "HP has put out some great laptops over the years and this one is no exception. \nThis laptop doubles as a tablet. You can fold it backwards and it turns to a tablet. This is great for drawing with the stylus or if you just prefer a tablet most of the time but also want a laptop with a solid keyboard. The sensitivity of the touch screen was great out of the box. I didn’t need to do any adjustments in settings. It was easy to switch from programs while in tablet mode as well. \nThe overall feel of the laptop is of high quality. It doesn’t feel flimsy at all. The casing is made of aluminum allowing it to be super light at just over 3lbs. Great portability! They keyboard is backlit for easy use in darker places. It has a multitouch track pad which I love compared to one with keys. Battery life is rated for 19.5 hours. I’m on about 6 hours use and 12 hours stand by now. The screen is 14 inches which is perfect size for portability and functionality in my opinion. \nThe guts of this laptop are above par. With AI built in, they spared no expense for memory, graphics and storage. The new Ryzen processors  are top notch.",
      "rating": "5"
    },
    {
      "title": "Impressive Ultra Portable",
      "body": "The Omnibook X Flip is a pretty impressive ultra portable that gives a plenty of power and battery life.\n\nSet up was no different than any other Windows based laptop. Log in, run a bunch of updates, remove programs you don't need or want. After an hour or so of setting things up (and retrying failed updates - seems to be more common with Windows lately, happens on every computer I use) you can move on to actually using it.\n\nThe power, while more than good enough for general use, can be a bit sluggish at times, especially when multitasking with a bunch of tabs in your browers and multiple programs open. More memory would help as would more diskspace so you don't keep checking your free space as you work.\n\nOne feature that's not listed on the specs page is that the Flip supports Windows Ink. I figured they included a glass screen for a reason and whooped out my Bamboo Ink Pen and paired it. Sure enough it works and supports pressure sensitivity. Nice surprise on that part. If you do a lot of writing I suggest getting a screen protector. It's easy to get a small grit of sand on the pen and ruin your pristine screen.\n\nFor me, 14\" is a perfect size for a portable. 13 is kinda too small and 15-16\" is best suited for laptops you're not gonna use as a tablet. The size gets a bit awkward, and the weight can be a bit for some people. 14\" gives you plenty of real estate, a chasis that can hold a slightly bigger battery, and small enough to handle easily.\n\nThis is the perfect laptop for someone who doesn't need Ultra but wants a good laptop for school or work.",
      "rating": "5"
    },
    {
      "title": "Fantastic Mid-Range AI-Enabled laptop!",
      "body": "I replaced my computer at work with this one as my job is starting to experiment with AI - not to mention that the computer that they provided me was severely outdated and slow! \n\nThis laptop runs on the 6C / 12T AMD Ryzen 5 340 AI Processor, which puts it somewhere in the i5-class performance range. The built-in graphics is the Radeon 840m. \n\nBy giving up a little horsepower, what you get in return is a laptop that has respectable battery life above and beyond the 2-3 hours that most mainstream laptops give you (regardless of their advertised specs). \n\nThis 14\" model comes with a Gorilla-Glass screen, making it less susceptible to breakage or shattering. It's also wickedly clear - the brightness combined with the resolution on a screen this size makes for a very crisp picture regardless whether you're doing work, email, watching videos, or just viewing photos. \n\nMemory is 16GB , but I don't believe it's upgradeable , so if things get to a point where more RAM is required you're due for an upgrade. Also, the SSD is \"only\" 512GB - personally I've yet to find a need for larger than 512GB except for on a machine that is being used for gaming. \n\nKeyboard is backlit (white only) and is rather pleasant to type on. No numeric keypad here though. \n\nOverall a very nice computer. It strikes a balance of performance, battery life, great display and respectable specs all into an attractive 2-in-1 unit.",
      "rating": "5"
    }
  ]
}