{
  "name": "HP 17-da0013dx/9S1R7UA#ABA",
  "price": "1143.99",
  "rating": "4.7",
  "reviews": "637",
  "specs": " Envy 17.3\" Full HD Touch - Screen Laptop  -  Intel Core Ultra 7  -  16GB Memory  -  1TB SSD  -  Glacier Silver",
  "product_url": "https://www.bestbuy.com/site/hp-envy-17-3-full-hd-touch-screen-laptop-intel-core-ultra-7-16gb-memory-1tb-ssd-glacier-silver/6572056.p?skuId=6572056",
  "full_specs": {
    "Screen Type": "IPS",
    "Screen Size": "17.3 inches",
    "Screen Resolution": "1920 x 1080 (Full HD)",
    "Touch Screen": "Yes",
    "Brightness": "300 nits",
    "Processor Model": "Intel Core Ultra 7 Series 1",
    "Storage Type": "SSD",
    "Total Storage Capacity": "1024 gigabytes",
    "System Memory (RAM)": "16 gigabytes",
    "Graphics": "Intel Arc",
    "Display Connector(s)": "1 x HDMI 2.1, 1 x Thunderbolt 4",
    "Battery Chemistry": "Lithium-ion polymer",
    "2-in-1 Design": "No",
    "Backlit Keyboard": "Yes",
    "Brand": "HP",
    "Model Number": "17-da0013dx/9S1R7UA#ABA",
    "Product Name": "Envy 17.3\" Full HD Touch-Screen Laptop - Intel Core Ultra 7 - 16GB Memory - 1TB SSD",
    "Color": "Glacier Silver",
    "Year of Release": "2024",
    "Display Type": "LED",
    "Processor Brand": "Intel",
    "Processor Model Number": "155H",
    "CPU Boost Clock Frequency": "4.8 gigahertz",
    "Number of CPU Cores": "16-core",
    "CPU Cache Memory Level": "L3",
    "L3 Cache": "24 megabytes",
    "Neural Processing Unit (NPU)": "No",
    "Solid State Drive Capacity": "1024 gigabytes",
    "Type of Memory (RAM)": "DDR5",
    "System Memory RAM Speed": "5600 megahertz",
    "Graphics Type": "Integrated",
    "GPU Brand": "Intel",
    "Operating System": "Windows 11 Home",
    "Number of HDMI Outputs (Total)": "1",
    "Number of DisplayPort Outputs (Total)": "0",
    "Number of Thunderbolt Ports (Total)": "1",
    "Number of VGA Ports": "0",
    "USB Ports": "3 x USB-A 3.1, 1 x USB-C 3.1",
    "Number of USB Ports (Total)": "4",
    "Headphone Jack": "Yes",
    "Microphone Input": "Yes",
    "Wireless Connectivity": "Bluetooth, Wi-Fi",
    "Wireless Networking Standard": "Wi-Fi 6E",
    "Number Of Ethernet Ports": "0",
    "Power Supply Maximum Wattage": "65 watts",
    "Battery Cells": "6-cell",
    "Front-Facing Camera": "Yes",
    "Front Facing Camera Megapixels": "5 megapixels",
    "Built-In Microphone": "Yes",
    "Media Card Reader": "No",
    "Audio Technology": "Audio by Bang & Olufsen with quad speakers",
    "Windows AI": "Not Applicable",
    "Casing Material": "Aluminum",
    "Product Height": "0.78 inches",
    "Product Width": "15.59 inches",
    "Product Depth": "10.18 inches",
    "Product Weight": "5.52 pounds",
    "ENERGY STAR Certified": "Yes",
    "EPEAT Qualified": "Yes",
    "EPEAT Level": "Gold",
    "Optical Drive Type": "None",
    "Numeric Keypad": "Yes",
    "Warranty - Parts": "1 year",
    "Warranty - Labor": "1 year",
    "UPC": "198122036554"
  },
  "all_reviews": [
    {
      "title": "Title: Perfect Laptop – 5 Stars!",
      "body": "This laptop is a total win! The huge screen is stunning, the touchscreen works flawlessly, and the light-up keyboard is great for night use. It’s super fast, and the 10 side keys make multitasking easy. Amazing performance, design, and battery life. Highly recommended!",
      "rating": "5"
    },
    {
      "title": "Excellent",
      "body": "The HP Envy is a high-quality laptop, perfect for those seeking performance and a premium design. It stands out for its sleek build, high-resolution display, and enough power for demanding tasks like photo and video editing, as well as multitasking. Its comfortable keyboard and good battery life make it a great choice for both work and entertainment. A highly recommended purchase!",
      "rating": "5"
    },
    {
      "title": "Excellent computer! I love it!",
      "body": "This computer is awesome! It is super fast and reliable. It has features I didn't even know was included, such as a built-in poly studio!  This is great for content creators, artists and illustrators. It has a touch screen as well, so you can use a stylus with it.  I am extremely happy with my purchase. I had a tech guy get something set up remotely on it for my workplace, and he said \"Wow! That is a very nice computer!\"  I've never had a tech guy be impressed with any computer I've owned in my lifetime!  Made my day.",
      "rating": "5"
    },
    {
      "title": "Amazing, with one drawback",
      "body": "This computer is blazing fast, but has a disappointing keyboard. Though the size is generous, the keys don't have a good tactile feel to them: I ended up getting an external mechanical 60% size keyboard to go with it.\n\nPros:  Blazing fast, great touch screen, great screen size, very aesthetic case design, great build quality, excellent port selection, very minimal fan noise and heat accumulation\n\nCons: keyboard isn't great. Get an external keyboard to go along with it. I've attached a picture of the Razer 60%- size mechanical keyboard I picked up to go with mine.",
      "rating": "5"
    },
    {
      "title": "LOVE, LOVE, LOVE IT",
      "body": "This laptop has a gorgeous picture with vibrant colors. The large touchscreen is perfect for work projects / presentations and equally great for streaming tv and movies when I travel. I loved mine so much that I bought one for my daughter when she went back to college.",
      "rating": "5"
    },
    {
      "title": "Love this Computer!!!",
      "body": "This is an awesome easy to use computer!!!I got it for the business that I was starting up and it’s been great! The speed it fast and I love the touch screen!!",
      "rating": "5"
    },
    {
      "title": "hello",
      "body": "Great performance and value! The HP laptop offers fast processing, ample storage, and a clear display. Ideal for everyday tasks and work. Highly recommended!\"",
      "rating": "5"
    },
    {
      "title": "HP ENVY Laptop the Best because I always Buy this.",
      "body": "Sleek Design, Large Screen and not too Thick. Users Friendly.",
      "rating": "5"
    },
    {
      "title": "Affordable with everything I need",
      "body": "I really love my this laptop.  It is extremely fast, has plenty of storage, large display screen, touch screen, side number key and a great price.  It is a bit heavy compared to others, but the benefits and price are worth it!",
      "rating": "5"
    },
    {
      "title": "Satisfied",
      "body": "It's just what I need it. Nice keyboard and screen.",
      "rating": "5"
    },
    {
      "title": "Great and best purchase this year! 9.5/10",
      "body": "It was super easy to set up, and the graphics are amazing. I love how giant the screen is, edge to edge. I like how the camera switch to turn it on and off is at the top of the laptop screen. The multi-security is also a super plus. I wish it had a fingerprint scanner as well.",
      "rating": "5"
    },
    {
      "title": "HP - Envy 17.3",
      "body": "I love my new HP - Envy 17.3\" Full HD Touch-Screen Laptop - Intel Core Ultra 7 - 16GB Memory - 1TB SSD - Glacier Silver. It’s fast and easy to use.",
      "rating": "5"
    },
    {
      "title": "HP means Happy Person",
      "body": "OMG! So fast! So big! So clear! Purchased on sale and open box! Best investment I made!!!",
      "rating": "5"
    },
    {
      "title": "Many Great features!!! :)",
      "body": "More than one Geek recommended!\n17.3” screen a must!\nThe manual on/off button, with light, is priceless vs Dells i had that would automatically turn on when opening!\nCrisp clear resolution!\nNoticably faster speeds!\nKeys vivid with perfect touch control!\nLove the non-proprietaryUSB-c charging port!\nBattery lasts unexpectedly much longer than i’m used to because i love brightness! (THAT alone is of great value however they do it!)\nRecommend a protective case, mine is by Smatree & put your phone # on it! You might ask me how I learned that!",
      "rating": "5"
    },
    {
      "title": "Amazing Computer",
      "body": "Bought a similar Laptop back in 2012 from here and its still running okay for a 12 year old laptop but I thought it was time for a new one so I found this one and this one is even better than my old one.  I hope this one will last another 12 years.",
      "rating": "5"
    },
    {
      "title": "Great machine! And Copilot ain't bad, either.",
      "body": "Excellent, solid computer, and there were no problems during setup. The 17\" screen is clear and crisp and has helped me with my vision problems immensely. I wasn't happy about it having Copilot at first (even without the Dragon chip it has a Copilot button) but as it turns out, Copilot is really good at tech support, and unlike googling, you can see the answers without all the annoying ads. The only disappointment is that the large touchpad makes it uncomfortable to type on when it is placed on a desk. It's find when it's on your lap but difficult to reach the keys when on a desk. Since I use an external keyboard, that's not a problem for me but it could  be for you.",
      "rating": "5"
    },
    {
      "title": "Screaming Deal",
      "body": "She’s a beauty! Ten-key, large screen, enough space for everything I need!",
      "rating": "5"
    },
    {
      "title": "Great Laptop",
      "body": "I've been extremely pleased with my new HP-Envy. I've had this brand several times and have been very pleased. My last one was a Dell, but it never measured up to what I was used to. With the assistance of the Cloud I was able to set my new computer up myself and transfer files that I needed. The display is vivid and beautiful. Best Buy is the only place that I would buy a laptop or computer.",
      "rating": "5"
    },
    {
      "title": "HP Envy Review",
      "body": "This computer is much faster than the computer I previously owned.  It is quick to connect to websites and peripheral equipment.  The Best Buy sales person recommended this HP Laptop for my specific needs. I am extremely pleased with this model.",
      "rating": "5"
    },
    {
      "title": "What's Love Without Some Irritation?",
      "body": "I desperately needed a new laptop after my last one unexpectedly stopped working. This model meets my needs but really too new to give any meaningful feedback. The only reason for 4 stars is the keyboard. I needed a keypad which works with no problem, but the arrow keys are not spaced well, with the up/down keys very much smaller so becomes awkward to use. Also, the mouse portion, especially with the right click is not very responsive.",
      "rating": "4"
    },
    {
      "title": "HP Envy 17.3 laptop score...",
      "body": "HP Laptop was open box item. Best decision I ever made. Everthing was like brand new and with a discount. More than $500 off. Warranty still good too. Love this purchase. Great computer and fast!",
      "rating": "5"
    },
    {
      "title": "HP laptop",
      "body": "My HP 17\" laptop is working well. No hassles setting it up and linking to my printer (though the Geek Squad did most of the setup at the store....yeah Geek Squad) My Gmail is slow coming up but then it and my internet have the same icon (?does this matter??)",
      "rating": "5"
    },
    {
      "title": "Smith",
      "body": "It’s every thing I need for working from home, I have laptops in every room in my house, but this is the best one out of all four of my laptops",
      "rating": "5"
    },
    {
      "title": "HP Envy review",
      "body": "Couldn't ask for a better laptop everything I could have wanted and more highly recommended",
      "rating": "5"
    },
    {
      "title": "HP ENVY 17.3",
      "body": "Love my new computer, works fast. Love how it’s touchscreen",
      "rating": "5"
    },
    {
      "title": "Best HP Laptop",
      "body": "This is a get laptop especially for my profession in accounting.  I love the large touch screen and full keyboard!",
      "rating": "5"
    },
    {
      "title": "Great computer with easy setup",
      "body": "Great computer with easy setup.  I’m enjoying the fast speed it operates and the ease of Windows 11.",
      "rating": "5"
    },
    {
      "title": "HP Envy",
      "body": "Recently made a great purchase in chandler location. Excellent service with quick, easy financing! Looking forward for another purchase soon, thanks Best Buy!",
      "rating": "5"
    },
    {
      "title": "Amazing HP",
      "body": "This is my third HP and this one by far is amazing! Amazing speed and big screen!",
      "rating": "5"
    },
    {
      "title": "HP Envy Laptop",
      "body": "I love my HP Envy Laptop. It was exactly as advertised. It was easy to set up and start using. I would highly recommend.",
      "rating": "5"
    },
    {
      "title": "HP Envy Laptop",
      "body": "Love my new HP Envy!! Great product!! Love the touch screen!!",
      "rating": "5"
    },
    {
      "title": "Great Laptop",
      "body": "Not bad so far! I can’t complain! It’s one of the best laptops by far! Try one today!",
      "rating": "5"
    },
    {
      "title": "Great Quality",
      "body": "Amazing product!! I recommend getting this if anyone needs an absolute beast when it comes to Laptops",
      "rating": "5"
    },
    {
      "title": "Laptop Perfection",
      "body": "Absolutely in love with this laptop! Display is crisp, backlit keys make it easy for me to work at night and not disturb my husband, and the facial rec unlocks instantly while keeping my data secure.  The system is fast and I have tons of storage space.  I've always love HP products, but this is far superior to anything I've ever owned!  The battery life is excellent, touch screen makes it easy to zoom in on parts of contracts I'm reviewing, and the installed software provided everything that I needed to seamlessly transition from my old laptop.",
      "rating": "5"
    },
    {
      "title": "HP Envy 17 Touch Screen",
      "body": "I am having so much fun using this Laptop!\nIt is very easy to use and having the Touch Screen as well makes this Laptop even easier and convenient to use.\nSometimes you just want to touch the screen and have it respond like your phone and now you can.\nThis function alone makes things so much easier!\nThe larger size screen, resolution, processing speed, weight, cloth-covered power-cord, and the ease of customizing this laptop makes it an easy choice for me to recommend this HP.",
      "rating": "5"
    },
    {
      "title": "HP Envy 17.3\" Touch Screen",
      "body": "I love this laptop!!!  never had a touch screen before and sometimes I forget it is.  It comes in handy a lot of times when I have to do something in particular.  The graffics on it is great and crisp.  This computer loads really fast.  I love the sensor for signing in, convenient and no password to memorize.",
      "rating": "5"
    },
    {
      "title": "HP Envy 17.3",
      "body": "My HP Envy has many useful features. It is easy to use. The design and color are very nice. I love how fast I can work on my laptop because of the Intel Core Ultra 7. It has a larger screen which make things easier to see and I can handle everything better. It has plenty of storage capacity and a large memory and I love it.",
      "rating": "5"
    },
    {
      "title": "Excellent",
      "body": "Absolutely thrilled with my purchase! The HP Envy 17.3\" Full HD Touch-Screen Laptop has exceeded my expectations in every way. The display is stunning, with vibrant colors and crystal-clear resolution. The Intel Core i7 processor is lightning-fast, handling multiple tasks with ease. The 16GB of memory ensures seamless performance, even with demanding applications.\nThe 1TB SSD provides ample storage for all my files, and the touch-screen functionality is incredibly intuitive. The Glacier Silver finish looks sleek and professional, making this laptop a joy to use in any setting.\nI've been impressed with the battery life, and the laptop's build quality is exceptional. The keyboard and touchpad are comfortable and responsive, making it a pleasure to work and create.\nOverall, I'm thoroughly satisfied with my purchase and would highly recommend this laptop to anyone seeking a powerful, versatile, and stylish device. Five stars isn't enough - I'd give it ten stars if I could!\"",
      "rating": "5"
    },
    {
      "title": "HP Envy",
      "body": "This laptop is faster than the last one I had. Plenty of memory. I love having a touch screen and a lit keyboard. The only issue I have had is with the camera. Sometimes the camera quits working for no reason. I still have a back-up to sign in, but never know when the camera will quit. It doesn't stay down long, so I haven't tried to take it in to be looked at. Just concerned that one day it will quit for good. Other than that I am very happy with this laptop.",
      "rating": "4"
    },
    {
      "title": "Wow hp 17.3",
      "body": "Love love this laptop i use it like a desktop so larger screen works for me got it on sale so price was right. Lots of storage fast too  like the way it comes on when I return.  Forced to go windows 11",
      "rating": "5"
    },
    {
      "title": "Great laptop",
      "body": "This laptop is amazing! It is big so be aware of that but that is what I was looking for. The graphics are great, the keyboard has a backlit function which is helpful and the mouse is large. I love it!",
      "rating": "5"
    },
    {
      "title": "Happy Customer, Highly Recommend.",
      "body": "Overall incredibly happy with the laptop. Yes, it's heavier than most, but it needs to be in order to handle the beefy battery and larger than average screen. Once you go touchscreen, there is no going back! Thanks HP!",
      "rating": "5"
    },
    {
      "title": "My Fabulous HP Envy",
      "body": "I am 74 years old. I did not start computing until I was in my 40's. I have had others, but I like HP the best. I love my HP Envy. It is so easy to navigate. The keyboard is excellent. It's as smooth as a Cadillac. Visually it is great on my eyes. I just learned Windows 11 last year and I breezed through setting up mine. I have no complaints at this time, and I do not expect any. The Best Buy Geek Squad is amazing and is always there to help with anything!",
      "rating": "5"
    },
    {
      "title": "Efficient, Durable Laptop",
      "body": "Beautiful laptop: operating system runs efficiently, easy to see with the large screen, the key pads offer an easy stroke for fast typing. I can tell this is going to be a durable laptop. It is quite heavy, however, I feel the weight will add to the durability of the laptop.",
      "rating": "5"
    },
    {
      "title": "HP envy Genuine real deal laptop",
      "body": "I've owned quite a lot of computer laptops and desktops but this laptop is by far the best I've have ever owned the technology, performance, battery life and speed are untouchable. I've owned Dell, Acer, and numerous Apple MacBooks they do not touch this HP laptop I have now I highly recommend this laptop to everyone unmatched and untouchable.",
      "rating": "5"
    },
    {
      "title": "HP-Envy 17.3\" Full HD Touch Screen Laptop. LOVE IT",
      "body": "This laptop is perfect for schoolwork, has a nice big screen and numerical keyboard.  It is fast and has exactly the amount of storage I need.",
      "rating": "5"
    },
    {
      "title": "HP Envy Laptop",
      "body": "Easy to use, clear picture and very fast speed. It runs smoothly.",
      "rating": "5"
    },
    {
      "title": "Like a big screen tv for your lap",
      "body": "Phenomenal machine. Ridiculously big screen feels like working on a flatscreen TV on your lap but for the size good weight.  So easy to have multiple windows tiled for research projects and school. Great investment.",
      "rating": "5"
    },
    {
      "title": "Love the touch screen.",
      "body": "The computer is super easy to set up and use.  It is so much faster than my older computer, and I love the touch screen.\n\nI am very glad I opted to spend more to get the larger screen, it is so worth it.",
      "rating": "5"
    },
    {
      "title": "Solid purchase",
      "body": "Love the size of the keyboard. I was specifically looking for a larger laptop with the number keypad separated. I also like that there is a color contrast to the keyboard to make it easier to see in brighter light. I also like the speed of just simply logging on, the touch screen, how lightweight this is for a 17 inch, and mainly the storage space. This laptop should last a very long time. Much needed upgrade from my 12 year old HP laptop.",
      "rating": "5"
    },
    {
      "title": "My favorite laptop",
      "body": "Runs smooth as a charm! Best laptop to date in all my years! Touchscreen an added plus! All phone adapters fit. Laptop goes from 0-100 in battery in an hour or less",
      "rating": "5"
    },
    {
      "title": "JDC",
      "body": "Easy to use, great battery life, good monitor, good weight",
      "rating": "5"
    },
    {
      "title": "Great Buy",
      "body": "I have had this computer for about 30 days and I love it! Huge touch screen with great graphics, powerful processor, and great sound card. I do work related projects on it, along with virtual meetings. It is a very good laptop for the price. It is a little heavy, but it is very thin, and I take it everywhere with me.",
      "rating": "5"
    },
    {
      "title": "Great replacement laptop with everything I wanted",
      "body": "I was looking for a new laptop with a fast Intel processor, good memory, a large display with a touch screen and a built in numeric keypad. This laptop checked all those boxes plus had a lighted keyboard.",
      "rating": "5"
    },
    {
      "title": "Very good product. Would recommend",
      "body": "Perfect screen size. Speed is great and keyboard is large. HP has a good product in the Envy.",
      "rating": "5"
    },
    {
      "title": "Wonderful",
      "body": "GOOD STUFF.  I would have preferred a Cat-5 connector (my bad, I didn't do enough research before I bought it), but the wireless was no problem.  The screen is simply INCREDIBLE, the computer is very responsive - and my FIRST back-lit keyboard (couldn't live without that now).  It is a touch screen, but I just don't want to smear up that beautiful display.  Overall, I can not say anything bad about this computer.  Also, hats off to HP.  Good quality material.",
      "rating": "5"
    },
    {
      "title": "HP 17\" Laptop",
      "body": "This computer is great for my needs. The screen size is wonderful, and clarity is good. Options nice and I'm still exploring them to be completely aware of the various capabilities. I've not run into any problems with speed or the keypad, so that's a good thing. Battery seems good as I watch movies on the laptop and cannot complain about the battery life.",
      "rating": "5"
    },
    {
      "title": "Awesome computer!",
      "body": "This HP computer is fast with great graphics and plenty of RAM and storage.",
      "rating": "5"
    },
    {
      "title": "Works well for me",
      "body": "So far, I've been very pleased with this computer.  It's fast compared to my old one.  The Touch-Screen has come in handy for signing forms.  It is a good value for the price.",
      "rating": "5"
    },
    {
      "title": "HP Envy is a Must Have!",
      "body": "Love the new HP Envy purchase. Waited some time to replace my old HP Envy and I don’t know why I did!  The large screen is easy to see and love the lighted keyboard.",
      "rating": "5"
    },
    {
      "title": "Sam's Review",
      "body": "The computer is fast and I like the big screen! It was quick and easy to set up and came with several features I have not had before.",
      "rating": "5"
    },
    {
      "title": "HP laptop",
      "body": "Bought it for my son for Christmas. My son brought to college and it’s perfect! Good size, great speed and storage. Thank you for the assistance while shopping! Moment good :)",
      "rating": "5"
    },
    {
      "title": "New HP Lap Top",
      "body": "This laptop replaced my old desktop which was so old that it could not accommodate the new windows 365. It is wonderful. Takes up much less space in our computer hutch and is FAST! The Geek Squad transfered all my files and loaded new updated programs.  This was a painless upgrade that is working OH so well...",
      "rating": "5"
    },
    {
      "title": "NPEnvy 17.3in",
      "body": "PC is quick with a bright screen and responsive key board.\n1TB SSD is a plus.  Would have preferred 32 GB ram but it wasn't worth the additional cost. Overall, very satisfied.",
      "rating": "4"
    },
    {
      "title": "Highly Recommended",
      "body": "Love this computer. Easy setup, fast, beautiful screen, nice keyboard (love the number lock). I work with lots of data as well as artwork, so the large screen is essential. Also easy to connect with larger monitors when needed. Been using Apple products for 20+ years...this is my first PC in a long time. If you're looking to transition, I highly recommend this laptop.",
      "rating": "5"
    },
    {
      "title": "HP Envy Laptop Review",
      "body": "HP Envy seems fast and easy to use.  I have owned many HP printers and laptops and this one seems to uphold the same  quality standards.",
      "rating": "5"
    },
    {
      "title": "Will do the job I need it to do.",
      "body": "Like the stream lined looks and lightness. Not as fast as I thought it would be.\nLike having the touch screen.",
      "rating": "4"
    },
    {
      "title": "Love my new HP laptop",
      "body": "Love my new laptop! User friendly to set up with screen, keyboard, mouse, and printer. Super clean display and lightweight; easy to see and transport.",
      "rating": "5"
    },
    {
      "title": "Reliable and Fast",
      "body": "This touch screen PC has been a dream to use. I use mostly office type software and applications and it has been very reliable, incredibly quiet. The abundance of ports, to include a C port, is very handy.\n\n I cannot attest to battery performance as I normally have it plugged in. This is my second HP laptop and my first one, after 8 (maybe 9) years is still running and I still use that at home.",
      "rating": "5"
    },
    {
      "title": "Truly a Best Buy",
      "body": "First time owner of a lap top .  Love every thing about it . The speed is awesome,the size of the screen is easy to see every thing,and the mobilty is perfect . I would reecemend it to all",
      "rating": "5"
    },
    {
      "title": "Glad I chose it over a cheaper laptop.",
      "body": "It is fast and easy to use. Beautiful screen sharpness, contrast and color. I love it. Well worth every dollar.",
      "rating": "5"
    },
    {
      "title": "Great laptop",
      "body": "I bought this laptop a month ago, and it has been absolutely amazing. It's especially perfect for those who work from home and don't have much space for two monitors. The screen is great for multitasking, easily allowing you to split and work with different windows. It can also be adjusted to protect your eyes, which is a big plus. Overall, I'm very happy with the purchase. Best of all, Best Buy had a $499 discount when I bought it, so I got a great laptop for an even better price.",
      "rating": "5"
    },
    {
      "title": "Great computer",
      "body": "So far, this laptop has been great! It's fast and easy to set up. I was a little unsure if I was going to love the size of this laptop, but I love the size.",
      "rating": "5"
    },
    {
      "title": "Great device",
      "body": "I was looking for a long time a good laptop,in the middle price category and high quality.I found what i wanted.Great device with a slim ergonomic design.Big screen,excellent image quality,technical data at the highest level,it works fast,without delays.My expectations were met.The device really deserves praise.I m very glad.The best gift for a good mood.",
      "rating": "5"
    },
    {
      "title": "Wife loves this machine!",
      "body": "Wife loves this machine! Good picture, battery lasts and just today she stated how fast it charges up!\nRuns pretty fast with the 7 processor and 16 gigs of ram.\nJust do it, you will be happy.",
      "rating": "5"
    },
    {
      "title": "Great Computer and Service at Best Buy",
      "body": "I love working on this computer.  The screen is perfect and accessing the various programs and storage are easy.  I had a little difficulty transferring some of my data, but the Geek Squad solved those problems.",
      "rating": "5"
    },
    {
      "title": "Great buy!",
      "body": "It’s a really good working laptop. Not one you want to carry around much but I like the screen size and there is a number key pad that I really like and it’s runs faster than most computers. The monitor is hi definition and great to watch movies or tube on.",
      "rating": "5"
    },
    {
      "title": "Nice laptop",
      "body": "This is a nice laptop. I like the depth of the keys on the keyboard and it is very lightweight. The screen size is perfect. I feel like the price was good for this laptop. I would recommend it.",
      "rating": "5"
    },
    {
      "title": "Very satisfied with this Laptop",
      "body": "I like the speed, performance, and the look of this laptop. Very satisfied with this purchase.",
      "rating": "5"
    },
    {
      "title": "HP envy 17in",
      "body": "Couldn't be happier with the computer does everything it says it's going to do and more being the 17 and a half inch screens very nice it's like having a big screen TV almost I would recommend it for anyone and any walk of life and playing games on to order and groceries",
      "rating": "5"
    },
    {
      "title": "AI made me do it!",
      "body": "I hadn’t bought a computer in six years. I’m a 79 year old retiree and use my computer basically to review, manage and plan my investments to generate income to fund my retirement. As a retired CPA I am driven by spreadsheets to capture and manipulate data. I know what I wanted out of my new computer but so much has changed since my last purchase that I had no idea where to start I making a selection. So I turned to AI and asked a bunch of questions and got wonderful recommendations, including this HP Envy.\n\nI started with a different computer that lasted a week and it was replaced three weeks ago by this Envy. Best Buy made it extremely easy to turn in the first one in favor of the Envy. It is wonderful. The 17.3 inch screen was a must have and it is terrific while easy in my eyes. Plenty of memory and processor speed. A couple of pounds lighter and features like touch screen, back lighted keyboard new WiFi make it a pleasure to work with. The setup was easy and I learn something new every day.",
      "rating": "5"
    },
    {
      "title": "Love it!",
      "body": "I have an older version of this laptop and was so happy to find it's updated version. I use my laptop to run a small eBay business and did not want anything different from my current laptop. I love the size, the keyboard has the secondary number keys which I use a lot and many current laptops don't have. It was easy to transition from my old to this one and set up was a breeze. Since it is a big screen, this isn't a travel friendly size laptop, but that's not a deal breaker for me.",
      "rating": "5"
    },
    {
      "title": "My New HP Envy 17.3 HD Touch-Screen Laptop",
      "body": "I found this laptop, be enjoyable to use.  A higher capacity SSD, (twice what I had on my other machine), a newer 14th Generation Processor, a nice speaker, numeric keypad, wider & bigger screen, 3 USB A Ports, and 2 Thunderbolt 4 USB C ports.  All packaged in a beautiful computer.  The name is perfect, one would be envious of this laptop.  All that and it does have Full HD Touchscreen, and 16GB of memory.",
      "rating": "5"
    },
    {
      "title": "Customers will ENVY you!",
      "body": "Love my new laptop.  It has touch screen turns on and off perfectly big screen and fast.",
      "rating": "5"
    },
    {
      "title": "HP Laptop",
      "body": "Was in need of a new laptop and this one meets all of my requirements. The battery doesn't last as long as I would like it to while using some applications but even still it lasts a lot longer than my old computer did. That is my only complaint overall. This new computer is fast even upon start up which is one of the things I was looking for.",
      "rating": "5"
    },
    {
      "title": "Official Ewax",
      "body": "The machine is fast and reliable to this point. However, there are some features that I am having trouble with. Such as the keyboard staying back lit. I am trying to find these answers. Overall, though, I like the machine. Windows 11 is a bit strange though.",
      "rating": "5"
    },
    {
      "title": "REVIEW",
      "body": "Works Great Big Screen and Keypad is great! OVERALL LOVE THIS LAPTOP",
      "rating": "5"
    },
    {
      "title": "Great laptop",
      "body": "The laptop is everything I needed. It is fast,  smooth and  starts like a dream.",
      "rating": "5"
    },
    {
      "title": "New laptop",
      "body": "My experience at Best Buy when purchasing my new laptop computer was great. Salesman Kai was friendly and knowledgeable with no high pressure. I love the speed.My old PC had gotten so slow. The bright clear screen is great\n I love the convenience of the laptop.",
      "rating": "5"
    },
    {
      "title": "GREAT LAPTOP",
      "body": "Very great computer for getting not only\nWork done but gaming too. Can support both with mini issue and it’s giant screen is great if you have sight issues. Touch screen is also nice as well when I’m in bed",
      "rating": "5"
    },
    {
      "title": "Best computer I’ve ever owned!",
      "body": "This computer is FLAWLESS!\nFast, super user friendly, simply amazing! \nI own a consulting firm and my computer is my ‘office’ everywhere I go. This computer will be with me for the next 5 years at least!!!\nHIGHLY RECOMMEND!",
      "rating": "5"
    },
    {
      "title": "Love my HP Envy",
      "body": "I hadn’t bought a new laptop in many years so was overdo for technological updates. This HP Envy laptop with its wide screen and touch screen option and slim good looks is fabulous. Just wish there weren’t so many intrusive ads and “Junk” trying to crowd the screen. The Microsoft Office updates are time saving and make my spreadsheet work even easier.",
      "rating": "5"
    },
    {
      "title": "New HP Laptop",
      "body": "Have had computer for one week with no problems.  My first Windows 11.  Everything from my older HP was sent over to this new computer.  Love the touch screen and the fast processor.  Vivid screen colors.  Speakers have a lower full volume than I am used to though.",
      "rating": "5"
    },
    {
      "title": "Just what I was looking for.",
      "body": "I purchased this laptop on the recommendation of a friend. It is exactly what I needed for work and home. The size is a little large, but I was looking for something with a bigger screen than my last laptop. and this fits the bill.",
      "rating": "5"
    },
    {
      "title": "Love my Lappy",
      "body": "Has a very clear picture and good size screen. Easy to navigate.",
      "rating": "5"
    },
    {
      "title": "Great large laptop",
      "body": "Touch screen is very responsive and so is the touch pad. The laptop is fast and the charger is well made. The only downside is this laptop is too large to use in a coach airplane seat. If you travel a lot and need to use a laptop, you might want to consider a slightly smaller model.",
      "rating": "5"
    },
    {
      "title": "CLEARLY the \"Best Buy in HD monitors",
      "body": "Sharp, clear images and print. convenient size, many, many features that even now, I have not fully explored, used or tried, to busy enjoying the ones I do know about and a few of the ones I have discovered on my own.",
      "rating": "5"
    },
    {
      "title": "Fantastic HP Laptop! Absolutely love it!!!",
      "body": "Fantastic Laptop! Super fast, great screen and keyboard! Looks very modern and up to date! Love it totally!!",
      "rating": "5"
    },
    {
      "title": "Fantastic WFH laptop computer!",
      "body": "I absolutely LOVE my laptop! It is quick, quiet and has an amazing battery life! Fully charged, it allows me to work an entire day before needing to be charged. It doesn't get hot, and it runs beautifully. I really love the size too. It's the best of both worlds with a good screen size but not so big that it's cumbersome to carry around. Perfect for WFH or working in a coffee shop, etc.  It was very easy to set up too! Great purchase! Highly recommend!",
      "rating": "5"
    },
    {
      "title": "Love it!",
      "body": "This is my second HP Envy laptop and a definite upgrade from the last one. It's fast, has tons of space for pics and videos, and was super easy to set up.",
      "rating": "5"
    },
    {
      "title": "Satisfied",
      "body": "Easy to use. Plenty of power and storage. good backlight.",
      "rating": "5"
    },
    {
      "title": "Looks Good, runs great and big screen/hard drive",
      "body": "Fast smooth looks good huge hard drive and screen. Good battery life.",
      "rating": "5"
    },
    {
      "title": "Best computer ever!",
      "body": "This computer is very fast compared to my last one. I am able to do spreadsheets and financial statements on it I use the side by side on the screen and the 17” size is perfect.",
      "rating": "5"
    },
    {
      "title": "Great review",
      "body": "Great product. Much better than my old product. Speed, graphics, storage",
      "rating": "5"
    },
    {
      "title": "Easy to use",
      "body": "We love it that is a touch screen and easy to navigate and it's fast.",
      "rating": "5"
    },
    {
      "title": "Fabulous",
      "body": "This is my 3rd HP Envy. I had my last Envy for 11 years, unfortunately parts to fix the fan aren’t available any longer. I love the great real estate of this new laptop, making my computing a breeze. Copilot is a game changer as I don’t need another device to use AI. It could use additional USB ports but I did buy a hub to accommodate more devices.",
      "rating": "5"
    },
    {
      "title": "Fast Laptop and nice screen",
      "body": "Very fast machine and excellent 17 inch screen with accurate graphics.",
      "rating": "5"
    },
    {
      "title": "Great product",
      "body": "Easy to set up. Perfect for family use.\nMovies, gaming, etc, great graphics \nAnd picture quality. I’m not tech savvy,\nAnd I figured out everything thing on\nMy own. Very happy with purchase.",
      "rating": "5"
    },
    {
      "title": "HP LAPTOP 17.3 inch",
      "body": "This HP laptop has a large 17.3 screen. The speed is very quick. It actually mirrored my HP ENVY 4000 desktop. I rate this HP laptop high on my list.",
      "rating": "5"
    },
    {
      "title": "Love my hp laptop",
      "body": "I love the HP Envy laptop 17.3.  I have always ised Hp.  My last one lasted me over 15 years.  The new one is phenomenal.  It is fast, loads fast and has aitomatic identity check.  I love it",
      "rating": "5"
    },
    {
      "title": "Best HP Laptop",
      "body": "Brought this laptop to replace my other HP that died unexpectedly. I love this new laptop, it has all the features I need and more. Best replacement laptop decision. I love the larger screens for working on multiple projects.",
      "rating": "5"
    },
    {
      "title": "Great PC",
      "body": "This is the best HP laptop I have owned so far.  It is fast and the battery life is great.  Also, the feel of the computer is so much better.  I previously owned an Envy with the square edges, and I am grateful that the new Envy has rounded edges as it doesn't dig into my wrist like the old one did.",
      "rating": "5"
    },
    {
      "title": "HP Envy",
      "body": "Great product. Large screen for multiple windows, clear/crisp display, numeric keypad for financials and a touch screen to make life easier! Large touch pad, lighted keyboard and battery that lasts all day. I would definitely recommend this laptop!",
      "rating": "5"
    },
    {
      "title": "Great for low-key Gaming",
      "body": "5/5. If you want a laptop for gaming but don't want to spend thousands, this is the way to go. I only play Minecraft and The Sims on it, but it is perfect for those games. The graphics that come with the laptop are easy to update and look amazing compared to my previous laptop. I can finally play my games with the maximum graphics settings. I definitely recommend the protection plan, I was able to have someone remote into my laptop and help solve an issue I was having with ease. Overall I am super happy I purchased this laptop.",
      "rating": "5"
    },
    {
      "title": "My new HP laptop",
      "body": "Great Computer. the 17 inch screen is the perfect size and the screen is bright and vivid. Never had a touch screen before, but am really enjoying it.",
      "rating": "5"
    },
    {
      "title": "Great Open Box Value",
      "body": "It's been great so far.  Got it as an open-box for under sale price and it was in excellent condition. \n\nI've had it about 2 weeks. Not overly bloated with software. Starts up fast and has a huge 17.3 screen. That might be an issue for frequent travelers but this is a at-home laptop for us.  The sound is so much better than our previous laptop. I just put it on the kitchen counter and turn on spotify and it sounds really full. \n\nIt is compatible with thunderbolt docks. I have a thunderbolt 3 dock and this is thunderbolt 4 (is just the usb C type connector). \n\nI did have to install some driver software to get the dock to work properly. Just find your dock on HP support website.",
      "rating": "5"
    },
    {
      "title": "Happy with our purchase!",
      "body": "Nice looking laptop, love the feel of the keys when you type.\n\nScreen images are sharp and detailed.",
      "rating": "5"
    },
    {
      "title": "Computer",
      "body": "It is excellent and works very fast, the screen is very clear, the videos and movies look great, I recommend it 100%.",
      "rating": "5"
    },
    {
      "title": "HP is the best!",
      "body": "This new HP Envy is exactly what I needed.  Because I work from home from time to time I need the 10 key pad to the side, which not many laptops have any more.  It also has the touch screen.\nI've had other brands but I HP is the top as far as I'm concerned.",
      "rating": "5"
    },
    {
      "title": "Best of the best",
      "body": "Bought this to replace my olde HP 17 in laptop that I bought 9 yrs ago on black Friday. What a machine, loved the olde one, but was starting to act up. Hard drive was finally slowing down, after 9 YEARS. Got my $ worth! I will continue to buy HP's great working no trouble... Wish I would have switched sooner, love the new keyboard. Larger size, smooth clicking! Touch screen is a must, lit keys, and size! Just love it Geek squad was great also! Made it so easy.",
      "rating": "5"
    },
    {
      "title": "Happy best buy buyer",
      "body": "Great replacement computer,  very happy with it. Fast processor,  lots of bells and whistles.",
      "rating": "5"
    },
    {
      "title": "HP Envy 2025",
      "body": "I really enjoy this large screen laptop, it make web browsing and work easier and more fun.",
      "rating": "5"
    },
    {
      "title": "Great laptop",
      "body": "So far so good- easy to use. I am not great on computers so anything that makes it easy is great.",
      "rating": "5"
    },
    {
      "title": "Fast reliable and beautiful design",
      "body": "I absolutely love this laptop. The screen is huge and super clear which makes working and streaming really enjoyable. It runs fast and handles everything I need without slowing down. The design feels sleek and professional. I’ve been using it daily and the performance has been great. Perfect for work and personal use. Highly recommend it if you want a powerful and reliable laptop.",
      "rating": "5"
    },
    {
      "title": "Laptop",
      "body": "It works very well.very fast. Battery last good.  Glad I purchased.",
      "rating": "5"
    },
    {
      "title": "Great new computer",
      "body": "We replaced an old HP Envy with this newest one and we are delighted.  Everything works quickly.  The systems are quite intuitive.  The color and sound are superb.  A real winner!",
      "rating": "5"
    },
    {
      "title": "Love my new laptop",
      "body": "Love the big screen and lots of storage! Great replacement for my PC.",
      "rating": "5"
    },
    {
      "title": "Good computer",
      "body": "This computer has been great.  I love the big screen as I do a lot of video work.  The screen is very sharp and the computer is fast.",
      "rating": "5"
    },
    {
      "title": "Great laptop",
      "body": "Great laptop.  Easy to setup and it's fast.   Works well for me.",
      "rating": "5"
    },
    {
      "title": "Speed at the touch of your mouse",
      "body": "My new hp is incredibly fast. I love how it recognizes me from the moment I first touch the mouse. My Home Screen pops up and all the up to date software makes production extremely easy and so much faster than my old laptop.",
      "rating": "5"
    },
    {
      "title": "Third time is the charm",
      "body": "This is my 3rd HP Envy (I managed to kill the other two).  Love the touchscreen and the 17\" is easier on my elderly eyesight.  Seamless online transaction, thanks Best Buy",
      "rating": "5"
    },
    {
      "title": "New Computet",
      "body": "Screen clear- able to use easily \nSpeed is so much better that last one",
      "rating": "5"
    },
    {
      "title": "Laptop logic.",
      "body": "This  laptop  is great!!  It  is  easy  to  use.  Glad I bought  it.",
      "rating": "5"
    },
    {
      "title": "computer user",
      "body": "I find this machine hard to use and difficult to customize. The font too small and cannot be enlarged. i bought the largest laptop and cannot read any of the hp settings print.\n\nII replaced an hp laptop with this machine, i should have known the new one would not be user friendly",
      "rating": "3"
    },
    {
      "title": "Chris was awesome! Very professional and helpful!",
      "body": "CHRIS, in electronics was a fantastic associate during the purchase of this product.  He was very knowledgeable regarding the latest laptop releases and easily and readily explained all features in depth.   He took his time to ensure I was getting exactly what I wanted to include making recommendations and ensuring I was set up for warranty.  Thank you, Chris!  You deserve recognition for your excellent customer service!\n\nRegarding the laptop, my only disappointment is that my previous HP Envy turned into a tablet, flipping completing in tablet position.  This large, newer model does not.",
      "rating": "5"
    },
    {
      "title": "Great all-around computer.",
      "body": "The HP navy meets all my expectations. The display is excellent for viewing photos and the SSD makes for speedy loading of apps and data.   It performs very well, overall.  Windows 11 takes some getting used to.  I am not fond of the One Drive feature operation.  Finding saved files is confusing.  I would recommend this computer.",
      "rating": "5"
    },
    {
      "title": "Laptop",
      "body": "Works as it should , super fast, great clarity and love touch screen option!",
      "rating": "5"
    },
    {
      "title": "Laptop",
      "body": "Excellent computer very fast lots of storage and battery lasts",
      "rating": "5"
    },
    {
      "title": "Got all I needed",
      "body": "Love the big touch screen. I had specifics I wanted and it was big touch screen and number key pad on the keyboard. This fulfilled all my needs.",
      "rating": "5"
    },
    {
      "title": "Perfect screen suze",
      "body": "Perfect screen size. Touch screen hrlps navigating quickly. Highly recommend.",
      "rating": "5"
    },
    {
      "title": "Better than Apple.",
      "body": "Great laptop with a really good keyboard. So much better than an Apple laptop. My Apple laptop was seriously annoying with all the stupid passwords. This laptop you open it, and it opens when it sees you.",
      "rating": "5"
    },
    {
      "title": "Really Enjoying It",
      "body": "Love it.  Lightweight considering its size.  Very responsive and easy touchpad.  Had an older model like this, so this is a replacement and I have to say it is greatly improved.  Great battery life.",
      "rating": "5"
    },
    {
      "title": "Best laptop purchase",
      "body": "Very good laptop, beautiful display, fast processing and good amount of storage",
      "rating": "5"
    },
    {
      "title": "DR",
      "body": "Great computer. Fast and easy to manage . Large screen",
      "rating": "5"
    },
    {
      "title": "Laptop Review",
      "body": "It is a great laptop.  Lightweight and no performance issues at all.",
      "rating": "5"
    },
    {
      "title": "Size and looks do matter lol",
      "body": "This laptop is beautiful! The graphics are amazing and the processor is extremely fast. Slightly on the heavy side, but that’s not a big deal for me.",
      "rating": "5"
    },
    {
      "title": "Reliable, great laptop",
      "body": "I have been using my laptop practically everyday since I bought it. It has been a lifesaver. It's easy the carry around, battery life has been good, and the numeric keypad are just a few things I love about it. Great laptop.",
      "rating": "5"
    },
    {
      "title": "Perfect laptop",
      "body": "Computer was easy to start up and set up.   Got it on sale and am really happy with the speed and storage.   Would like to have a choice of a color other than gray, but this works fine.",
      "rating": "5"
    },
    {
      "title": "Great device and superb performance",
      "body": "Excellent system very user friendly with a vivid screen and a truly beautiful design",
      "rating": "4"
    },
    {
      "title": "HP Envy 17.3\" Full HD -A Great laptop.",
      "body": "Lighted Key board and controlable display lighting are a great feature. The Intel Core Ultra 7 is very fast and efficient.",
      "rating": "5"
    },
    {
      "title": "Great computer",
      "body": "Love it. Super fast and graphics are amazing. I’ve had many computers but this one is the best",
      "rating": "5"
    },
    {
      "title": "My HP",
      "body": "Great laptop! it was worth every dime. I needed the touch screen to be big enough for presentations and schoolwork my HP exceeded my expectations.",
      "rating": "5"
    },
    {
      "title": "Laptop",
      "body": "Speed is fast. Display has great quality. Enjoying it so far.",
      "rating": "5"
    },
    {
      "title": "Happy With The HP ENVY Laptip",
      "body": "I am happy with this HP ENVY laptop.  It had the 17\" screen size, 16 GB memory, 1TB SSD and the price I wanted.  Went to 3 Best Buy branch stores to look for those features as each store carried different models.  HP was not on my mind, but the brand name, sale price and the silver color  did helped with the decision to buy it.",
      "rating": "5"
    },
    {
      "title": "Lap top",
      "body": "I love it.  It is so easy to work. I am not very computer savvy but his lap top is the best.  It does things that inam learning eryday and is very easy to figure out.",
      "rating": "5"
    },
    {
      "title": "hp laptop",
      "body": "the product is great - it replaced an older similar model, but is lighter faster and has many more features",
      "rating": "5"
    },
    {
      "title": "Envy Laptop",
      "body": "Love this laptop. Love the design and, features. This was a huge update for me. Love the touch screen. Would recommend this.",
      "rating": "5"
    },
    {
      "title": "HP large screen",
      "body": "HP is an ease to use and the large screen really helps when on the run. The operating system is top notch",
      "rating": "5"
    },
    {
      "title": "So far so GREAT!",
      "body": "Love it! SOOOOOO much faster then the antique I have. And the 17.3\" screen is WOW!",
      "rating": "5"
    },
    {
      "title": "HP Envy fan",
      "body": "great computer and just getting started. awesome picture, fast processing, and beautiful design.",
      "rating": "5"
    },
    {
      "title": "HP Envy laptop",
      "body": "Sleek lightweight design. The display is crisp and colorful. Speed is excellent.",
      "rating": "5"
    },
    {
      "title": "Great laptop at a great price!",
      "body": "Great laptop for the price--just fast enough for what I need (video calls, watching movies). Love the nice big screen and sharp graphics!",
      "rating": "5"
    },
    {
      "title": "Computer",
      "body": "I love my computer. Perfect for my needs. Touchscreen is easy to use. Brightness is just right.",
      "rating": "5"
    },
    {
      "title": "Love it",
      "body": "this laptop is amazing- lighting fast, easy to use\nsalesman did a great job on explaining the features etc \nvery good experience",
      "rating": "5"
    },
    {
      "title": "Everything I need and more",
      "body": "I love this laptop. It handles all of my needs home, work, and moderate gaming with ease. \n\nMy only complaint is the weight. It is quite heavy compared to my prior laptop of a different brand but that's not a big deal.",
      "rating": "5"
    },
    {
      "title": "Great laptop",
      "body": "Great laptop. The speed is excellent. It's very lightweight. No complaints at all.",
      "rating": "5"
    },
    {
      "title": "Hp Envy is perfect for our needs!",
      "body": "We bought an Hp Envy in 2015 from Best Buy and when it was time to replace it we we so glad to see the Envy was still available. I do a lot of 10 key work and so appreciate the layout of the keyboard. Love the bigger screen.",
      "rating": "5"
    },
    {
      "title": "A good choice",
      "body": "I have had this new laptop for a month; all of my old things work well.  This laptop is easy to use and light weight. I do a small newsletter, play online bridge, keep in touch with friends, and shop. I know my needs will be fulfilled for several years. I recommend this product and the nice Best Buy Geek who helped me get the info from my very old tower to this sleek, new tool.",
      "rating": "5"
    },
    {
      "title": "Review",
      "body": "Great laptop. Easy to use. Long battery life. Light and portable.",
      "rating": "5"
    },
    {
      "title": "everything is perfect except pricy",
      "body": "This 17-inch laptop is powerful and fast, perfect for heavy tasks like video editing or running demanding software. The large screen is great for productivity. A solid choice if you need performance and space.",
      "rating": "5"
    },
    {
      "title": "Mr.",
      "body": "Great service at the store when making the purchase. Once I became familiar with the differences between this computer and my older one, I was thrilled with the new software package. I also enjoy the faster response time moving through the various operations. To summerize, I like the computer and it will do what I want if to do.",
      "rating": "5"
    },
    {
      "title": "Happy",
      "body": "So far its has exceeded my needs. Battery lasts well.",
      "rating": "5"
    },
    {
      "title": "It's an HP so it's Top-Notch",
      "body": "For us \"older folks\", the larger 17\" screen is a nice touch. And, as usual, this HP product is top-notch. One thing caught us by surprise - no CD/DVD drawer. Understand now that laptops dropped them for weight savings. Easy to deal with.",
      "rating": "5"
    },
    {
      "title": "Really good computer",
      "body": "Really good computer, covers all my needs. It is really fast and I love the design",
      "rating": "5"
    },
    {
      "title": "Great quality",
      "body": "It works really well looking awesome very very fast",
      "rating": "5"
    },
    {
      "title": "Amazing laptop",
      "body": "Love this laptop! Fast, fast, fast! Couldn’t be more pleased!",
      "rating": "5"
    },
    {
      "title": "Good laptop",
      "body": "Great laptop. Quick boot-up, loads of storage. Nice feeling keyboard.",
      "rating": "5"
    },
    {
      "title": "HP laptop",
      "body": "This laptop is the best that I have ever owned (and I have had several). Fast response, good battery life, color quality great.",
      "rating": "5"
    },
    {
      "title": "HP always",
      "body": "Love the colors. Always love HP computer & the only thing I dislike about today computer is, not enough USB slot, no CD ROM & is too thin. This computer is just what I need for my business. it's pretty fast,",
      "rating": "4"
    },
    {
      "title": "Good quality vs price",
      "body": "Good quality vs price. Excellent screen size to work at home",
      "rating": "5"
    },
    {
      "title": "The Best Laptop",
      "body": "I love my laptop.  The wider screen is perfect for my needs.  I also love the features.  very easy for me to use.",
      "rating": "5"
    },
    {
      "title": "Hp laptop computer.",
      "body": "Great sound and picture.  Easy to use. Very good touch screen.",
      "rating": "5"
    },
    {
      "title": "Great Laptop!",
      "body": "My husband loves this laptop with its large screen.",
      "rating": "5"
    },
    {
      "title": "love it",
      "body": "love it, perfect size, love that it has numbers on the side so i don't have to carry extra keyboard",
      "rating": "5"
    },
    {
      "title": "Great laptop",
      "body": "This HP envy laptop has great features. Affordable and especially big screen. It’s heavy though but it’s ok.",
      "rating": "5"
    },
    {
      "title": "My new laptop",
      "body": "I'm still learning to use it but I absolutely love it!",
      "rating": "5"
    },
    {
      "title": "Fast Easy and at pre-tariff store sale price!",
      "body": "This is the second HP-Envy (different screen sizes) we bought in the past 15 months. This particular one replaced our 15 year old, three piece desktop, so it is obviously faster, greater memory, and takes up much less room. We got it not only before the tariffs kicked in, but also on sale, so we were happy with that.",
      "rating": "5"
    },
    {
      "title": "So Far So Good",
      "body": "I've only used this computer for a short time, and so far it is great.  It is very fast and easy to set up.",
      "rating": "5"
    },
    {
      "title": "large screen laptop",
      "body": "I needed a large screen for my lap top due sight problems. This one fit the bill with 17.3 inch screen. However, i am not able to use the new features on windows. Unable to use new outlook with some of my e-mail accounts and windows 11 is very different from earlier versions I am 72 and it is getting hard for this old dog to learn new tricks!",
      "rating": "4"
    },
    {
      "title": "HP Envy Laptop 17 inch",
      "body": "I have had the laptop for a few weeks and it is working great. I am happy for my purchase and thankful to Best Buy Geek Squad for setting it up for me.",
      "rating": "5"
    },
    {
      "title": "New HP Envy 17.3\" HD Touch-Screen Laptop.",
      "body": "This purchase was replacing a failing HP laptop that was about 7 years old.   I'm still learning all the new and improved things.   I am vey pleased with my choice.  The battery charge lasts about 7-8 hours and I'm loving that!  My experience at Best Buy was really great.  Lots of helpful advise.",
      "rating": "5"
    },
    {
      "title": "RB",
      "body": "So far enjoying the new laptop. Like the large screen.",
      "rating": "5"
    },
    {
      "title": "Superb Customer Service",
      "body": "Total difference from my smaller hp envy. Best Buy their pricing was on spot but the customer service was outstanding. I will go to Best Buy for all my future needs.",
      "rating": "5"
    },
    {
      "title": "New HP Laptop",
      "body": "very happy with the purchase. if you are looking for a large screen laptop I would highly recommend considering this as an option",
      "rating": "5"
    },
    {
      "title": "Solidly Built",
      "body": "The main reason for this purchase believe it or not was because of the hinge I had a dell which was great but the hinge broke after 15months I was going to get a replacement but saw this unit the Envy and looked at hoe it\nwas physically built and had equal and or better specs as the Dell. So far so good It performs well and it is sturdy",
      "rating": "5"
    },
    {
      "title": "Great computer",
      "body": "I purchased this for my husband and he loves it!!  He really likes the screen size and uses it for work every day.  I would definitely recommend.",
      "rating": "5"
    },
    {
      "title": "New laptop",
      "body": "Excellent, large screen great speed and easy setup, wonderful upgrade.",
      "rating": "5"
    },
    {
      "title": "Perfect fit",
      "body": "The functionality is amazing. Fast, user friendly, and appropriate for my needs.",
      "rating": "5"
    },
    {
      "title": "Fast and easy to operate",
      "body": "This laptop is so easy to operate. And it's so much faster than my previous laptop.",
      "rating": "5"
    },
    {
      "title": "pretty happy with it overall",
      "body": "got it for school and casual gaming- can run minecraft with shaders and some beefier games very well :) graphics are good, only thing is it feels like its dies a little quickly, but the only comparison i have for battery is a 2014 macbook that could only run youtube lol. overall very happy with it though, definitely recommend :)",
      "rating": "5"
    },
    {
      "title": "Home",
      "body": "I purchased my first HP Envy 360 back in 2016. We loved it. I upgraded to a bigger screen. I use my laptop for basic internet and bills mostly. It was time for an upgrade and couldn’t be happier. We came back to Best Buy b//c of the great customer service.",
      "rating": "5"
    },
    {
      "title": "Made the switch",
      "body": "This is my first lap top and the ease of use is superior.  I've had computers for ever and didn't want a lap top.  This year I decided to try and this one exceeds my expectations.  Haven't had the computer on since purchase.",
      "rating": "5"
    },
    {
      "title": "Love it",
      "body": "Great laptop, fast, light and graphic card great. Highly recommend.",
      "rating": "5"
    },
    {
      "title": "Great Overall Experience",
      "body": "Purchased a new computer from Best Buy. Started looking a couple months ago when my 13 year old Toshiba was acting up.  Excellent service from the Geek Squad then and again when I came back to purchase.  Had an associate, Zach, assist me when I was deciding between a couple models and then in choosing a new mouse and keyboard. No pressure at all and very informative.  Then the Geek Squad worked their magic and transferred data and formatted the new computer to mirror my old one.  Have the “total” Geek package which includes appliance repair options and EVERY contact/situation handled professionally, quickly and stress free!",
      "rating": "5"
    },
    {
      "title": "No problems",
      "body": "I love my new computer, and it's performance is unbelievable. Being new to Windows 11, I had several questions so off to Geek Squad to ask if the problem was with the computer or me. Of course, it was me. The knowledge of the personnel was astounding. So, off to home. Many thanks to Best Buy and the Geek Squad,",
      "rating": "5"
    },
    {
      "title": "Great computer and great price!",
      "body": "This computer is great to work with. I love the speed and ease of use.",
      "rating": "5"
    },
    {
      "title": "Laptop purchase",
      "body": "Great laptop. Easy to use and I love the larger screen",
      "rating": "5"
    },
    {
      "title": "Nice laptop",
      "body": "Love it! It’s been easy from set up to start up out of the box. Runs fast.",
      "rating": "4"
    },
    {
      "title": "HP ENVY",
      "body": "We are very pleased with our new HP ENVY LapTop   computer.  The larger key board and number pap are great.",
      "rating": "5"
    },
    {
      "title": "Great Computer!!",
      "body": "This is a perfect laptop for a 79-year-old grandma.  We first purchased a smaller HP Envy and found no number keyboard, smaller keyboard, smaller screen, etc.  Traded it for this wonderful larger HP Envy!!  Keyboard is great!!  Touch screen great!! Lightning fast!! Number keys just like my previous Envy.  All is good!!",
      "rating": "5"
    },
    {
      "title": "Pen included",
      "body": "Lightweight and fast. Pen included with is good for designers.",
      "rating": "5"
    },
    {
      "title": "Love my Envy",
      "body": "Perfect! It is just what I was looking for! It Runs smoothly!",
      "rating": "5"
    },
    {
      "title": "Future Proof",
      "body": "Great Laptop. Super fast and killer graphics. Recommended.",
      "rating": "5"
    },
    {
      "title": "Very pleased",
      "body": "It’s been a terrific laptop so far. It was a breeze to set up with user friendly controls. Crisp display, backlighting and camera resolution. Got it on sale from BB. Big upside is that it’s much faster in response time than my old laptop. I also like the larger screen size.",
      "rating": "5"
    },
    {
      "title": "Happy",
      "body": "My HP Envy is fast and a great lap top computer. It fits my personal computing needs perfectly!",
      "rating": "5"
    },
    {
      "title": "Great Everyday Laptop",
      "body": "This laptop was a massive upgrade over my 5-year-old HP Envy. The 16-core CPU and 16 GB of memory make for a very fast laptop that can easily handle multiple tasks at once. The screen and battery life are good but could be better. I was able to buy this laptop for $300 off at Best Buy, which was excellent value for the price.",
      "rating": "4"
    },
    {
      "title": "HP",
      "body": "I bought the HP Laptop that was supposed to have been ordered on tax free weekend but the Dell was ordered in error by the salesperson. Very upset that I had to pay the tax due to a store error. returned the Dell Laptop",
      "rating": "5"
    },
    {
      "title": "HP-Envy laptop",
      "body": "The HP laptop is performing well.  The 17.3-inch screen makes working with the laptop much easier than having a small screen.  I don't know about the battery life at this time.  According to the specifications, the battery life should be longer than on previous laptops.",
      "rating": "5"
    },
    {
      "title": "My new computer",
      "body": "I love this computer. Nice, easy to handle and i can store a lot of stuff on it.",
      "rating": "5"
    },
    {
      "title": "It's good",
      "body": "So far so good. I like the clarity and the screen size and it doesn't overheat.",
      "rating": "4"
    },
    {
      "title": "like it",
      "body": "I really enjoy the computer. It's a lot faster and it works for what I need it for.",
      "rating": "5"
    },
    {
      "title": "My new HP Envy is great!",
      "body": "I'm very pleased with my HP Envy laptop.  It is an excellent replacement for my previous 12 year old laptop, providing new features and software that greatly enhance my data access and processing activities.",
      "rating": "5"
    },
    {
      "title": "Best Laptop I’ve Ever Had",
      "body": "I have had this laptop for going on 6 months and I don’t have a bad thing to write about it, if you’re looking for the perfect combination of look and performance this is the way to go.",
      "rating": "5"
    },
    {
      "title": "Great option for work or school laptop",
      "body": "Great laptop for work out school. It has a great display with many apps available. Very user friendly and runs smoothly without any issues even when having multiple windows and apps running",
      "rating": "5"
    },
    {
      "title": "HP Envy 17.3",
      "body": "Excellent computer! HP Envy 17.3\nI had the exact same model but was getting aged.\nSo another one was in order.",
      "rating": "5"
    },
    {
      "title": "The don",
      "body": "Amazing quality great battery life. Speaker system feels like its surround sound.",
      "rating": "5"
    },
    {
      "title": "HP-Envy 17.3 Computer",
      "body": "I love the new computer.  Beautiful screen, very fast response time, maintains battery charge a long time.",
      "rating": "5"
    },
    {
      "title": "My Envy is the envy of my friends and family!",
      "body": "This is by far the most luxurious laptop I have used! I love everything about it, from the size of the screen to the many features, but the best is the numeric keypad incorporated into the keyboard. Excellent for those of us who work with numbers. Could not be happier with this purchase!",
      "rating": "5"
    },
    {
      "title": "Purchased before the Tariffs!",
      "body": "It's thin, sleek, lightweight and easy to transport.",
      "rating": "4"
    },
    {
      "title": "HP computer",
      "body": "The best computer. Easy to setup and you are ready to go.",
      "rating": "5"
    },
    {
      "title": "Way better than my old HP",
      "body": "Faster, much better graphics. Much lighter as well as thinner",
      "rating": "5"
    },
    {
      "title": "Good .",
      "body": "After a month I can’t complain. Battery life is very good also",
      "rating": "4"
    },
    {
      "title": "Exceeds Expectations",
      "body": "This has exceeded my expectations. One positive thing that is an inconvenience: the screen turns off when I walk away. Since I work with sensitive information, it's good when it occurs, and the screen comes back on when I come back, but I'm used to locking my screen when I walk away.",
      "rating": "5"
    },
    {
      "title": "Missing Features",
      "body": "I would have given this item a 5 but it is missing 2 features that I did not find out about until after I bought it that I want to make everybody aware of.  All of my previous laptops had both of these features.\n\nThere is no SD Card Reader; gee, how much would it have cost HP to put one in?  And there is no RJ-45 jack so if you lose your wireless router then you have no way to access the Internet.",
      "rating": "4"
    },
    {
      "title": "HP ENVY",
      "body": "I am very pleased with this purchase. This computer is extremely efficient and easy to use.",
      "rating": "5"
    },
    {
      "title": "HP computer",
      "body": "Very good computer, lots of memory and speed. We’ve been due for a upgrade and this is I’ll take care of our computer needs for a long time to come.",
      "rating": "5"
    },
    {
      "title": "Love my HP envy",
      "body": "This is my second 17-in  HP envy. \nWhen my first one died I was heartbroken. Especially when I found how hard it was to replace it. Thanks to Best buy. I now have another one. And I absolutely love it.",
      "rating": "5"
    },
    {
      "title": "Hp laptop computer",
      "body": "I am very pleased with our new computer. Service was great at Best Buy in Bloomington IL\n\nCan’t say enough nice things about Christian who helped us understand what to look for to buy.",
      "rating": "5"
    },
    {
      "title": "Best laptop ever purchased",
      "body": "Super fast, screen size is perfect, the on /off button and the volume buttons are placed just right.",
      "rating": "5"
    },
    {
      "title": "Good buy for school.",
      "body": "It is a very good computer for school. and for school protectors.",
      "rating": "5"
    },
    {
      "title": "Happy Customer",
      "body": "It was a gift for my wife and she loves it. This is the 2nd exact cpu",
      "rating": "5"
    },
    {
      "title": "Great experience!",
      "body": "The experience was great! The sales rep was very helpful and knowledgeable. He helped me find something that fit my budget and my situation perfectly . I was looking for something that would work homeschooling my kids at home and what he suggested was perfect .",
      "rating": "5"
    },
    {
      "title": "Awesome Laptop",
      "body": "New HP 17.3 screen size . Fast and just a big step up form my prior HP 14 in screen siize .",
      "rating": "5"
    },
    {
      "title": "HP-Envy 17.3\" is a great buy",
      "body": "HP always makes a great computer and the HP Envy does not disappoint. Superb speed and plenty of memory for my needs. I will always buy an HP product.",
      "rating": "5"
    },
    {
      "title": "Hp laptop",
      "body": "really good experience buy it at the store, even was on Thanksgiving busy.",
      "rating": "5"
    },
    {
      "title": "Fast Laptop with great sound and video!!!",
      "body": "Very impressed with this laptop with the newer generation Ultra 7 processor.  Upload and download speeds have doubled from my other laptop.  Bought this laptop because it had high customer feedback, and I had my I3 core for 10years from HP.",
      "rating": "5"
    },
    {
      "title": "What Santa brought!",
      "body": "Outstanding Xmas gift.  Replaced ancient Dell laptop and is a truly amazing PC.",
      "rating": "5"
    },
    {
      "title": "great computer",
      "body": "great computer easy to use like how it is laid out and how it works",
      "rating": "5"
    },
    {
      "title": "Great Purchase",
      "body": "I really like this one...I have had HP Envy before and I like this one, as well.\nI had to have one with the backlit keyboard, which is my favorite feature...The display and sound are excellent.\nThank You Best Buy!",
      "rating": "5"
    },
    {
      "title": "HP laptop 17.3 review",
      "body": "Slim, has numeric keyboard (something I personally needed), aesthetic speaks for itself! Overall, Great purchase!",
      "rating": "5"
    },
    {
      "title": "Iron5",
      "body": "Matt was very helpful answering my questions. Thank You.",
      "rating": "5"
    },
    {
      "title": "New Laptop",
      "body": "The best type of work from home laptop I could ask for. Has enough storage so I can work for home and enough storage to allow me to do content creation. The screen resolution and quality is also top notch. Highly recommend to anyone!",
      "rating": "5"
    },
    {
      "title": "BUY THIS LAPTOP",
      "body": "Such a beautiful shiek beautiful light weight computer works beautifully BUY you will not regret",
      "rating": "5"
    },
    {
      "title": "Satisfied laptoper",
      "body": "The HP-Envy 17.3\" Touch-Screen Laptop is spectacular.  I must say only after the Best Buy Geek Squad was able to get it up and operational because of the pathetic Microsoft 11.  That I DO NOT LIKE.  Thanks to the Geek Squad I can use the laptop as intended.  I give this a strong recommendation along with Best Buy.  If you chose this it will be your Best Buy!",
      "rating": "5"
    },
    {
      "title": "Great Laptop",
      "body": "Great size 17\" laptop.  Had everything I needed for home",
      "rating": "5"
    },
    {
      "title": "Great",
      "body": "I got this laptop late last August and wanted to use it for a long while before writing a review just in case something didn't hold up. Luckily there was nothing to worry about! The screen quality is great, it's fast, has lots of storage, has never crashed, and is easy to customise. I can't speak for how modern gaming goes on this laptop, but it handles Blender and some other 3D modeling programs well. I mainly use it for the aforementioned 3D modeling, as well as digital art, document creation. and general entertainment such as streaming, browsing, photo and video editing, and listening to music; it has excelled in delivering a fantastic experience in all those areas. Many people may not like that this laptop is a little on the heavier side, but personally I like it because it doesn't feel so fragile like a lot of other laptops do these days. It's definitely sturdy. I don't use any of the AI functions, and they're easy enough to turn off. It doesn't have a disc reader, but is compatible with aftermarket disc readers and has plenty of ports for other accessories.",
      "rating": "5"
    },
    {
      "title": "Awesone laptop and nice service",
      "body": "Awesome computer.  Everything was expected as advertised.  Store had the laptop ready to pick up super fast too",
      "rating": "5"
    },
    {
      "title": "Good basic laptop",
      "body": "Good features at a reasonable price.  Needed a 17” screen and this model fit my needs.",
      "rating": "5"
    },
    {
      "title": "new runner",
      "body": "nice machine.  still learning how to run it. hope it last as long as previous HP I had (16 years)",
      "rating": "5"
    },
    {
      "title": "MSFS",
      "body": "I purchased at my Best Buy store based on employee recommendation. I was told this laptop would work great with my Microsoft flight simulator game. However I receive message upon starting game laptop does not meet requirements. I  can override and still use MSFS. It is taking me a while getting used to 11 program.",
      "rating": "4"
    },
    {
      "title": "Laptop Review",
      "body": "The HP - Envy 17.3\" Full HD Touch-Screen Laptop - Intel Core Ultra 7 - 16GB Memory - 1TB SSD - Glacier Silver is a great laptop! Absolutely love the size and touch screen features.",
      "rating": "5"
    },
    {
      "title": "HP Envy 17",
      "body": "This is my second HP Envy 17.   I got my first one in 2012 and had 13 years of great use from it.   It was and is a great desktop replacement.",
      "rating": "5"
    },
    {
      "title": "Nice laptop",
      "body": "So far so good. I am still transferring things from my old computer. One thing to note is that the keyboard is smaller and the mouse pad area is larger than previous models. It doesn't bother me too much, but I don't use the mouse pad on the computer at all, so I wish it was smaller and the keyboard larger. It was a great price at $999, so I am very happy with that. I will be purchasing the warranty through HP or Best Buy.",
      "rating": "4"
    },
    {
      "title": "ALT",
      "body": "So far so good. It has everything i need on it.  \nSpeed is great stilirage is awesome.",
      "rating": "5"
    },
    {
      "title": "Hp Envy",
      "body": "Great item and great store help Associate who assist me was very knowledgeable and got me into a product that fit my needs. Thank you very much",
      "rating": "5"
    },
    {
      "title": "Excellent Laptop.",
      "body": "Excellent laptop. Easy to use. No problems. Highly recommend.",
      "rating": "5"
    },
    {
      "title": "Love laptop",
      "body": "Excellent product. Great speed. Surpasses all my needs.",
      "rating": "5"
    },
    {
      "title": "Very satisfied",
      "body": "Great working laptop. No issues. Holds battery life well. Everything I was looking for.",
      "rating": "5"
    },
    {
      "title": "HP Computer",
      "body": "Purchase of my new HP computer is sleek and very nice. I love it.",
      "rating": "5"
    },
    {
      "title": "new laptop",
      "body": "excellent product, ease of setup. Geek squad was not able to save some of my files from old all in one but will just start over.",
      "rating": "5"
    },
    {
      "title": "Satisfied & Pleased.",
      "body": "Because that's how I feel. There are a lot of different things that I can do with this new computer that I could not do with my old computer. It is faster downloading and installing updates.",
      "rating": "5"
    },
    {
      "title": "Laptop",
      "body": "Love my new touchscreen Samsung laptop definitely a must have.",
      "rating": "5"
    },
    {
      "title": "Owner",
      "body": "We have purchased this laptop before and it has worked just fine, we happy with this model.",
      "rating": "5"
    },
    {
      "title": "great for business",
      "body": "great computer. fast and integrates with my desktop. great for business on the go.",
      "rating": "5"
    },
    {
      "title": "HP Approval in Dallas",
      "body": "I literally walked into Best Buy to return something walked by this HP Laptop on display and something caught my eye about it and the next thing you know…I bought it!!! Absolutely love this product!! It’s hands down the best laptop yet!!",
      "rating": "5"
    },
    {
      "title": "HP Laptop",
      "body": "Laptop is fast bright colorful windows 11 great Laptop",
      "rating": "5"
    },
    {
      "title": "Third HP",
      "body": "I've had several HPs.  So far, this one is exceeding expectations.",
      "rating": "5"
    },
    {
      "title": "hp 17 envy performance",
      "body": "Little slower than I expected but overall I am very pleased with its display and performance",
      "rating": "5"
    },
    {
      "title": "HP Envy",
      "body": "I like this and so much better with everything. I needed a change.",
      "rating": "5"
    },
    {
      "title": "Love the new computer",
      "body": "When I was notified that my new computer was ready to pick up It was not ready with what I wanted to have transferred from my old computer to the new. Noah from the Geek Squad spent two hours to get what I wanted and did a great job.",
      "rating": "4"
    },
    {
      "title": "Perfect Laptop",
      "body": "Love it! Excellent for my home business. Very fast.",
      "rating": "5"
    },
    {
      "title": "HP Laptop",
      "body": "Great product! Love the big screen making multitasking very easy!",
      "rating": "5"
    },
    {
      "title": "Great Purchase",
      "body": "Long Battery Life and Great at Multi Tasking. It is being used for personal and professional purposes. We have had no issues with it.",
      "rating": "5"
    },
    {
      "title": "Great purchase",
      "body": "computer is everything as advertised.  It is fast and easy to manipulate.  The Geek support was fantastic.  They transferred my data from my old computer without an issue.",
      "rating": "5"
    },
    {
      "title": "Great tool",
      "body": "Has everything I need and does everything its supposed to very quickly",
      "rating": "5"
    },
    {
      "title": "Great laptop.",
      "body": "It’s a great laptop. Works well with no issues. The screen is huge. It the perfect laptop for me to finish my online school work.",
      "rating": "5"
    },
    {
      "title": "Problems with MY computer",
      "body": "I had only had this computer for 2-3 weeks and it started freezing up. I called Geek Squad for help. They did some updates I missed and I thought it was okay, but about 4 days later it froze again. Seems to be happening at least once a week, so I just deal with it for now.",
      "rating": "4"
    },
    {
      "title": "Carol Woodfall",
      "body": "Great assistance with new computer - Geek Squad did a great job",
      "rating": "5"
    },
    {
      "title": "Laptop",
      "body": "Great laptop. The processor is fast and the screen is very clear.",
      "rating": "5"
    },
    {
      "title": "envy",
      "body": "It is a very nice lap top and very easy to get set up by the geek squad.  the keyboard and touchscreen are very nice and has a very nice screen.  I would highly recommend this product and was very happy with the whole process.",
      "rating": "5"
    },
    {
      "title": "HP laptop envy",
      "body": "I Love it, great computer. Great help to accomplish my tasks.",
      "rating": "5"
    },
    {
      "title": "HP LAPTOP COMPUTER",
      "body": "My husband got this laptop & he loves it!  It has a larger screen & the number pad which is hard to find. Screen looks great!",
      "rating": "5"
    },
    {
      "title": "Powerful equipment.",
      "body": "Excellent notebook. Very fast and great value for money. For those who want powerful equipment.",
      "rating": "5"
    },
    {
      "title": "HP Envy",
      "body": "4/26/24 This is our 2nd HP Envy Computer. The first one we bought at Best Buy in April 2014 and it's still going. Looking forward with this new one.",
      "rating": "5"
    },
    {
      "title": "Can't go wrong with this laptop",
      "body": "Excellent product appears solid in design and functionality",
      "rating": "5"
    },
    {
      "title": "Great machine",
      "body": "So far it has been great! There was an adjustment period because I usually use Dell, but loving it so far!",
      "rating": "5"
    },
    {
      "title": "Laptop",
      "body": "Our new laptop is an excellent purchase. It provides all we need and the cost made it the best possible choice for our family.",
      "rating": "5"
    },
    {
      "title": "New HP laptop",
      "body": "This laptop is a msjir improvement over my 5 year old laptop iI had previously, the new one boots up very fast and no matter what application you are running there is almost no delay",
      "rating": "5"
    },
    {
      "title": "HP Envy delivers",
      "body": "Crystal clear screen and a keypad which is an important item to my work efforts.\nEnjoy the \"face id\" unlock feature. The expansive screen makes the work easier on my eyes.",
      "rating": "5"
    },
    {
      "title": "Hp",
      "body": "simply the best I have ever acquired very good good",
      "rating": "5"
    },
    {
      "title": "New HP Envy Laptop",
      "body": "So far had it 10 days and I'm thrilled with it. Fast, easy to use, nice screen. It had been 13 years since my last HP laptop so this is great",
      "rating": "5"
    },
    {
      "title": "Emergency HP Laptop purchase",
      "body": "I am pleased with my purchase. I am still getting used to it because everything in this Operating System has changed. The Geek Squad helped me out tremendously. But I will think about buying an HP again.",
      "rating": "4"
    },
    {
      "title": "10/10 recommend",
      "body": "I traded in my old laptop for this one best thing I could have done. I chatted online with one of the helpful tech who pointed me in the right direction! This laptop has all the ports I needed for photo editing. On top of getting me through school and scoring a killer job. Get this laptop it will help you regardless what you have going on!",
      "rating": "5"
    },
    {
      "title": "HV Envy",
      "body": "It does what I need it to do. The screen is very clear.",
      "rating": "5"
    },
    {
      "title": "Laptop",
      "body": "It is very fast, love the screen size. I like how it lights",
      "rating": "5"
    },
    {
      "title": "Hp laptop",
      "body": "Very nice computer very pleased. Very fast, easy set up. Exactly what I was expecting.",
      "rating": "5"
    },
    {
      "title": "Great Product",
      "body": "Great Product. No Complaints. Came with everything.",
      "rating": "5"
    },
    {
      "title": "Roosevelt",
      "body": "The HP - Envy 17.3\" Full HD Touch-Screen Laptop is an excellent laptop and its price/ cost value great! It's worth every penny!",
      "rating": "5"
    },
    {
      "title": "Nice",
      "body": "Nice laptop, fast and smart and good value. I would recommend this laptop to anyone.",
      "rating": "5"
    },
    {
      "title": "HP Envy - Great Laptop",
      "body": "Great laptop. Easy to use and I love the 17\" screen. The keyboard is big enough too so its easy to type. I love it",
      "rating": "5"
    },
    {
      "title": "Retired",
      "body": "I was in need of upgrade from my Sony Viao and needed to also upgrade my microsoft office. I am happy with my choice",
      "rating": "5"
    },
    {
      "title": "Great laptop for the price.",
      "body": "Since I wasn't used to Windows 11, I had some learning to do to use this laptop but it works fine.  The screen is brilliant and is much faster than my old laptop.  \n\nMy only negative is, I wish it had a non-glare screen.",
      "rating": "4"
    },
    {
      "title": "Commander",
      "body": "Very fast, up to date that had all the program I need.",
      "rating": "5"
    },
    {
      "title": "Review",
      "body": "Dawson great service. Last time he was able to help me choose my computer. I will recommend to go to him.",
      "rating": "5"
    },
    {
      "title": "HP Envy Laptop",
      "body": "This computer is everything needed!  The staff and Geek Squad were wonderful in transferring all data!",
      "rating": "5"
    },
    {
      "title": "My New Computer",
      "body": "This Computer is perfect for my home personal computer needs. Programs are easy to navigate. Great visuals.",
      "rating": "5"
    },
    {
      "title": "My new HP Envy Laptop",
      "body": "I love my new HP ENVY laptop. I haven't had any issues. It is fast. The keyboard is very comfortable.",
      "rating": "5"
    },
    {
      "title": "Perfect for business.",
      "body": "So far this laptop has been perfect for business. It's fast and the screen quality and sound is great. It's perfect for everything I need it to do. Highly recommend.",
      "rating": "5"
    },
    {
      "title": "Nice computer",
      "body": "Easy to set up!  I'm not a gamer so don't know how it would be for that,  but working great for everything I have asked,  streaming,  work,  etc.",
      "rating": "5"
    },
    {
      "title": "New computer",
      "body": "Our service was great. Getting the computer set up and information transferred was painless and fast. Computer is working well",
      "rating": "5"
    },
    {
      "title": "HP computer",
      "body": "Great computer.  The large screen makes it great to work on projects.",
      "rating": "5"
    },
    {
      "title": "awesome",
      "body": "just really loving this laptop, really great keyboard and touch to it, really recommended",
      "rating": "5"
    },
    {
      "title": "Very hepful",
      "body": "Great experience, the customer service at the geek squad was very helpful and gave get insight on the product",
      "rating": "5"
    },
    {
      "title": "Great price",
      "body": "Excellent service great price. I checked few stores , Best Buy beat the price by a lot.",
      "rating": "5"
    },
    {
      "title": "Nice Product",
      "body": "Nice product but returned. Changed my mind. Nothing wrong with the product I just changed my mind.",
      "rating": "5"
    },
    {
      "title": "LOOKING FOR A LAPTOP UPGRADE...HERE IT IS!!!",
      "body": "LOVE THE 17 INCH SCREEN. This is the first touch screen laptop for me and it likewise is a wonderful upgrade.",
      "rating": "5"
    },
    {
      "title": "Great laptop",
      "body": "Great laptop to replace a similar older HP.  Start up was easy and downloading all programs fast.",
      "rating": "5"
    },
    {
      "title": "John McNamara",
      "body": "So far, I am happy with the new laptop.  The switch from Windows 10 to 11 was painless.",
      "rating": "5"
    },
    {
      "title": "HP- Envy 17.3\"",
      "body": "I like the size and over all use of this laptop, I actually have 2 of them, do wish the Battery life was longer",
      "rating": "4"
    },
    {
      "title": "HP Envy 17.3\" review",
      "body": "Very pleased with my new HP laptop. Especially the 17.3\" screen.",
      "rating": "5"
    },
    {
      "title": "Great for the price",
      "body": "No complaints on this laptop.  Does everything I need it to do and more.  No issues or errors.",
      "rating": "5"
    },
    {
      "title": "Multifaceted dream laptop",
      "body": "It is modern, with a simplified design especially the start menu position. I can easily multitask with all the integrated apps. WORTH IT FOR ITS PRICE.",
      "rating": "5"
    },
    {
      "title": "My PC",
      "body": "I love my HP.  I have had several and this purchase was perfect for my needs.",
      "rating": "5"
    },
    {
      "title": "Great Product",
      "body": "The large 17 inch monitor is the best feature of this laptop.  It makes doing detailed work much more productive. I am glad I replaced my old 15 inch laptop.",
      "rating": "5"
    },
    {
      "title": "Hp laptop computer",
      "body": "My hp laptop computer has proven to be a wise investment. It is very user friendly and i have enjoyed using it for work purposes as well as personal use.",
      "rating": "5"
    },
    {
      "title": "Very reliable - worth the investment",
      "body": "Great laptop.  Have owned HPs for the last few purchases and never an issue with any of them.",
      "rating": "5"
    },
    {
      "title": "HP review",
      "body": "Works as expected. Easy set up. Still learning some of the features. Pricing made this a good value.",
      "rating": "5"
    },
    {
      "title": "BIG WINNER!",
      "body": "This laptop is a winner! Lots of great features and a HUGE screen, this is perfect for my college student.",
      "rating": "5"
    },
    {
      "title": "Great laptop",
      "body": "I have always purchased an HP.  They are so reliable.",
      "rating": "5"
    },
    {
      "title": "Excellent purchase",
      "body": "Excellent Computer very smart very quick\nThe customer service at Best Buy gentleman was great and very informative and definitely helped to pick a wonderful computer. Thank you so much.",
      "rating": "5"
    },
    {
      "title": "HP makes good laptops",
      "body": "Great screen, great sound, excellent build quality.",
      "rating": "5"
    },
    {
      "title": "HP",
      "body": "Nice computer. Easy to use; bought it at full and with Best Buy annual subscription I got it for $370 less a couple weeks later.",
      "rating": "5"
    },
    {
      "title": "Laptop upgrade",
      "body": "Excellent laptop, great installation by the Geek's",
      "rating": "5"
    },
    {
      "title": "Great quality",
      "body": "Great screen and display! The mouse pad is responsive and comfortable. For a school computer it has helped with multi tasking and meetings.",
      "rating": "5"
    },
    {
      "title": "Great Laptop!",
      "body": "Love the laptop! It works great & so nice! It’s exactly how & what I wanted & needed! It was easy to start up and set up as well. Not heavy and easy to carry in a case.",
      "rating": "5"
    },
    {
      "title": "Happy with my purchase- Fast navigation",
      "body": "I’ve been using my laptop to create PowerPoints and uploading them to YouTube. The navigation is fast and very pleased with this laptop.",
      "rating": "5"
    },
    {
      "title": "New laptop purchase",
      "body": "I love this laptop!  The 1tb space & touch screen is very helpful with what i do.  I would absolutely refer this to anyone that wants a hp laptop.",
      "rating": "5"
    },
    {
      "title": "Great hp product.",
      "body": "Great product,great price great looks,easy to\nuse,lots of storage,excellent speed and great warranty from best buy.",
      "rating": "5"
    },
    {
      "title": "Laptop",
      "body": "Recently bought this and it's everything I need. I would highly recommend this Laptop.",
      "rating": "5"
    },
    {
      "title": "Great computer",
      "body": "This computer is super fast and easy to use. The screen is a very generous size. It has a very large size memory.",
      "rating": "5"
    },
    {
      "title": "Great Laptop for Older People",
      "body": "Love this laptop. It has a big screen; easy to see",
      "rating": "5"
    },
    {
      "title": "happy",
      "body": "Im very happy with it everything is up to dayt can do all my banking now",
      "rating": "5"
    },
    {
      "title": "Laptop",
      "body": "Works good ,nice touch screen .    Just big enough to work with , but small enough to fit on end table while using it.",
      "rating": "5"
    },
    {
      "title": "Simple to Perfect",
      "body": "I was looking for something simple and I ended up getting better than simple - for me this is perfect - I could not ask for more",
      "rating": "5"
    },
    {
      "title": "HP Laptop",
      "body": "It's an awesome computer for what we need. Great value for the price.",
      "rating": "5"
    },
    {
      "title": "My Laptop is Perfection",
      "body": "My new laptop is perfect. It works perfectly. It’s big enough and stores enough data.",
      "rating": "5"
    },
    {
      "title": "great",
      "body": "the wife loves it. it's perfect for her. easy to use.",
      "rating": "5"
    },
    {
      "title": "Envy",
      "body": "Had an envy and wanted the same kind but larger screen. Enjoying the larger screen.",
      "rating": "5"
    },
    {
      "title": "Laptop purchase & data transfer: difficult",
      "body": "After purchasing a new HP laptop, it took two tries to transfer and copy data from the hard drive of my old computer to this new one. Yesterday, my land-line telephone rang, but I didn't get to it in time to answer. I \"star-69ed\" to find out who had called and discovered it was The Geek Squad. I called back within a minute of having not been able to answer and finding out it was The Geek Squad to spending nearly 15 minutes on the phone with a virtual operator, then someone in a call center trying to verify information that I was indeed a customer. I provided all sorts of information, including my name, phone number, work order number, passcode, etc. and still couldn't get through to The Geek Squad office in my town. Therefore, I hung up and tried again a few minutes later. After a different person answered, she did take long to verify and transfer my call to the Greeley desk where someone actually responded to tell me my laptop was ready to be picked up for a second time. After driving back to the store again, I wanted to verify the data transfer was complete and accurate. Because my old computer had a hard drive that was beginning to fail, Jack told me my data had been transferred. He tried to show me but the process was taking a long time, and before the procedure had finished he compared on-screen the data in my new laptop to the data on my hard drive -- even though he couldn't access the old hard drive. So I took my new unit home and activated it, and slowly I'm learning how to use this new laptop. Through trial and error, I figured out how to activate my mouse and keyboard, finding out I must keep a USB port continually occupied by a connector for both a cordless mouse and cordless keyboard. I've also had trouble trying to access old Microsoft Word data and create new files, even though part of the price was an Office package that was supposed to make my efforts go smoothly. They have been anything but that. I'm hoping my experiences going forward are more rewarding because I'm questioning spending more than $1,300 on a device that so far has aggravated and frustrated me. My wife and I made a big decision to go with Best Buy and The Geek Squad based on recommendations from people we know. In the next week, I'm hoping to have a better grasp of the situation, or I'll find out spending this much money and effort was indeed a waste.",
      "rating": "3"
    },
    {
      "title": "HP computer",
      "body": "Love love this computer, I 'm been waiting to purchase a new computer and so happy I chose this HP.",
      "rating": "5"
    },
    {
      "title": "Would buy it again",
      "body": "Speedy, beautiful large screen, easy to use for computer novice. Advice and service at BB were perfect.",
      "rating": "5"
    },
    {
      "title": "Great Lap Top",
      "body": "Has too many features for my ancient Low Tech comprehension. Love the 17\" screen for watching movies. I think I made the right choice.",
      "rating": "5"
    },
    {
      "title": "Excellent device",
      "body": "Love the touch screen feature, great for work and business plus school experience",
      "rating": "5"
    },
    {
      "title": "Great lqptop",
      "body": "I'm very happy with the purchase I've been using this laptop as my workhorse in the office. It works great I've had it for about a year",
      "rating": "5"
    },
    {
      "title": "Nice to be so happy with the whole package.",
      "body": "This laptop was all that I expected for easy access to Internet. I use word, PDF and excel a lot and although it had changes I am learning and there is very good help with Microsoft apps",
      "rating": "5"
    },
    {
      "title": "Best computer",
      "body": "Love this laptop. I didn't need a gaming laptop but i wanted the next best thing. This was it. I love my HP computer.",
      "rating": "5"
    },
    {
      "title": "Great Laptop",
      "body": "I do taxes and this computer made it a great work experience.",
      "rating": "5"
    },
    {
      "title": "New Laptop",
      "body": "love it... has everything I need and it's windows 11 but I wish it had a lighted keyboard",
      "rating": "5"
    },
    {
      "title": "HP-envy 17.3",
      "body": "Totally enjoying this product! It has a clear image, was easy to set up and sync with my phone and all the pictures/apps/etc",
      "rating": "5"
    },
    {
      "title": "LEC",
      "body": "Employees were extremely helpful and the Geek Squad agent was professional and knowledgeable.",
      "rating": "5"
    },
    {
      "title": "AWESOME COMPUTER",
      "body": "THIS ENVY COMPUTER IS JUST WHAT I WAS EXPECTING. IT REPLACE MY OLD HP PAVILION THAT I HAD SINCE 2007. IT FINALLY GAVE OUT.HP COMPUTERS ARE VERY RELIABLE.",
      "rating": "5"
    },
    {
      "title": "excellent",
      "body": "I love it, very fast and the perfect size for me and my proyect",
      "rating": "5"
    },
    {
      "title": "New Computer",
      "body": "Computer Great - I love the nice large screen. - Only have to get a new computer bag, won't fit in my old one.",
      "rating": "5"
    },
    {
      "title": "New HP Laptop",
      "body": "Love this computer! Its great for my digital marketing career!",
      "rating": "5"
    },
    {
      "title": "One feature short of perfect.",
      "body": "Very good product.  It is stiff to open and both hands are required.  (I miss the one-hand operation of my old Samsung.)  Otherwise, it is fast, bright and comfortable to use.",
      "rating": "4"
    },
    {
      "title": "Laptop",
      "body": "I love my laptop. The best quality. The best computer",
      "rating": "5"
    },
    {
      "title": "Hp Envy Lap Top",
      "body": "Fabulous computer at a reasonable price. No complaints at all.",
      "rating": "5"
    },
    {
      "title": "New computer and moniter",
      "body": "Great experience. Purchasing was awesome. Live my new computer",
      "rating": "5"
    },
    {
      "title": "Great Value",
      "body": "Absolutely meets the needs for which I purchased it.",
      "rating": "5"
    },
    {
      "title": "New HP laptop computer.",
      "body": "I like the wider keyboard base of the HP. I managed the setup process easily. It's a good product.\nToo much buffering on videos.\nWas disappointed when it didn't connect to auxiliary speakers.",
      "rating": "4"
    },
    {
      "title": "Recommended",
      "body": "The screen size is just what I was looking for, and I was excited to have the numeric keypad on the keyboard.",
      "rating": "5"
    },
    {
      "title": "Like it!",
      "body": "I haven't used this laptop much since I bought it, but it has a larger screen and is thinner than my previous one. I'm looking forward to spending more time getting familiar with it's features.",
      "rating": "4"
    },
    {
      "title": "Labtop hp",
      "body": "Great workswell.i love it\nHp is top speed.clear and lots of storage",
      "rating": "5"
    },
    {
      "title": "HP Envy laptop",
      "body": "Large screen, latest version Microsoft windows in system.",
      "rating": "5"
    },
    {
      "title": "Geek squad",
      "body": "1/7/25. Went to pick up my new laptop and Istiak was the squadman that helped me. He was very helpful and showed me the features I needed to know about. Great guy and friendly.. Thank you.",
      "rating": "5"
    },
    {
      "title": "Great Service and Product",
      "body": "Excellent product for my son, who has taken it to college as a Freshman. The quality is far more advanced than my ENVY 3. The assistance in selecting the product was also great as I was able to get the necessary assistance and insight on the components of the laptop.",
      "rating": "5"
    },
    {
      "title": "New Computer!!",
      "body": "HP from Bestbuy. Is always the best don’t buy elsewhere.",
      "rating": "5"
    },
    {
      "title": "Computer rating",
      "body": "I really enjoy this computer. It works well for the necessary work I do.",
      "rating": "4"
    },
    {
      "title": "I really love it",
      "body": "This laptop is perfect for me. I study online for that reason I need a good device. It’s amazing!!!!",
      "rating": "5"
    },
    {
      "title": "Perfection",
      "body": "HP products always live up to their standards.  Love this monitor and the color!",
      "rating": "5"
    },
    {
      "title": "Overall Good Purchase",
      "body": "For the most part, I am fully satisfied with the purchase.  My only issue is that the built in camera does not turn on every time I boot the computer.",
      "rating": "4"
    },
    {
      "title": "Excellent Product!!",
      "body": "Excellent Product.  The monitor is clear and vivid, and the size is adaptable to my two monitors and printer.",
      "rating": "5"
    },
    {
      "title": "Excellent product",
      "body": "Has all the features i wanted except for Windows 11 Pro. I can add this later. This computer is super-fast.",
      "rating": "5"
    },
    {
      "title": "love my computer",
      "body": "Love my computer and the ease for setup.  I am enjoying using my computer.",
      "rating": "5"
    },
    {
      "title": "HP Envy 17.3",
      "body": "Hp has always been the best! This Envy laptop is a replacement for my HP laptop that I used for 12 years!",
      "rating": "5"
    },
    {
      "title": "Grear improvements!",
      "body": "I love that this laptop is back lit! Keypad is easier to use. I have several HP laptops and this is the best one.",
      "rating": "5"
    },
    {
      "title": "Best Laptop Owned",
      "body": "Love this laptop. How could you go wrong with ultra 7, 16 gb ram, 17\" touch screen all for under a grand.",
      "rating": "5"
    },
    {
      "title": "Perfect",
      "body": "I love it. No comments as is what i needed.  perfect",
      "rating": "5"
    },
    {
      "title": "Hp computer",
      "body": "Nice memory and storage space. Display is excellent, not oled but still very good.",
      "rating": "5"
    },
    {
      "title": "Great laptop!",
      "body": "I bought this for my daughter after hers crashed, and she loves it. One of her favorite aspects is the dimmable keyboard light.",
      "rating": "5"
    },
    {
      "title": "Works amazing",
      "body": "Love my new laptop. Perfect for my small business. Its super fast and easy to understand the functions.",
      "rating": "5"
    },
    {
      "title": "Great purchase",
      "body": "Love this laptop. Very fast processing. Highly recommend.",
      "rating": "5"
    },
    {
      "title": "ENVY laptop",
      "body": "Love it, super fast and co pilot is real good ans easy..would recommend..",
      "rating": "5"
    },
    {
      "title": "HP Envy 17.3",
      "body": "I like my HP Envy 17.3. I love the features and the speed. It is exactly what I needed for my home office.",
      "rating": "5"
    },
    {
      "title": "Amazing!",
      "body": "Amazing! Display is great, love the 10 key. Switched from a Mac to this and couldn’t be happier!",
      "rating": "5"
    },
    {
      "title": "ExcellentGraphics",
      "body": "Very happy with my new computer. The sales person was excellent, and Geek Squad transferred all my data.",
      "rating": "5"
    },
    {
      "title": "HP Laptop",
      "body": "Will continue buying HP PRODUCTS vs other name brands.",
      "rating": "5"
    },
    {
      "title": "MAX",
      "body": "This laptop is one of the best in the market with large screen which makes it easier to use.",
      "rating": "5"
    },
    {
      "title": "Thank you",
      "body": "I believe in the products that Best Buy has for sale",
      "rating": "5"
    },
    {
      "title": "Hp",
      "body": "Pickup to.e was perfect. Computer was easy to setup and works great.",
      "rating": "5"
    },
    {
      "title": "I recommend to go for this laptop",
      "body": "Envy is for people with high class, loved the design, the feel and overall the 17.3 inch display.",
      "rating": "5"
    },
    {
      "title": "New Laptop",
      "body": "Works really good, very fast and reliable.  Had a old laptop and cannot believe the difference.",
      "rating": "5"
    },
    {
      "title": "Great for home or office",
      "body": "I love my new laptop!  The screen is larger with vibrant color and print.  Easier to navigate.",
      "rating": "5"
    },
    {
      "title": "Excellent laptop.",
      "body": "Love my new laptop, and the price was right. Nice large screen. Plenty of memory. Great value and quality. Would buy again.",
      "rating": "4"
    },
    {
      "title": "Leslie I",
      "body": "The young gentleman that helped me looks like he was just learning his job. He was very nervous, but he did a very awesome job. I would be proud of him to have him as an employee. I asked a few questions that he struggled with a little bit, but he was able to get the correct information that I neededand would definitely come back and And I would definitely come back and ask for him. Also, the computer is awesome. Yes, everything I need.",
      "rating": "5"
    },
    {
      "title": "HP envy 17.3inch laptop",
      "body": "Just purchased HP envy 17.3 inch laptop.\nIt’s sleek n very comfortable. Perfect for working from home and also for students.It runs great without any glitches.",
      "rating": "4"
    },
    {
      "title": "Good functionality.",
      "body": "Overall it is very functional. The mouse is a little too sensative. Battery wonds down quicker than I would have expected.",
      "rating": "4"
    },
    {
      "title": "love it",
      "body": "The screen size is perfect for me with having to split the screen for assignments for school.",
      "rating": "5"
    },
    {
      "title": "Hp Envy Review",
      "body": "the best laptop, works great and fast, hp is 100% perfect for work and home",
      "rating": "5"
    },
    {
      "title": "HORRIBLE BEST BUY CUSTOMER SERVICE!",
      "body": "I bought this to replace an older Envy laptop. Just when I finished all of the setup and transferred my apps and files, the laptop just died. It shutdown and wouldn't power up again. I called HP to do some troubleshooting but none of it worked. They suggested I send it to them for repair/replacement. That could takes several weeks! I called BB to do an exchange because this all happened less than 2 weeks after purchase. According to the website, there weren't any available at the store closest to me. Well, I wasn't about to go driving across town to the next BB only to find out that they didn't have any. But, BB has made a change so that you cannot call the store directly to talk to a human who actually works there. Instead, no matter what store you call, you go right to a call center. Unfortunately, no one at the call center can understand or perform simple tasks. I just wanted to know if the BB store had the stock to do an even exchange. I spent hours dealing with these people via phone and chat. During that time I was transferred 6 times during the same conversation, received different answers to the same questions and my very simple problem was not solved. I returned the laptop to the closest store for a refund. Even the person at the BB customer svc desk said the call center is awful. Way to go BB. Because of your stupid policy to send all calls to a bunch of incompetent, rude idiots you lost a customer. I will not be purchasing anything from you again.  And I know one of them is going to respond to this review with a fake apology and claim to do better next time.  There won't be a next time! I purchased the exact laptop directly from HP for $100 less than BB's sale price.",
      "rating": "1"
    },
    {
      "title": "laptop 2025",
      "body": "excellent lap-top, meets all my requirements and expectatives",
      "rating": "5"
    },
    {
      "title": "Amazing Computer",
      "body": "Amazing Laptop, Works Flawlessly, We Did Not Realize It Was Touch Screen Until We Got It Home And Set It Up",
      "rating": "5"
    },
    {
      "title": "hp envy 17.3 great",
      "body": "great laptop, I use for basic things, larger screen is nice",
      "rating": "5"
    },
    {
      "title": "Great monitor.",
      "body": "Love it! So happy I made the purchase. The touch screen is so convenient.",
      "rating": "5"
    },
    {
      "title": "HP Envy",
      "body": "I've like purchasing what I need from Best Buy. It was a seamless purchase as it has always been in the past. I purchased online and drove to the store. It was waiting for me.",
      "rating": "5"
    },
    {
      "title": "None",
      "body": "Very easy to use and it is cost friendly.. Love the touch screen..",
      "rating": "5"
    },
    {
      "title": "Two dealbreakers for me",
      "body": "I have two issues with this model that would be acceptable if it were a cheaper laptop, but for this asking price these things should be better and I found them to be dealbreakers.\n\n1. The screen is unimpressive. Text is a bit blurry, especially when using \"dark mode\" which is what I use almost exclusively. There's a noticeable lack of contrast and a general haziness that I was unable to adjust out in display settings. It is noticeable if you set this laptop next to a different brand laptop of similar tier.\n\n2. The keyboard to me feels kind of cheap and rubbery. The keys are too soft and require to be pressed down further than most modern \"chicklet\" keyboards. It also gives the laptop a slightly outdated look.",
      "rating": "3"
    },
    {
      "title": "HP - 17.3",
      "body": "This is one of the best laptops that I have own.  Thanks.",
      "rating": "5"
    },
    {
      "title": "17.3 Envy",
      "body": "Delivered as promised, open box store floor model.",
      "rating": "5"
    },
    {
      "title": "hp laptop",
      "body": "just what I expected. A great upgrade from what I had",
      "rating": "5"
    },
    {
      "title": "Very Happy",
      "body": "I am very happy with this computer. It does everything I need it to do and more.",
      "rating": "5"
    },
    {
      "title": "HP Laptop",
      "body": "I love my new laptop I replaced a 10 year old HP and i love this one even more!",
      "rating": "5"
    },
    {
      "title": "Live this laptop!",
      "body": "I love it! Easy to set up and easy to use. It works for everything I need!",
      "rating": "5"
    },
    {
      "title": "Work Friendly",
      "body": "Sleek design, As an accountant mynself, i hope it holds up to my everyday work requirements",
      "rating": "5"
    },
    {
      "title": "Nice laptop!",
      "body": "This laptop is as described.  Sleek and lightweight.  I has performed well so far!",
      "rating": "5"
    },
    {
      "title": "best laptop",
      "body": "best laptop i ever had it works really great. very happy with this purchase",
      "rating": "5"
    },
    {
      "title": "HP laptop",
      "body": "Great buy. Good laptop for our uses. \nEasy to handle.",
      "rating": "5"
    },
    {
      "title": "HP Envy 17.3\"",
      "body": "Great value for the price, love the touch screen and the backlite keyboard.",
      "rating": "5"
    },
    {
      "title": "Laptop",
      "body": "It works well for my daughter who is in college doing her homework",
      "rating": "5"
    },
    {
      "title": "New Computer",
      "body": "I lo\nlove will \n\n\n\n\nI love my new machine. Great speed and screen.",
      "rating": "5"
    },
    {
      "title": "Good value. Great quality. Easy to navigate.",
      "body": "Bought for daughter who is a special education teacher. This has been an awesome tool for her.",
      "rating": "5"
    },
    {
      "title": "Excellent fast user friendly",
      "body": "Very happy for new computer. Easy to use especially for seniors",
      "rating": "5"
    },
    {
      "title": "It's perfect for everyone",
      "body": "Love this laptop. It works perfectly both in typing and touch screen mode.",
      "rating": "5"
    },
    {
      "title": "AnnB",
      "body": "great display and love the backlit keyboard speed sometmes is slow",
      "rating": "5"
    },
    {
      "title": "HP ENVY Laptop",
      "body": "Love this laptop.  It is easy to use and very portable.",
      "rating": "5"
    },
    {
      "title": "Love it",
      "body": "This is my second HP Envy and i love my new one just as much as my first one!",
      "rating": "5"
    },
    {
      "title": "Replaced an old computer",
      "body": "Screen quality is good, I've only had this for a week, but have no issues or concerns.",
      "rating": "5"
    },
    {
      "title": "HP Computer",
      "body": "Very nice computer. I love the touchscreen option.",
      "rating": "5"
    },
    {
      "title": "Great computer for price point",
      "body": "Everything seems great with this computer so far. Love the large screen.",
      "rating": "5"
    },
    {
      "title": "Hp Envy 17.3",
      "body": "Very happy with the speed and overall ease of the set up.",
      "rating": "5"
    },
    {
      "title": "HP Envy evaluation",
      "body": "Is quick on startup and program operation.  Frequently buffers when attempting to view a video and audio occasionally \"crackles\".",
      "rating": "4"
    },
    {
      "title": "HP Envy",
      "body": "This computer arrived in a timely manner.  Great computer, great price. Easy to reach customer service at Best Buy to answer all of my questions. Highly recommend!",
      "rating": "5"
    },
    {
      "title": "Happy customer",
      "body": "Great store good customer service love the product that we bought everything he said it would be",
      "rating": "5"
    },
    {
      "title": "hp lap top",
      "body": "I love it, so far so good. easy to use nice big keyboard",
      "rating": "5"
    },
    {
      "title": "Great Laptop",
      "body": "This laptop runs and preforms like a dream. It's all I asked for and more.",
      "rating": "5"
    },
    {
      "title": "Great laptop for Graphic Design",
      "body": "Love it! Super fast and easy to work with. Zero complaints. Definitely worth every penny.",
      "rating": "5"
    },
    {
      "title": "HP Laptop",
      "body": "First new laptop in about 10 years. So far so good. No complaints",
      "rating": "5"
    },
    {
      "title": "Typical HP computer",
      "body": "Typical HP product, except the battery life is extraordinarily short. I had the laptop off and unplugged for 4 days. It was fully charged when it was unplugged. 4 days later, I turned it on (after plugging it in), and it only had 16% battery power left. I had to let it charge for a while before I could use it. If you don't use your computer daily, this may be an issue. The speed is good, and the display is sharp.",
      "rating": "3"
    },
    {
      "title": "Goid computer",
      "body": "Its a good computer. Has the power and features I need to get my work done.",
      "rating": "5"
    },
    {
      "title": "Laptop",
      "body": "I love the big screen!  Would purchase again in a heartbeat!",
      "rating": "5"
    },
    {
      "title": "Great Laptop",
      "body": "Needed a bigger screen to see apps better and this one works great!",
      "rating": "5"
    },
    {
      "title": "Laptop",
      "body": "does everything I wanted to do 12345678910 52 22 is that 52 remaining how many characters do you want?",
      "rating": "5"
    },
    {
      "title": "Great LapTop",
      "body": "Easy to set-up and navigate, clear graphics - love the 10-key",
      "rating": "5"
    },
    {
      "title": "Incredible performance",
      "body": "Great Machine! This machine handles every task I throw at it.",
      "rating": "5"
    },
    {
      "title": "Laptop",
      "body": "HP has good products and this laptop didn't disappoint a wonderful upgrade from my 7 yrs old HP",
      "rating": "4"
    },
    {
      "title": "Laptop",
      "body": "I love HP products just one has touchscreen. Only I will buy is HP.",
      "rating": "5"
    },
    {
      "title": "New HP, better than I hoped!",
      "body": "I love my new HP. This computer is more than what I need, and IMO better than a MAC. I have always had good luck with HP.",
      "rating": "5"
    },
    {
      "title": "Top product",
      "body": "Amazing I use it for audio engineering school and is great",
      "rating": "5"
    },
    {
      "title": "Excellent large screen",
      "body": "Fits our needs perfectly for online business bookkeeping.",
      "rating": "5"
    },
    {
      "title": "Rhianne0519",
      "body": "Fantastic quality. I love the fact that its touch screen.",
      "rating": "5"
    },
    {
      "title": "Best,",
      "body": "Great! The only place to buy a computer. great service! The geek squad was awesome",
      "rating": "5"
    },
    {
      "title": "Best computer I have ever worked with!",
      "body": "This computer has been absolutely perfect for our needs. I work for an Attorney and it has been so nice having an updated computer to work on. I am thinking about purchasing another one as soon as they go back on sale!",
      "rating": "5"
    },
    {
      "title": "So far so good",
      "body": "I bought it specifically  for school. I was pretty surprised  that it's  touch screen. I havent used it much yet, classes start next week.",
      "rating": "4"
    },
    {
      "title": "Excellent work",
      "body": "In love with the costumer service on the store they help me to found the best laptop.",
      "rating": "5"
    },
    {
      "title": "Katwoman",
      "body": "The young man that helped us was very helpful and kind.",
      "rating": "5"
    },
    {
      "title": "Office mgr",
      "body": "Love the touch screen. Using it for work from home.",
      "rating": "5"
    },
    {
      "title": "HP Envy 17 inch",
      "body": "Great computer so far!! Large screen and bright! No problems!",
      "rating": "5"
    },
    {
      "title": "Laptop",
      "body": "Always get HP computers.  A good computer.  Works good for my needs.",
      "rating": "5"
    },
    {
      "title": "Love the HP-Envy",
      "body": "My old PC died one night, and I had to get a new one,  This one has Windows 11, and I hate moving to the upgrades, but I had no choice.  However, I was thrilled to find that all my files were saved to the cloud, and I didn't lose anything.  I love the new features, such as a shutter for the camera, back-lit keyboard.",
      "rating": "5"
    },
    {
      "title": "Good laptop",
      "body": "Bought two laptops, good quality with HP , high cost, good service",
      "rating": "4"
    },
    {
      "title": "Thanks!",
      "body": "Great customer service and help from geek squad on set up and answering questions!!",
      "rating": "5"
    },
    {
      "title": "Why Buy a HP Laptop",
      "body": "This is the second computer we bought in 2024.  The price was right and the service exceptional.",
      "rating": "5"
    },
    {
      "title": "Great Service and Products!",
      "body": "Great help from sales staff and Geek Squad. We've always had that there!",
      "rating": "5"
    },
    {
      "title": "Fantastic Laptop",
      "body": "This is an awesome laptop.  Is perfect.  Edpecially the price.",
      "rating": "5"
    },
    {
      "title": "Thumbs up to BestBuy",
      "body": "BestBuy is amazing! Delivery is flawless. Packaging is excellent! So far, the HP Envy is awesome! Thank you BestBuy!!",
      "rating": "5"
    },
    {
      "title": "Its all about the teamwork at Best Buy.",
      "body": "i have never owned a laptop before i purchased this one. in all honesty my old tower was 12 years old so I did get a lot of value out of that old thing. But now I realize I am at the best place I could be at Best Buy. Try it, you will like it.",
      "rating": "5"
    },
    {
      "title": "Very happy overall",
      "body": "Laptop is great,  just heavier than I expected.  Love the facial recognition feature and the speed is great.",
      "rating": "4"
    },
    {
      "title": "Review",
      "body": "I got the laptop for school and it doea everything i could need it to.",
      "rating": "4"
    },
    {
      "title": "On point",
      "body": "Product as advertised. Facial recognition a bit strange but fun way to unlock.",
      "rating": "4"
    },
    {
      "title": "Great laptop",
      "body": "EXCeLENT!!!!! Laptop I love it works flawlessly  and has a fast response time to everything I do. The screen is crystal clear and back light on the keyboard is wonderful also . You won’t be disappointed",
      "rating": "5"
    },
    {
      "title": "For those who love laptop computers",
      "body": "Greet device.  Memory capacity, boot-up speed, picture quality, all great.  We replaced an older Envy 17\" laptop.  This Envy laptop is better with more memory and capability.",
      "rating": "5"
    },
    {
      "title": "Envy Laptop",
      "body": "Love the look.  Easy set up. Pretty much the same as my last hp.  Had it for years",
      "rating": "5"
    },
    {
      "title": "My lap top",
      "body": "Great still playing with it.a good laptop.x̌xxxxxxxxxxx̌xxxxxxxxxxxxxxxcxxccxxxxxxxcxxcx. Xxxxxxxxxxxxxxx",
      "rating": "5"
    },
    {
      "title": "Big screen and ease of use’",
      "body": "This is a great conputer. Very easy set up and love the big screen.",
      "rating": "4"
    },
    {
      "title": "DJ laptop",
      "body": "Excellent laptop. Great sales lady. Geek squad had it loaded and ready for me the next day.",
      "rating": "5"
    },
    {
      "title": "HP - Envy Laptop from Best Buy",
      "body": "This laptop is the right size for what I wanted in my home office.  It's fast and efficient.",
      "rating": "4"
    },
    {
      "title": "Good Place Buy what you need",
      "body": "Best Buy work with us picking the correct computer for use, the computer. The geek squad did great job completing the work on the new computer. Best Buy is the one and only to shop for computer and other items.",
      "rating": "5"
    },
    {
      "title": "Laptop",
      "body": "Love my new HP laptop and the customer service while making my purchase was beyond 5 stars",
      "rating": "5"
    },
    {
      "title": "Speedy and Secure",
      "body": "Fast. Ready from off in about 10 seconds. It turns off when not in use and requires face recognition or a code when restarting. It's really good at recognizing my face. Secure and fast.",
      "rating": "5"
    },
    {
      "title": "Great laptop!",
      "body": "Love this laptop! It's easy to set up and I was back to normal in no time at all!",
      "rating": "5"
    },
    {
      "title": "Ms",
      "body": "Love HP and value knowledge of your staff. Excellent customer service",
      "rating": "5"
    },
    {
      "title": "Laptop",
      "body": "Personnel were very helpful, product works well, no adverse comments",
      "rating": "5"
    },
    {
      "title": "Ms.",
      "body": "It satisfies my needs. It was a good price and fit within my budget.",
      "rating": "5"
    },
    {
      "title": "Graphics are terrible",
      "body": "Replaced my 10 yr old HP Envy with this one - was always told the old tech is outdated after a few years and maybe that's true, but what I wouldn't give for my old laptop to live forever. \n\nCons to this one: \n#1 con is that the graphics SUCK. Everything is hazy, nothing is sharp. When I checked the resolution, it's lower than what the settings say they are and what the laptop is sold as. \n\nI have a hard time believing this laptop is supposed to be the \"advanced\" choice. It's clunky. The keyboard and mouse pad feel cheap - and the mouse pad is not silent like my old one, it constantly sounds like you are brushing fabric.\n\nI'm increasingly frustrated at how hard it is to find a decent sized keyboard on a laptop, and was really hoping this laptop would do the trick. But I will be returning it ASAP. The keys almost feel dusty/powdery. \n\n\nThis is the second time I have tried to replace my old laptop, and the second time I am returning it because it's so crappy it makes my old one feel brand new despite it's 24hr updates and cranky demeanor. Maybe the tech improves drastically year after year, but the quality of the laptop itself sure goes down.",
      "rating": "1"
    },
    {
      "title": "pc",
      "body": "its fast its all i was hopeing for in a pc and then some",
      "rating": "4"
    },
    {
      "title": "Laptop",
      "body": "Nice big screen, great color. Have only had for short time.",
      "rating": "4"
    },
    {
      "title": "Laptop",
      "body": "All I would want or need in a computer. Very impressive screen.",
      "rating": "5"
    },
    {
      "title": "Sandy",
      "body": "Purchased this computer a few weeks ago. Very happy with it and especially happy with the sales person who helped us with what we needed and the Geek Squad who set it up and walked me through using it.",
      "rating": "5"
    },
    {
      "title": "Happy customer great laptop purchase",
      "body": "The gentleman that helped us was very friendly and explained all my options for a computer.  From desk tops to lap tops,  speeds and  space.  \nStore was clean and organized. \nThank you!",
      "rating": "5"
    },
    {
      "title": "HP laptop",
      "body": "Great laptop performance can handle all college applications.",
      "rating": "4"
    },
    {
      "title": "New laptop",
      "body": "Works great, easy transfer and was easy to setup. A tad heavy.",
      "rating": "4"
    },
    {
      "title": "HP",
      "body": "Super excited items with great deals always. Customer service friendly.",
      "rating": "5"
    },
    {
      "title": "Great Laptop",
      "body": "Love love love this laptop. Exceeded my expectations.",
      "rating": "5"
    },
    {
      "title": "HP Laptop",
      "body": "So far, so good. Working great, love Windows 11. All up to date on Windows updates! Used to a desktop, this is my first laptop.",
      "rating": "5"
    },
    {
      "title": "A solid purchase",
      "body": "Really enjoying my new HP laptop.  Really satisfied with great service provided by Best Buy team.",
      "rating": "5"
    },
    {
      "title": "Highly Recommend",
      "body": "This was a smart purchase for an exceptional device.",
      "rating": "5"
    },
    {
      "title": "Best Laptop I’ve Ever Owned!",
      "body": "I have had my share of laptops and this one is BY FAR the absolute best. Has all the features you want and a great price.",
      "rating": "5"
    },
    {
      "title": "good",
      "body": "nice ++++++++++++++++++++++++++++++++++++++++++++++++++++",
      "rating": "5"
    },
    {
      "title": "Lap Top",
      "body": "Great Buy!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
      "rating": "5"
    },
    {
      "title": "Pc",
      "body": "It’s the best one I never had before. I really really recommend this one!!",
      "rating": "5"
    },
    {
      "title": "Remarkable laptop",
      "body": "Touchscreen Intel Core Ultra 7 is a powerhouse of a laptop that seamlessly combines performance, design, and versatility. This laptop has exceeded my expectations in every way, making it a fantastic choice for both work and entertainment.\nEquipped with the Intel Core Ultra 7 processor, this laptop handles demanding tasks with ease.The speed and responsiveness are impressive, ensuring a smooth and efficient user experience.\nThe 17.3-inch touchscreen display is a standout feature. The large screen size offers an immersive viewing experience, perfect for streaming movies, working on detailed projects, or simply browsing the web. The touchscreen functionality adds an extra layer of convenience, making navigation intuitive and engaging. \nThe HP Envy boasts a sleek and elegant design. Its premium build quality is evident, with a solid construction that feels durable and robust. Despite its large screen, the laptop remains relatively lightweight and portable, making it easy to carry around for on-the-go productivity\nFor a laptop of this size and power, the battery life is impressive\nIn summary, the HP Envy 17 inch Touchscreen Intel Core Ultra 7 is a remarkable laptop that excels in performance, design, and functionality. It is an ideal choice for professionals, creatives, and anyone in need of a high-performance device that doesn't compromise on style or quality. I highly recommend it to anyone looking for a reliable and powerful laptop.",
      "rating": "5"
    },
    {
      "title": "New laptop",
      "body": "Great product and fantastic customer service.  Definitely worth a look if you’re searching for a new laptop.",
      "rating": "5"
    },
    {
      "title": "new pc",
      "body": "I had to replace my old faithful HP Pavillion, I started looking for a new PC and chose this one.  This one performs well with no problems.",
      "rating": "5"
    },
    {
      "title": "New envy",
      "body": "Just what I was looking for, at a good price.  Beat Sam’s price for a comparable product",
      "rating": "5"
    },
    {
      "title": "Nice computer",
      "body": "This computer is a nice upgrade from what I had. It also helps with the back light when I am working in areas that have little light.",
      "rating": "5"
    },
    {
      "title": "Computer",
      "body": "I am thankful for the customer service, but am also disappointed that my computer didn’t come with a charger.",
      "rating": "5"
    },
    {
      "title": "Dream Machine",
      "body": "First time owning a laptop and the HP Envy enables easy navigation for learning all features. Outstanding display of so many possibilities.",
      "rating": "5"
    },
    {
      "title": "Kim's review",
      "body": "Great computer, I have had no issues at all. Love this computer. Good price, great product.",
      "rating": "5"
    },
    {
      "title": "great Laptop",
      "body": "Great laptop but learning curve transitioning from Windows 10 to 11.",
      "rating": "5"
    },
    {
      "title": "New Laptop",
      "body": "The touch pad sometimes a bit sensitive (no adjustment fot that). Some things have happened that are related to Windows 11. Other than that, a happy customer.",
      "rating": "4"
    },
    {
      "title": "Product purchased",
      "body": "Canceling the annual fee is a hassle, which at the time of purchase the salesperson stated it would be no problem.  There is always a catch!",
      "rating": "4"
    },
    {
      "title": "Great Laptop",
      "body": "Love my new laptop.  It has amazing visual and audio.  Very happy with my purchase.",
      "rating": "5"
    },
    {
      "title": "Computer",
      "body": "Hands down this is the best computer I have ever had. The whole experience has been great.",
      "rating": "5"
    },
    {
      "title": "Learning about my new envy",
      "body": "So far i have been learning about this laptop. I had to buy a new printer because it wouldn't recognize my old one. I tried to download the drivers, but that didn't work.",
      "rating": "4"
    },
    {
      "title": "Great Computer.",
      "body": "Great quality computer for school work and for the little amount of gaming I get to do.",
      "rating": "5"
    },
    {
      "title": "HP Envy",
      "body": "love it Im learning how to use a lap top alll over again still things i dont undertand how to do but Im getting there",
      "rating": "5"
    },
    {
      "title": "Thank You",
      "body": "Great Computer you sell.  Had great customer service that day overall",
      "rating": "5"
    },
    {
      "title": "Bryce for manager",
      "body": "I was at the westland Michigan store and a young man named bryce helped me amazing guy i love the laptop thanks bryce",
      "rating": "5"
    },
    {
      "title": "good brick",
      "body": "it's a good machine and the setup was very easy.  only complaint is it is a brick, very heavy.",
      "rating": "4"
    },
    {
      "title": "Envy laptop rocks!!!",
      "body": "Awesome upgrade from last year's model!!! James was great at giving me this recommendation. The Envy desktop is on my hitlist next.",
      "rating": "5"
    },
    {
      "title": "Great Everyday Laptop",
      "body": "Easy set up except when trying to connect a network.",
      "rating": "4"
    },
    {
      "title": "very nice upgrade",
      "body": "Perfect replacement for my dinosaur laptop.  Haven’t had time to learn all about it, but so far, I love it.",
      "rating": "5"
    },
    {
      "title": "Great laptop",
      "body": "I dont use it a whole lot but it works great for what i do!",
      "rating": "5"
    },
    {
      "title": "computer",
      "body": "this is great! this great! this is great! this is great!",
      "rating": "5"
    },
    {
      "title": "Production Manager",
      "body": "Just love it. So much more convenient to have a lap top than a desk top.",
      "rating": "5"
    },
    {
      "title": "Good Turtle",
      "body": "The touch screen works very well and Iove my light up keyboard when needed but unfortunately the touch pad is very slow to respond.",
      "rating": "3"
    },
    {
      "title": "2024 Lapp7",
      "body": "Easy to use & easy to setup.  This is my 2nd 17.3\" Envy.",
      "rating": "5"
    },
    {
      "title": "Loving it!",
      "body": "I’ve always had a large desktop.  The HP Envy 17.3 “ laptop I recently purchased is perfect (so far).",
      "rating": "5"
    },
    {
      "title": "Can't repair",
      "body": "I bought this computer in June 2024 and it is a great device, but too heavy. However, about 3 maybe 4 months into use, one of the heater fans went bad, but then stoopped making a loud noise. In December, the fan started going really bad. Late in January I took it in for repair and it went from bad to worse. Geek Squad can't get the part to fix it. So it's toast. HPs seem to have a problem with overheating. I'm done with HPs.",
      "rating": "2"
    },
    {
      "title": "Envy Review",
      "body": "touch-screen does no work.  Probably wouldn't use it anyway.",
      "rating": "5"
    },
    {
      "title": "Good deal for a good machine",
      "body": "Laptop works great. Sales experience was pleasant.",
      "rating": "5"
    },
    {
      "title": "New laptop",
      "body": "Great product, I really love it. so many new options to learn.",
      "rating": "5"
    },
    {
      "title": "Great Computer.",
      "body": "Great compute; HP makes a great machine with SSD drive.",
      "rating": "5"
    },
    {
      "title": "Great laptop charger gets way too hot",
      "body": "I love my laptop the only concern I have which scares me a bit is that the charger gets very hot when charging",
      "rating": "4"
    },
    {
      "title": "Nice computing",
      "body": "Nice piece of equipment! No issues at all. Just needed help setting up the Microsoft office.",
      "rating": "5"
    },
    {
      "title": "Great Laptop For The Sale Price",
      "body": "Great Laptop For The Sale Price with quality features.",
      "rating": "4"
    },
    {
      "title": "New laptop",
      "body": "So far, so good with my new laptop. The salesman was very helpful and the Geek Squad was excellent!",
      "rating": "5"
    },
    {
      "title": "Nice",
      "body": "Great computer at a fantasticly reduced price. Thanks",
      "rating": "5"
    },
    {
      "title": "New laptop",
      "body": "Service was excellent.  Tech was very bright and helpful.  I got exactly what I wanted.",
      "rating": "5"
    },
    {
      "title": "Great size!",
      "body": "An absolute pleasure!  My daughter loves her laptop.",
      "rating": "5"
    },
    {
      "title": "Great purchase",
      "body": "Great computer. Great assistance from the best buy employee who assisted me.",
      "rating": "5"
    },
    {
      "title": "Excellent Customer Service",
      "body": "excellent Customer Service, they offer me what i m looking for",
      "rating": "5"
    },
    {
      "title": "mr",
      "body": "love this computer..its what i needed and i lucked out as it was on sale $350, only$999.99",
      "rating": "5"
    },
    {
      "title": "Excellent laptop",
      "body": "Windows 11 is taking a little to get used to but overall the laptop itself is excellent",
      "rating": "5"
    },
    {
      "title": "Satisfied Customer",
      "body": "Love my new HP Envy laptop and the service I received from Geek Squad was excellent.",
      "rating": "5"
    },
    {
      "title": "HP Laptop",
      "body": "Wonderful laptop and the service was great when purchasing and getting it setup.",
      "rating": "5"
    },
    {
      "title": "Off to college",
      "body": "Very fast and amazing viewing. Perfect for college.",
      "rating": "5"
    },
    {
      "title": "Wow",
      "body": "Great picture and sound. Would highly recommend to anyone.",
      "rating": "5"
    },
    {
      "title": "Great laptop!",
      "body": "Love everything about this laptop, all I ever need",
      "rating": "5"
    },
    {
      "title": "Laptop",
      "body": "Great laptop!  Display is fantastic!  Great forms work.",
      "rating": "4"
    },
    {
      "title": "computer purchase",
      "body": "Great computer. Great service from that young man at the bestbuy in millbury, ma",
      "rating": "5"
    },
    {
      "title": "New Laptop",
      "body": "Great new laptop and will even be better when I figure out how to use it!",
      "rating": "5"
    },
    {
      "title": "HP",
      "body": "Does everything I need. Keyboard size is good. Setup was smooth.",
      "rating": "5"
    },
    {
      "title": "HP ENVY 17.3",
      "body": "Great laptop, suitable for at home office or use for school.",
      "rating": "5"
    },
    {
      "title": "Dell Laptop",
      "body": "Very good team, it seems very excellent to me I recomend it to you",
      "rating": "5"
    },
    {
      "title": "Great Laptop",
      "body": "Great Laptop!  I highly recommend this laptop.  Very easy to use and setup.",
      "rating": "5"
    },
    {
      "title": "Long-term satisfaction",
      "body": "I continue to be very satisfied with HP-Envy computers since this is my third one.",
      "rating": "5"
    },
    {
      "title": "Better than the last one",
      "body": "Very good with all options easy to use and understand.",
      "rating": "5"
    },
    {
      "title": "Excellent Laptop",
      "body": "Love this laptop! Everything I need for my business and software.",
      "rating": "5"
    },
    {
      "title": "Laptop",
      "body": "Very nice laptop with all the latest tech!!!!!!!!!!!!!!!!!!!!!!!!!!!",
      "rating": "5"
    },
    {
      "title": "Envy",
      "body": "Bought to replace previous Envy. Staff was super in helping me choose!",
      "rating": "5"
    },
    {
      "title": "repeat buyer",
      "body": "No problems with this HP PC. It's working as it should.",
      "rating": "3"
    },
    {
      "title": "Faulty Equipment, Faulty Support",
      "body": "I purchased a similar laptop several years ago and we loved it so much, we bought two of these.  After 8 months, this laptop started to have blurry text and images.  After a week of troubleshooting, the final technician was viewing my laptop screen through my camera phone and was indicating he couldn't see the blurry issue.  I indicated that I also couldn't see it through the camera, but when my spouse and I were looking directly at the screen it was absolutely happening.  They told me I was wrong, that there was no issue.  So I just bought a new Samsung laptop because I won't engage with a company that doesn't trust me.  I do not recommend this laptop.  It malfunctioned after 8 months and support was not helpful.",
      "rating": "1"
    },
    {
      "title": "Laptop computer",
      "body": "Great product everything i was looking for and fair price!!",
      "rating": "5"
    },
    {
      "title": "Just love it..",
      "body": "It just what i was looking for...great quality product.",
      "rating": "5"
    },
    {
      "title": "Laptop",
      "body": "good value and reputation of HP products always stands",
      "rating": "5"
    },
    {
      "title": "HP Computer/Monitor",
      "body": "I love it! Great to finally get rid of that old CPU!",
      "rating": "5"
    },
    {
      "title": "new computer",
      "body": "enjoying new computer. sharp picture and wording..",
      "rating": "5"
    },
    {
      "title": "Laptop Computer",
      "body": "Satisfied with Product. XXXXXXXXXXXXXXXXXXXXXXXXXX",
      "rating": "5"
    },
    {
      "title": "HP Envy",
      "body": "The laptop has worked well and performs as I hopefully",
      "rating": "5"
    },
    {
      "title": "Great HP Envy computer",
      "body": "Good replacement for our old HP Envy computer. Our old one lasted 8 years",
      "rating": "4"
    },
    {
      "title": "Not as described",
      "body": "I would have given more stars but I ordered a open box in excellent condition but it arrived in “good” condition at best   It is a good computer but will never order another open box from Best Buy.",
      "rating": "2"
    },
    {
      "title": "It's okay",
      "body": "Fan is always coming on because it doesn't control the heat well. I ended up returning. Besides that, it's a pretty decent computer.",
      "rating": "2"
    },
    {
      "title": "battery life too short",
      "body": "battery looses charge very quickly. pretty good other than that.",
      "rating": "3"
    },
    {
      "title": "Review",
      "body": "Excellent Value.  Excellent cusomer service.  Easy installation.",
      "rating": "4"
    },
    {
      "title": "BEST BUY STEALING MONEY FROM ME!!!!!!!!!!!!!!!!!!!",
      "body": "your store stole over 1200 dollars from me on a store credit and then had me charge the rest on a best buy credit card which they denied 1 week later I purchased 2 laptops today and no one on any of your overseas operators can tell me where the money the store employees said it was charged back to my charge card but then you denied my charge card that best buy let me charge the extra amount on so best buy is responsible for stealing over 1200 dollars from me plus my time and my suffering from dealing with overseas operators that can barely speak english I am contacting a lawyer on Tuesday and will be suing for a my money plus my time on this site my time with your overseas poorly paid agents that barely speak let alone understand english all I got from them i sorry i sorry isorry so best buy will be paying a lot for all this unacceptable ignorance",
      "rating": "1"
    },
    {
      "title": "I would not purchase this again!",
      "body": "I set this laptop up on 11/19/24.  I have had so many problems with it!  I do have to admit that I have no technical skills, so problem solving is hit and miss with me.  I would not buy this product again.  I only bought it because it was similar to the one I bought 3 years ago.  It didn't even last 3 years!  I guess I should have learned from that one!  I have had luck in the past with HP products, so I had just assumed that I got a \"lemon\" with the last one, but I am very under-impressed with this one so far.  I haven't even made it a month and the problems are starting!",
      "rating": "1"
    },
    {
      "title": "Laptop",
      "body": "Young man very helpful. Great job! He has assistant me twice.",
      "rating": "4"
    },
    {
      "title": "Geek Squad Service - Data transfer",
      "body": "Product was fine. Transfer of data from Old pc to new pc by geek squad was poor incomplete and inaccurate.",
      "rating": "3"
    },
    {
      "title": "Crap",
      "body": "Owned for three months and started glitching screen goes totally black and you can do nothing not to mention trying to figure out how to get the computer to stop blocking every single website without you manually okaying. The cookies is an absolute nightmare. The Support is terrible. One week after my total tech warranty support expired the computer Started going black and they told me I can’t return it and it would be 90 bucks to service it. Won’t go to Best Buy again and this Hewlett-Packard product is nothing but a pain.",
      "rating": "1"
    },
    {
      "title": "Waste of time",
      "body": "So Best Buy won’t match HP price\nMatch. So I just returned this and bought from HP. Brst buy online customer service is the worst. Best Buy loved wasting money",
      "rating": "2"
    },
    {
      "title": "Poor battery life",
      "body": "Purchased a little over a week ago.  Many great features and improvements over my similar Hp bought 3 years ago.  The biggest issue I have is this unit has poor battery life!  I have this unit plugged in charging more time than I have actual run time charged.  Very disappointed on this issue!",
      "rating": "2"
    },
    {
      "title": "Disappointed",
      "body": "Almost right away the computer started to produce feedback static anytime sound is used (e.g., videos, games, etc.).  Happens on zoom calls anytime I speak and the other participant on the video call hears the static. It's very disruptive and unpleasant.  It also started locking up where there's only a black screen and spinning arrow and cannot get out of it without hitting the off button. Never had these issues with my previous 7 year old HP Envy.",
      "rating": "1"
    },
    {
      "title": "Faulty after one month",
      "body": "After about one month, I had a problem with the text on screen going blurry and wiggling. I looked it up online and it is a known occurrence. Not my eyes!  Please see:\n\nhttps://h30434.www3.hp.com/t5/Notebook-Video-Display-and-Touch/HP-Envy-x360-Laptop-Display-Random-text-distortion-shaky/td-p/7905610\n\nThis is a random occurrence and did not do it when I brought it in to the store. Getting a full refund.",
      "rating": "1"
    },
    {
      "title": "HPE doesn't honor their warranty. Aviod.",
      "body": "My 17\" Envy stopped working after two months. HPE refused to fix it. Long story short ... they suck.",
      "rating": "1"
    },
    {
      "title": "I used to be an Hp enthusiast.",
      "body": "This computer was returned because of arbitrarily getting a jittery screen and the screen blanking out with no apparent reason or ability to keep this from happening.\nUnfortunately for me I purchased another one in September, and it is doing the same thing only it is past the return date.",
      "rating": "1"
    },
    {
      "title": "I regret purchasing this HP Envy Laptop",
      "body": "Not happy with the HP Envy Laptop! I have been using the laptop for only two weeks and the screen is vibrating. The words and images are moving from side to side and blurry. It is terrible trying to read the screen, it is making me feel like I am having a stroke! Also, the touchpad is very slow to respond, If I keep it, I will have to use a mouse instead. Of course, it is past the return time period.",
      "rating": "1"
    },
    {
      "title": "Terrible sound",
      "body": "Worst sound system I've ever heard on a compute, otherwise not a bad computer",
      "rating": "2"
    },
    {
      "title": "Extremely poor customer service!",
      "body": "Yesterday, I received my “excellent condition” reconditioned HP Envy laptop. I soon realuzed that the camera did not work. As it was late and i needed to work, i chatted with customer service. One CSR could not be bothered to connect with me. The ither two did not listen to me that i had kust received the laptop FROM BEST BUY and tried to sell me a $179 serbice plan!!!  After 32 years of purchasing everything electronic from Best Buy, i will NEVER EVER buy ANYTHING from Best Buy again. Returning this laptop and making due with an old Chromebook and an old laptop as i need to work!  Don’t buy from them. They no longer care anout customer service.",
      "rating": "1"
    },
    {
      "title": "Microphone not working",
      "body": "Not able to use the microphone had it repaired four times",
      "rating": "1"
    },
    {
      "title": "Terrible delivery service!!!!",
      "body": "Great computer, BUT TERRIBLE SERVICE ON DELIVERY.  Will never buy anything that will be delivered by FED EX!!! Will find another store that uses a real company, not a fly by night one.",
      "rating": "1"
    },
    {
      "title": "Disappointed",
      "body": "This would have been my 3rd Hp computer and I keep mine for years. I have always been happy them. For the price I expected it to jump out of the box and say what can I do for you. Silly me. It wouldn't even connect to my Wifi. None of the suggestions worked. Returned it to the store and got a refund.",
      "rating": "1"
    },
    {
      "title": "Died even the battery is full.",
      "body": "It was working good but had issues after 4 months.",
      "rating": "2"
    },
    {
      "title": "Freezes up",
      "body": "This laptop has frozen up on me and shut down twice in the first week that I have had it. I bought this as a second backup laptop and now I am past the time for return by 8 days. Don't purchase!",
      "rating": "1"
    },
    {
      "title": "Junk",
      "body": "Junk. Two months…. Had to replace display cables and now won’t power on. Oversized paperweight.",
      "rating": "1"
    },
    {
      "title": "lap top",
      "body": "I would not recommend this laptop, it is not easy to work with.",
      "rating": "2"
    },
    {
      "title": "Sucks",
      "body": "Heavy as fk and cant return because lakewood store sucks",
      "rating": "1"
    },
    {
      "title": "Computer is Great, But the Geek Squad Lied To Me",
      "body": "The computer is everything!!! Just be sure that the Geek Squad is being honest about whether you need a new one!",
      "rating": "1"
    },
    {
      "title": "Great computer-happy camper!",
      "body": "I love this computer. I just got it but is so fast and easy to use. Large screen makes it easy to see. SO glad I took the leap and bought a new one.",
      "rating": "5"
    },
    {
      "title": "HP’s game has stepped up!",
      "body": "Months of research & comparing laptops, & savings money for a laptop, not just any would do, wanted one with the juice to handle work, college and whatever else & so impressed with my choice. It’s so user friendly, speedy, lots of space, built solid & I shed a tear opening the box for the first time. Love it! Took the financing so no interest for 12-mths made it easier. Such great customer service at this store, really impressed by their knowledge & interest in meeting my tech needs.",
      "rating": "5"
    },
    {
      "title": "Love it!",
      "body": "Needed to replace my other laptop cuz I spilled coffee on it (insert cry face) and I had all my homework saved on it! Best Buy helped me out and showed me the Envy and BOY do I LOVE it! The size is perfect, great storage, fast, and a beast of a computer! Thanks HP!",
      "rating": "5"
    },
    {
      "title": "ENJOYING HP ENVY LAPTOP",
      "body": "I am enjoying this laptop with it's amazing performance, enjoying bigger HD screen for graphics and movies.",
      "rating": "5"
    },
    {
      "title": "Rob",
      "body": "good size screen, clear vibrant graphics, easy to navigate around",
      "rating": "5"
    },
    {
      "title": "new laptop",
      "body": "works just like i expected it to. I was using a windows 7 pc before i  graduated to a windows laptop. Takes some getting used to. copilot is helping a lot. now i need a 3,2 hub. I was using a 1.0 hub with the pc. I bought a 2.0 hub for this laptop. I understand that a 3.2 hub is more than 10 times faster. So help me win that $400 gift card so I can buy that 3.2 hub. Thanks",
      "rating": "5"
    },
    {
      "title": "Great product",
      "body": "Good fast computer, excellent screen display and easy set up.\n\nDefinitely recommend!!",
      "rating": "5"
    },
    {
      "title": "Glitched.",
      "body": "It is a good computer and I love how big the screen is. I will be returning this tomorrow after only having it for 24 hours because it has already glitched on me and the screen went black for a few seconds. Not sure if this was just a bad egg, but not really happy that have to return it. Overall, I would have given it 5 stars.",
      "rating": "4"
    },
    {
      "title": "The greatest laptop ever!!!!!!!!!!!!!!!!!!!!!!!!!!",
      "body": "Featuring a 17.3\" (1 foot, 5.3 inch) touch screen, 1 Terabyte Solid State Drive, and a Glacier Silver base!!!!!!!!!!!!!!",
      "rating": "5"
    },
    {
      "title": "Laptop",
      "body": "Everything was great, windows 11 is was a pain, however I got over it.",
      "rating": "5"
    },
    {
      "title": "love my computer",
      "body": "love my new computer once I figured out how to use it!",
      "rating": "5"
    },
    {
      "title": "HP laptop",
      "body": "Easy to set up. Love the touch screen on this model.\nNice to be up to date on the latest technology for a reasonable price.",
      "rating": "5"
    },
    {
      "title": "New laptop",
      "body": "Easy to set up (especially for an old lady) great performance. Everything we needed plus some.",
      "rating": "5"
    },
    {
      "title": "EnvyLorellie",
      "body": "I love my Envy HP! It's so very quick and easy!!!!",
      "rating": "5"
    },
    {
      "title": "HP Envy Laptop 2024 Edition",
      "body": "Very satisfied with my new HP Envy 17.3\" Full HD Touch-Screen laptop!\nJust what I wanted! Thank you Best Buy for the good service!",
      "rating": "5"
    },
    {
      "title": "HP Nightmare That Broke Down After One Year",
      "body": "I’ve had nothing but trouble with HP laptops, and honestly, I wouldn’t recommend them to anyone. My experience has been a nightmare. After just about a year of use, my laptop completely broke down—started with random screen flickering, then the keyboard stopped responding, and eventually, it wouldn’t even turn on. It felt like it was built to fail.\n\nWhat’s worse is how quickly the battery life deteriorated. I remember when I first got it, I could use it for hours, but within a year, I could barely get through a couple of hours of work before it started dying on me. It’s incredibly frustrating when you’re paying for something that’s supposed to last and it doesn’t even come close.\n\nAnd don’t even get me started on HP’s customer service. Trying to get help or a replacement was a headache. It felt like they were avoiding responsibility, and I was left stuck with a broken laptop. They don’t seem to care much about their products once they’ve sold them to you.\n\nHonestly, if you’re looking for a reliable laptop, HP is not the way to go. The poor build quality and frustrating customer support made my experience so much worse than it needed to be. I’d never buy another one.",
      "rating": "1"
    },
    {
      "title": "Good",
      "body": "It’s a Good laptop. No issues. Does the job. Thank you.",
      "rating": "5"
    },
    {
      "title": "Battery/C-port charging issues!",
      "body": "Bought this brand new and within 30 days it quit charging. Took it in and they exchanged it for a new one… 2-3 months later I had to drop it off for repairs for the SAME ISSUE. 2 brand new laptops that quit charging within 90 days of ownership. Sits on a desk and never moves….Swapped from a macbook and i regret my decision.",
      "rating": "2"
    },
    {
      "title": "too many issues",
      "body": "this is by far the absolute worst laptop there is on the market. i have dealt with problem after problem, from the laptop constantly falling asleep, and the camera just randomly disconnecting it so irritating, i wish i could trade it in for something else.",
      "rating": "1"
    }
  ]
}