{
  "name": "HP 14-fm0023dx",
  "price": "1149.99",
  "rating": "4.8",
  "reviews": "91",
  "specs": " OmniBook X Flip 2 - in - 1  -  Copilot+ PC  -  14\" 2K Touch - Screen Laptop  -  Intel Core Ultra 7  -  16GB Memory  -  1TB SSD  -  Atmospheric Blue",
  "product_url": "https://www.bestbuy.com/site/hp-omnibook-x-flip-2-in-1-copilot-pc-14-2k-touch-screen-laptop-intel-core-ultra-7-16gb-memory-1tb-ssd-atmospheric-blue/6613867.p?skuId=6613867",
  "full_specs": {
    "Screen Type": "IPS",
    "Screen Size": "14 inches",
    "Screen Resolution": "1920 x 1200 (Full HD+)",
    "Touch Screen": "Yes",
    "Brightness": "400 nits",
    "Processor Model": "Intel Core Ultra 7 Series 2",
    "Storage Type": "SSD",
    "Total Storage Capacity": "1024 gigabytes",
    "System Memory (RAM)": "16 gigabytes",
    "Graphics": "Intel Arc 140V",
    "Display Connector(s)": "1 x HDMI 2.1, 1 x Thunderbolt 4",
    "Battery Life (up to)": "22.75 hours",
    "Battery Chemistry": "Lithium-ion polymer",
    "2-in-1 Design": "Yes",
    "Backlit Keyboard": "Yes",
    "Brand": "HP",
    "Model Number": "14-fm0023dx",
    "Product Name": "OmniBook X Flip 2-in-1 - Copilot+ PC - 14\" 2K Touch-Screen Laptop - Intel Core Ultra 7 - 16GB Memory - 1TB SSD",
    "Color": "Atmospheric Blue",
    "Year of Release": "2025",
    "Display Type": "LED",
    "Color Gamut (Standard RGB)": "62.5 percent",
    "Processor Brand": "Intel",
    "Processor Model Number": "256V",
    "CPU Boost Clock Frequency": "4.8 gigahertz",
    "Number of CPU Cores": "8-core",
    "CPU Cache Memory Level": "L3",
    "L3 Cache": "12 megabytes",
    "Neural Processing Unit (NPU)": "Yes",
    "Maximum NPU Performance": "47 trillions operations per second",
    "Solid State Drive Capacity": "1024 gigabytes",
    "Solid State Drive Interface": "PCIe 4.0",
    "Type of Memory (RAM)": "LPDDR5",
    "System Memory RAM Speed": "8533 megahertz",
    "Graphics Type": "Dedicated",
    "GPU Brand": "Intel",
    "GPU Video Memory (RAM)": "8 gigabytes",
    "Operating System": "Windows 11 Home",
    "Number of HDMI Outputs (Total)": "1",
    "Number of Thunderbolt Ports (Total)": "1",
    "USB Ports": "1 x USB-C 3.1, 2 x USB-A 3.1",
    "Number of USB Ports (Total)": "3",
    "Headphone Jack": "Yes",
    "Microphone Input": "Yes",
    "Wireless Connectivity": "Bluetooth, Wi-Fi",
    "Wireless Networking Standard": "Wi-Fi 6E",
    "Number Of Ethernet Ports": "0",
    "CPU Cooling System": "Air",
    "Power Supply Maximum Wattage": "65 watts",
    "Battery Cells": "3-cell",
    "Front-Facing Camera": "Yes",
    "Front Facing Camera Megapixels": "5 megapixels",
    "Built-In Microphone": "Yes",
    "Touchpad Type": "Multi-touch",
    "Media Card Reader": "No",
    "Audio Technology": "DTS: X Ultra",
    "Speaker Type": "Poly Studio with dual speakers",
    "Windows AI": "Copilot+ PC",
    "Security Features": "Privacy camera",
    "Casing Material": "Aluminum",
    "Product Height": "0.58 inches",
    "Product Width": "12.32 inches",
    "Product Depth": "8.6 inches",
    "Product Weight": "3.06 pounds",
    "ENERGY STAR Certified": "Yes",
    "EPEAT Qualified": "Yes",
    "EPEAT Level": "Gold",
    "Optical Drive Type": "None",
    "Numeric Keypad": "No",
    "Warranty - Parts": "1 year",
    "Warranty - Labor": "1 year",
    "UPC": "198990145433"
  },
  "all_reviews": [
    {
      "title": "Small laptop Big Performance",
      "body": "Great laptop. Screen is crystal clear. Fast processor. Frame feels strong. Battery lasts a long time. Lighted keyboard is bright. USB C charger is convenient. BestBuy price matched a week after i got it for a hundred cheaper.",
      "rating": "5"
    },
    {
      "title": "I Love this laptop pc",
      "body": "It’s an amazing laptop. I love the fact that I can use the Ai to learn things. I love how I can use it as a tablet as well and that it’s good to play pc video games with!",
      "rating": "5"
    },
    {
      "title": "Savvy!",
      "body": "Handy, sleek and fast! I like it much esp with co-pilot bult in since It gives me unlimited infos and searches!",
      "rating": "5"
    },
    {
      "title": "Reliable Laptop",
      "body": "Love the laptop because of its flexibility to use.",
      "rating": "5"
    },
    {
      "title": "OmniBook Laptop 2-in-1 Review: Compact Powerhouse",
      "body": "The OmniBook 2-in-1 laptop packs an impressive punch in a sleek, portable design. With a 14-inch display, 16GB of memory, and a spacious 1TB hard drive, it handles daily tasks with ease and provides ample storage for games, media, and work files.\nOne of the standout features is its portability. It’s lightweight and compact, making it perfect for on-the-go use—whether you're commuting, working remotely, or simply moving from room to room. The 2-in-1 functionality adds versatility, allowing users to switch seamlessly between laptop and tablet modes.\nPerformance-wise, this laptop holds its own in gaming. Running Call of Duty titles was a smooth experience, with responsive gameplay and minimal lag. While it may not match the raw power of a dedicated gaming rig, it’s a solid option for casual gamers who need a balance between performance and portability.\nOverall, the OmniBook 2-in-1 is a reliable choice for those seeking a compact yet capable device. Whether for work, travel, or gaming, it offers the flexibility and performance to meet a variety of needs.",
      "rating": "5"
    },
    {
      "title": "Premium",
      "body": "This laptop is an excellent deal for the price. It features a fully metal build that looks and feels premium and classy. The overall design and finish are impressive, giving it a high-end look typically found in more expensive models.\n\nPerformance-wise, it meets all my expectations and more. I’ve been very happy with how it handles daily tasks, and everything else about the laptop has been great.\n\nThe only downside for me is the keyboard. The keys feel a bit stiff and require more pressure to type, which takes some getting used to. Their square shape also makes the typing experience slightly less comfortable until you adjust.\n\nThat said, this is a minor issue compared to everything else the laptop offers. Overall, I’m very satisfied with my purchase and would definitely recommend it to anyone looking for a stylish and capable machine at a great price.",
      "rating": "4"
    },
    {
      "title": "Great Performance and Versatility – Worth it",
      "body": "I’ve been using the HP OmniBook for a few weeks now, and I’m genuinely impressed. The 14\" 2K touch-screen is vibrant and super responsive, making it a pleasure to use for both work and streaming. The Intel Core Ultra 7 processor keeps everything running smoothly — whether I’m multitasking, using design software, or joining video calls.",
      "rating": "5"
    },
    {
      "title": "Very Satisfied",
      "body": "I’m very satisfied so far. It looks and feels even better than in pictures. The battery life is great, as is the screen brightness. I’m a fan of Windows 11 so far after coming from a Windows 10 product. Copilot sounded a little gimmicky to me at first, but I’m starting to find it useful as a built-in AI software. I’m actually pretty curious to explore more ways to use it. I like the keyboard, but it can take some getting used to (as with any). I wish the trackpad was a little stiffer, but it’s still good.",
      "rating": "5"
    },
    {
      "title": "Great travel laptop!",
      "body": "This is a dream come true. It is light,yet powerful. I travel a lot , and usually have to make compromises with what I use a laptop for if I don't bring my workhorse laptop. I brought this with me on a recent 3 week trip- it did everything that I needed ( video/ photo editing,AI , documents, and even some Madden 25 gaming.  3 pounds lighter than what I would have normally carried!",
      "rating": "5"
    },
    {
      "title": "Get it and haev no regrets!",
      "body": "So far this laptop has been great. The features and specs of this machine, and the deal of the day pricing have made having this a dream. This is one of my main devices for media consumption and the screen and speakers are amazing. Even at the regular price, I feel with the specs it's worth it. I have no question, this will get me through college.",
      "rating": "5"
    },
    {
      "title": "Perfect find.",
      "body": "This computer is everything i wanted. Perfect travel size, still large enough to enjoy streaming movies. Runs fast and efficiently. Well-appointed keyboard for touch-typing. Was goi g to use as my 2nd computer but will be using it as my main one. Even sweeter is I got it at a Memorial Day sale price. Still early days but very, very happy.",
      "rating": "5"
    },
    {
      "title": "HP Omibook X Flip 2 in 1",
      "body": "Great laptop for the price.  Does everything I need it to do.  This Omnibook is super fast and With Windows 11 and 16 Gigs of Ram the utilization is spectacular.  Crystal clear display.  Battery life is amazing.  With a full charge it will last me all day until the evening when I would Recharge again.  But still have battery life remaining.  Would definately recommend.",
      "rating": "5"
    },
    {
      "title": "My experience with Best Buy",
      "body": "I think the most helpful thing for me was the patience and kindness of your employee.  I can't remember the name of the fellow, but I do remember he was from the country Tunisia.  He was vert helpful and not pushy at all.  He really helped me in understanding what I was getting and the pros and cons of the product.  He was super patient with my tech ignorance!",
      "rating": "5"
    },
    {
      "title": "Omnibook flipx",
      "body": "Great so far. The HP OmniBook Ultra Flip 14 excels with its vibrant 3K OLED display, responsive keyboard, and robust battery life. Its lightweight, convertible design is ideal for professionals and creatives alike. While pre-installed bloatware is a drawback, overall performance and portability make it a top-tier choice for daily productivity and light gaming.  ￼ ￼ ￼",
      "rating": "5"
    },
    {
      "title": "Best little computer",
      "body": "This computer is small, compact and powerful.\nThis computer is definitely the everyday and travel computer you need. I love how fast and smooth it is. In tablet form the touchscreen is precise and fast. It is clear, bright and fast. I have no complaints and only praise. 10/10",
      "rating": "5"
    },
    {
      "title": "Mr.",
      "body": "Am very happy with my new HP Omnibook Laptop. It’s great. \nBest of all was the excellent help from the Geek Squad, Ronan, Q, Adrian, and the young woman who first helped me. I couldn’t ask for better customer service in setting up my computer. Great staff Great store. Great HP product. Thank you all.",
      "rating": "5"
    },
    {
      "title": "Great Little 14\" LED",
      "body": "Very good Laptop for a 14\". Very responsive and the LED screen exceptionally bright. Good Battery life as it will perform all day which makes it great for streaming. The price, when I purchased was better than anyone's with the same spec's. Too bad it's still not on sale as I would purchase another an additional unit!",
      "rating": "5"
    },
    {
      "title": "very good",
      "body": "I bought the lap top for my son for his first year in college. The sale price was right.  The 14 inch display fits in his back back well.  I read this computer is not a speedy gaming computer, but it is speedy for what he does for school applications and watching the internet",
      "rating": "5"
    },
    {
      "title": "I’m very happy",
      "body": "I ordered a computer on the Best Buy website — everything was quick and easy. I picked it up in the store the next day. The computer works great and matches the description completely. I’m very happy with the purchase!",
      "rating": "5"
    },
    {
      "title": "HP Ominibook versatile laptop",
      "body": "Overall it's a good laptop and worth money. However its not something I would say wow. It's 2-in-1 laptop with latest core ultra 7 series 2 processor with IPS screen with 400 nits. It's light weight and has long battery life. I didn't like the keyboard and keypad of the laptop.",
      "rating": "4"
    },
    {
      "title": "Excellent Upgrade",
      "body": "This is an excellent upgrade from my 7 year old laptop. The laptop performs nicely. I have been working with a 300 page book using MS Word to edit the book and so far I haven’t had any problems.",
      "rating": "5"
    },
    {
      "title": "Great Laptop for daily use at home and on the road",
      "body": "love this laptop. I've been using Surface pros, 3 of them, since the first one came out but this laptop rocks for it's built quality, speed with all the software i use as well as all the standard ports comes with it.",
      "rating": "5"
    },
    {
      "title": "Good Purchase for School Laptop",
      "body": "The laptop was easy to set up and is very user friendly. It’s lightweight enough to not add to the weight of school books but runs efficiently.",
      "rating": "5"
    },
    {
      "title": "hmmm",
      "body": "its was a good opportunity for me to get omnibook at a very best price and it serve the reason why i purchase it, very fast responding in data and good for the price.",
      "rating": "5"
    },
    {
      "title": "Nice laptop",
      "body": "I've been using this laptop for a few weeks and it's been excellent so far. Fast performance, solid battery life, and a sleek design. Great for both work and everyday use. Highly recommend!",
      "rating": "5"
    },
    {
      "title": "In love",
      "body": "I wanted something that would be lighter to carry than my gaming computer but still wow me with speed and this delivered. Love the color and the touch screen.",
      "rating": "5"
    },
    {
      "title": "HP Omnibook 16GB Memory - 1TB SSD",
      "body": "Excellent laptop. It is fast and easy to work with. a fantastic everyday personal laptop for documents, videos, games...",
      "rating": "5"
    },
    {
      "title": "HP's best collection is Omni Book.",
      "body": "I used many pc & laptops and MacBook but this is the best omnibook in my collection another one it is price more reasonable for other laptops",
      "rating": "5"
    },
    {
      "title": "Omnibook 14' 2 in 1 flip laptop",
      "body": "Light weight & the perfect size to take with you. Display screen is very clear & vibrant, easy on the eyes. Keypad is smooth to use. An excellent purchase.",
      "rating": "5"
    },
    {
      "title": "Excellent product",
      "body": "I have no complaints about this product, it is comfortable to use, its tablet version is great, a very good purchase",
      "rating": "5"
    },
    {
      "title": "Great laptop for college",
      "body": "Looking forward to using in college! Long battery life, solid touchscreen, fast processing. Great for regular use.",
      "rating": "5"
    },
    {
      "title": "Laptop",
      "body": "Great laptop for personal use or school. I would definitely buy again . I love the flip and touchscreen feature",
      "rating": "5"
    },
    {
      "title": "Great Buy!!",
      "body": "This laptop is a speed demon, and the touchscreen is incredibly responsive. I'm really happy with it so far.",
      "rating": "5"
    },
    {
      "title": "Great PC for a Good price",
      "body": "This PC has been powerful and efficient. I enjoy the vivid colors on the screen and the fast processor.",
      "rating": "5"
    },
    {
      "title": "What a steal!",
      "body": "Excellent laptop.  Exactly what I was looking for as far as memory and speed, at a great price!  I personally like the slightly larger key pad as well.",
      "rating": "5"
    },
    {
      "title": "Useful for school and streaming",
      "body": "Liking it so far! It’s lightweight, easy to manage for school, runs fast, and the battery lasts through hours of studying and streaming.",
      "rating": "5"
    },
    {
      "title": "Omnibook X - Fantastic product!",
      "body": "Great product! Received it in one day which made it even better. No trouble setting it up either. Overall 10/10 purchase",
      "rating": "5"
    },
    {
      "title": "Great computer for a great price.",
      "body": "We were in the market for a laptop for our son, who is heading off to college. This is a great computer for a good price.",
      "rating": "5"
    },
    {
      "title": "HP Omnibook",
      "body": "Great computer to replace my 15 year old HP!! So many nice features which I am using",
      "rating": "5"
    },
    {
      "title": "Awesome laptop!",
      "body": "My son was thrilled beyond belief! He loved this laptop for college engineering!",
      "rating": "5"
    },
    {
      "title": "Good laptop and service at bestbuy",
      "body": "Good product overall so far. No issues.\n\nWill provide another feedback may be in a year if  needed.\n\nGenerally have been satisfied with hp laptops at bestbuy.\n\nThank you !",
      "rating": "4"
    },
    {
      "title": "Nice Laptop!",
      "body": "Light and portable!  Clean feel to the keyboard, bright with good graphics.",
      "rating": "5"
    },
    {
      "title": "Laptop",
      "body": "So far so good!!  My 1st laptop and I am very pleased.  It is compact and user friendly.  Would highly recommend!",
      "rating": "5"
    },
    {
      "title": "New HP Computer",
      "body": "The computer is great.  It was extremely easy to set up. I wasn’t expecting the microsoft suite to be included but it was.  Working fine, meets and exceeds all expectations.",
      "rating": "4"
    },
    {
      "title": "Great Laptop",
      "body": "Great Laptop at an amazing price. Will recommend others as well.",
      "rating": "5"
    },
    {
      "title": "Excellent service and product!!",
      "body": "Excellent suggestion by the seller at the store! Bought the HP as suggested and excellent laptop!!",
      "rating": "5"
    },
    {
      "title": "Great laptop!",
      "body": "Great laptop! Has everything I need for work and personal use.",
      "rating": "5"
    },
    {
      "title": "Best laptop",
      "body": "Absolutely Love this laptop , it has everything I need for my business & personal use..!!",
      "rating": "5"
    },
    {
      "title": "Great laptop!",
      "body": "Light weight, fast and great screen color.  Don't know why I waited so long to get it!",
      "rating": "5"
    },
    {
      "title": "Laptop",
      "body": "I honestly really love the display, it’s super interactive but also not too overwhelming.",
      "rating": "5"
    },
    {
      "title": "Good for the price",
      "body": "The laptop is so handy and slim and good for the price",
      "rating": "5"
    },
    {
      "title": "Feeling good",
      "body": "Very sleek and comfortable to work for some long time.",
      "rating": "5"
    },
    {
      "title": "HP Omni Flex",
      "body": "So far the laptop seems really powerful and intuitive.",
      "rating": "5"
    },
    {
      "title": "Amazing Laptop",
      "body": "This is an excellent PC. Operation is amazingly fast.",
      "rating": "5"
    },
    {
      "title": "Great Laptop! Does it ALL",
      "body": "Great Device!! Just what my son needed for college!",
      "rating": "5"
    },
    {
      "title": "Nice",
      "body": "So far very nice laptop, fast and perfect size with lighted keyboard.",
      "rating": "5"
    },
    {
      "title": "Good for a college student",
      "body": "Easy to use. We got it during the Memorial Day sale. Good value for the memory.",
      "rating": "5"
    },
    {
      "title": "good laptop",
      "body": "i like the laptop its nice and fast and it is perfect for college",
      "rating": "5"
    },
    {
      "title": "my Experience",
      "body": "I'm enjoying my Hp laptop, learning a lot and improving my skills as well as knowledge",
      "rating": "5"
    },
    {
      "title": "Bob",
      "body": "Was a good experience. Salesperson and installer were great.  I'm happy.",
      "rating": "5"
    },
    {
      "title": "Product experience",
      "body": "Very portable. Fast and power efficient. Good for casual game not crazy.",
      "rating": "5"
    },
    {
      "title": "Hp laptop",
      "body": "Excellent purchase!! Great service at sawgrass service centre",
      "rating": "5"
    },
    {
      "title": "Laptop to look out",
      "body": "Great device to use and buy for working on Adobe photo",
      "rating": "5"
    },
    {
      "title": "My HP Laptop",
      "body": "Love, Love, Love this laptop! So sleek and so fast and love the color!",
      "rating": "5"
    },
    {
      "title": "NGO REPRESENTATIVE AT THE UN- NY",
      "body": "I am happy with my purchase. After some time setting it up, it is working well.",
      "rating": "5"
    },
    {
      "title": "Great little machine",
      "body": "Has worked perfectly - Very quick and responsive. Love it.",
      "rating": "5"
    },
    {
      "title": "New Laptop",
      "body": "Love the BIG keys on the keyboard. Tried an HP product this time.",
      "rating": "5"
    },
    {
      "title": "Great value!",
      "body": "Excellent value!  Quick, responsive and lightweight",
      "rating": "5"
    },
    {
      "title": "Great except for AI and OneDrive",
      "body": "PC was fast and easy to get setup and runs quick and smooth.  I'm not a fan of the OneDrive and AI settings, and had to figure out ways to turn those off.  But otherwise PC is great.",
      "rating": "4"
    },
    {
      "title": "HP Omnibook X",
      "body": "By wife really like’s the lap top. The battery life is great.",
      "rating": "5"
    },
    {
      "title": "Hp laptop",
      "body": "Great laptop to get. Highly suggested. Fast great purchase",
      "rating": "5"
    },
    {
      "title": "HD",
      "body": "Love it, Is exactly what I was looking for. I used a lot",
      "rating": "5"
    },
    {
      "title": "The best is the best",
      "body": "I bought this item that is amazing everything is good",
      "rating": "5"
    },
    {
      "title": "Great Value",
      "body": "Purchased during the Memorial Day sale and got an awesome deal!",
      "rating": "5"
    },
    {
      "title": "HP Laptop",
      "body": "It is a recent purchase, but so far, I really like this laptop.",
      "rating": "5"
    },
    {
      "title": "laptop",
      "body": "Missing some features of my previous computer like up and down buttons.  Screen is beautiful !",
      "rating": "4"
    },
    {
      "title": "Excellent",
      "body": "Excellent good quality and battery life I highly recommend",
      "rating": "5"
    },
    {
      "title": "Nice small laptop",
      "body": "I have only had it a week. I like that the screen folds down almost flat. I wish it were a bit lighter.",
      "rating": "4"
    },
    {
      "title": "Classy",
      "body": "Really liked the product. It looks classy and stylish.",
      "rating": "5"
    },
    {
      "title": "Needed a new laptop.",
      "body": "So far so good!  Great size and has everything I need.",
      "rating": "5"
    },
    {
      "title": "Mouseless",
      "body": "Great laptop, touch screen is cool, but I prefer a mouse. Getting use to it though.",
      "rating": "4"
    },
    {
      "title": "Review",
      "body": "This item does everything that I needed in a laptop\nThe sales person was very help full",
      "rating": "4"
    },
    {
      "title": "Great performance and convinient carry on.",
      "body": "Great performance, battery is awsome. Also very convinient to carry on due to the perfect size.",
      "rating": "4"
    },
    {
      "title": "Laptop review",
      "body": "The laptop is heavier than I expected. Very fast and efficient.",
      "rating": "4"
    },
    {
      "title": "Great laptop",
      "body": "Great laptop for school work and or editing pictures or videos!",
      "rating": "4"
    },
    {
      "title": "Daughter loves it.",
      "body": "Perfect for what my daughter was looking for! Great for the price.",
      "rating": "4"
    },
    {
      "title": "Laptop",
      "body": "Update takes a long time, had to wait over an hour for update to finish, then had to manually change date and time",
      "rating": "3"
    },
    {
      "title": "HP laptop",
      "body": "Love the larger keys now that we are getting older. The speed in which it downloads is so much faster than I imagined. I also like the lightness of the computer. Easy to carry and that it flips over and you can use it like a phone is great.",
      "rating": "1"
    },
    {
      "title": "Perfect quality",
      "body": "Quick Proccesser good for high level activty and tasks. LCD touchscreen makes it easier to use.",
      "rating": "5"
    },
    {
      "title": "HP OmniBook",
      "body": "Just purchased this HP OmniBook yesterday. Received by the shipping and handling of Best Buy panters. So far seems to be what I desire not my wants. Want is a whim, desire is felt. One of the best computers I've own.",
      "rating": "5"
    },
    {
      "title": "Nice",
      "body": "Nice i like it, but my fingers are printed on the outer saurface whenever i hold it",
      "rating": "4"
    }
  ]
}